         MACRO                                                          PD006500
&NAME    ACE   &DUMMY                                                   PD006510
*********************************************************************** PD006520
*        ACE - ARITHMETIC CALCULATION ELEMENT                         * PD006530
*********************************************************************** PD006540
         SPACE 1                                                        PD006550
*        DEFINE A SINGLE ELEMENT OF A GR07 CALCULATION                  PD006560
         SPACE 1                                                        PD006570
ACENTRY  DSECT                                                          PD006580
ACEID    DS    0CL1                CONTROL BLOCK IDENTIFIER             PD006590
ACEACE   DS    F                   ADDRESS OF NEXT ASSOCIATED ACE       PD006600
ACELIB   DS    F                   ADDRESS OF LIB OF FIELD TO BE PROC   PD006610
ACELABL  DS    CL2                 LABEL OF FIELD TO BE PROCESSED       PD006620
ACEOPCD  DS    CL1                 INTERNAL REPRESENTATION OF OPERATN   PD006630
ACESW    DS    CL1                 SWITCH BYTE                          PD006640
ACELGTH  EQU   *-ACENTRY           LENGTH OF DSECT                      PD006650
ACELIT   DS    CL8                 LITERAL VALUE IN FLOATING POINT FORM PD006660
         SPACE 5                                                        PD006670
MACELIT  EQU   1                   DEFINES LITERAL VALUE                PD006680
MACENEG  EQU   2                   MULTIPLY BY (-1) PRIOR TO USE        PD006690
         MEND                                                           PD006700
