         MACRO                                                          BM010690
&NAME    BLANK &P1,&LEN,&SKIP                                           BM010700
         LCLC  &L,&R,&LL                                                BM010710
         AIF   ('&NAME' EQ '').A00                                      BM010720
&NAME    DS    0H 0                ENSURE ALIGNMENT                     BM010730
.A00     AIF   ('&P1'(1,1) NE '(').A01                                  BM010740
&R       SETC  '&P1(1)'                                                 BM010750
         AGO   .A02                                                     BM010760
.A01     AIF   ('&P1' EQ '').A011                                       BM010770
         MVI   &P1,C' ' 0          INSERT LEADING BLANK                 BM010780
&LL      SETC  'L''&P1'                                                 BM010790
         MVC   &P1.+1(&LL.-1),&P1 0 AND PROPAGATE SPACES                BM010800
.A011    L     R1,&P1.+IOPSRECA 0  GET BUFFER ADDRESS                   BM010810
&R       SETC  'R1'                                                     BM010820
.A02     ANOP                                                           BM010830
&L       SETC  '&LEN'                                                   BM010840
         AIF   ('&LEN' NE '').A03                                       BM010850
&L       SETC  '133'                                                    BM010860
.A03     MVI   0(&R),C' ' 0        MOVE SPACE TO START OF RECORD        BM010870
         MVC   1(&L.-1,&R),0(&R) 0 PROPAGATE SPACES                     BM010880
         AIF   ('&SKIP' NE '').A04                                      BM010890
         MEXIT                                                          BM010900
.A04     MVI   0(&R),&SKIP ^       MOVE IN SKIP CHATACTER               BM010910
         MEND                                                           BM010920
