         MACRO                                                          BD009610
&NAME    CB20  &DUMMY                                                   BD009620
*********************************************************************** BD009630
*        FORMAT OF MS20 CONTROL BLOCK                                 * BD009640
*********************************************************************** BD009650
         SPACE 1                                                        BD009660
*        THIS C/B IS COMMON TO ISAM & RIGAM FILES, & INTERNAL TABLES    BD009670
         SPACE 1                                                        BD009680
CB20NTRY DSECT                     ISAM FILL KEY CONSTRUCTION           BD009690
CB20FLAG DS    0CL1                CONTROL BLOCK FLAG                   BD009700
CB20CB20 DS    F                   ADDRESS OF NEXT CB2X/CB3X            BD009710
CB20TID  DS    CL2                 TEST ID ( LABEL )                    BD009720
CB20CCNO DS    PL2                 CONTROL CARD SEQUENCE NUMBBER        BD009730
CB20CB21 DS    F                   ADDRES  OF 1ST CB21 C/B              BD009740
CB20POOL DS    F                   ADDR OF LITERAL POOL OF KEY COMPONS  BD009750
CB20TKEY DS    F                   ADDRESS OF CURRENT KEY               BD009760
CB20LKEY DS    F                   ADDRESS OF PREVIOUS KEY              BD009770
CB20DCBS DS    0CL28               I/O CONTROL BLOCK ( DCBSW )          BD009780
CB20ISW  DS    CL1                 I/O COMTROL SWITCH                   BD009790
         DS    CL1                 EOF INDICATOR ( UNUSED )             BD009800
CB20XORY DS    CL1                 RESULT OF IS LOOKUP                  BD009810
         DS    CL1                 UNDEFINED IN DCBSW                   BD009820
CB20IDCB DS    F                   ADDRESS OF DCB                       BD009830
CB20IDDN DS    0CL8                DDNAME ( FOR I/S ONLY )              BD009840
CB20RFNO DS    CL2                 FILE NUMBER                          BD009850
CB20RFID DS    CL3                 RIGAM FILE ID                        BD009860
CB20RFLN DS    CL3                 RIGAM RECORD LENGTH                  BD009870
CB20IREC DS    F                   ADDRESS OF CURRENT RECORD S/A        BD009880
CB20ICNT DS    PL4                 RECORD COUNT                         BD009890
CB20I4SA DS    F                   SAVE AREA FOR REG 4                  BD009900
CB20BADR DS    F                   ADDRESS OF CURRENT REC IN BUFFER     BD009910
CB20SW   DS    CL1                 SWITCH BYTE                          BD009920
CB20KLEN DS    CL1                 KEY LENGTH                           BD009930
CB20FLD1 DS    0CL3                DESCRIPTION OF 1ST KEY COMPONENT     BD009940
CB20POS  DS    CL1                 POSN OF COMPONENT IN SOURCE          BD009950
CB20LEN  DS    CL1                 LGTH OF COMPONENT IN SOURCE          BD009960
CB20TYP  DS    CL1                 NATURE OF SOURCE ( B/C, D/C, LITERL) BD009970
CB20FLD2 DS    CL3                 AS CB20POS - CB20TYP                 BD009980
CB20FLD3 DS    CL3                 AS CB20POS - CB20TYP                 BD009990
CB20FLD4 DS    CL3                 AS CB20POS - CB20TYP                 BD010000
CB20FLD5 DS    CL3                 AS CB20POS - CB20TYP                 BD010010
CB20FLD6 DS    CL3                 AS CB20POS - CB20TYP                 BD010020
CB20FLD7 DS    CL3                 AS CB20POS - CB20TYP                 BD010030
CB20FLD8 DS    CL3                 AS CB20POS - CB20TYP                 BD010040
CB20LGTH EQU   *-CB20NTRY          LENGTH OF BASIC DSECT                BD010050
         SPACE 5                                                        BD010060
SW20IS   EQU   1                   ON = ISAM / OFF = RIGAM              BD010070
         MEND                                                           BD010080
