         MACRO                                                          BD012230
&NAME    CB40  &DUMMY                                                   BD012240
*********************************************************************** BD012250
*        FORMAT OF MS40 CONTROL BLOCK                                 * BD012260
*********************************************************************** BD012270
         SPACE 1                                                        BD012280
CB40NTRY DSECT                     DEFINE CB13 SUBROUTINE               BD012290
CB40FLAG DS    0CL1                CONTROL BLOCK ID                     BD012300
CB40CB40 DS    F                   ADDRESS OF NEXT CBXX                 BD012310
CB40TID  DS    CL2                 SUBROUTINE NAME ( LABEL )            BD012320
CB40CCNO DS    PL2                 CONTROL CARD SEQUENCE NUMBBER        BD012330
CB40SW   DS    CL1                 SWITCH BYTE                          BD012340
         DS    CL1                 UNUSED                               BD012350
CB40FRST DS    F                   ADDRESS OF 1ST CB13 IN RUTINE        BD012360
CB40LAST DS    F                   ADDRESS OF LAST CB13 IN ROUTINE      BD012370
CB40LGTH EQU   *-CB40NTRY          LENGTH OF CONTROL BLOCK              BD012380
         MEND                                                           BD012390
