         MACRO                                                          PM007730
&NAME    CHNCB &CB,&A                                                   PM007740
.*                                                                      PM007750
.*       SET CURRENT C/B POINTERS ( IN CCB ) TO POINT AT CHAIN ADDRESSE PM007760
.*        IN THIS C/B TO FACILITATE CHAINING OF DEPENDENT C/B'S         PM007770
.*                                                                      PM007780
         LCLA  &CNT,&LMIT,&L,&D                                         PM007790
         LCLC  &CC,&CC2                                                 PM007800
&LMIT    SETA  N'&SYSLIST                                               PM007810
         AIF   (&LMIT GT 1).A00                                         PM007820
         MNOTE 1,'INSUFFICIENT OPERANDS'                                PM007830
         MEXIT                                                          PM007840
.A00     ANOP                                                           PM007850
&CNT     SETA  1                                                        PM007860
.A01     ANOP                                                           PM007870
&CNT     SETA  &CNT+1                                                   PM007880
         AIF   ('&CNT' GT '&LMIT').A02                                  PM007890
&CC      SETC  '&SYSLIST(&CNT)'                                         PM007900
&L       SETA  K'&SYSLIST(&CNT)                                         PM007910
&D       SETA  &L-2                                                     PM007920
&CC2     SETC  '&CC'(&D,3)                                              PM007930
         AIF   ('&SYSECT'(1,6) EQ 'PARROT').A03
&CC2     SETC  '&CC'
.A03     ANOP
         LA    R1,&CB&CC           POINT AT CHAIN ADDRESS WITHIN C/B    PM007940
         ST    R1,$PTR&CC2         PRESERVE AS CURRENT TO FACILITATE CH PM007950
         AGO   .A01                                                     PM007960
.A02     MEND                                                           PM007970
