         MACRO                                                          BD013740
&NAME DETAILBB &DUMMY                                                   BD013750
*********************************************************************** BD013760
*        FORMAT OF DETAIL LINE OF B/B REPORT                          * BD013770
*********************************************************************** BD013780
         SPACE 1                                                        BD013790
DETAILBB DSECT                                                          BD013800
DTBBCC   DS    CL1                 CARRIAGE CONTROL CHARACTER           BD013810
         DS    CL2                 USED FOR CARD NO IF MORE THAN 4 DIGT BD013820
DTBBCNO  DS    CL4                 CARD NUMBER                          BD013830
         DS    CL5                 SPACES                               BD013840
DTBBCARD DS    CL80                CARD IMAGE                           BD013850
         DS    CL3                 SPACES                               BD013860
DTBBEMSS DS    CL30                ERROR MESSAGE                        BD013870
         DS    CL3                 SPACES                               BD013880
DTBBFLAG DS    CL4                 ERROR FLAG (****)                    BD013890
         DS    CL1                 SPACES                               BD013900
DTBBLGTH EQU   *-DETAILBB          LENGTH OF DSECT                      BD013910
         SPACE 5                                                        BD013920
*********************************************************************** BD013930
*        FORMAT OF TOTAL LINE OF B/B REPOTT                           * BD013940
*********************************************************************** BD013950
         SPACE 1                                                        BD013960
         ORG   DTBBCC              REDEFINE TO SATRT OF LINE            BD013970
TTBBCC   DS    CL1                 CARRIAGE CONTROL CHARACTER           BD013980
TTBBTEXT DS    CL11                DESCRIPTION OF LINE'S CONTENTS       BD013990
TTBBCNT  DS    CL8                 RECORD COUNT VALUE / HEADING         BD014000
TTBBFLD1 DS    0CL19               TOTAL LINE BUCKET                    BD014010
TTBBFLD  DS    CL16                1ST BUCKET VALUE / HEADING           BD014020
         DS    CL3                 UNUSED ( SPACES )                    BD014030
TTBBFLD2 DS    CL19                2ND TOTAL LINE BUCKET                BD014040
TTBBFLD3 DS    CL19                3RD TOTAL LINE BUCKET                BD014050
TTBBFLD4 DS    CL19                4TH TOTAL LINE BUCKET                BD014060
TTBBFLD5 DS    CL19                5TH TOTAL LINE BUCKET                BD014070
TTBBFLD6 DS    CL16                6TH TOTAL LINE BUCKET                BD014080
         DS    CL2                 UNUSED ( SPACES )                    BD014090
TTBBLGTH EQU   *-DETAILBB          LENGTH OF DSECT                      BD014100
         MEND                                                           BD014110
