         MACRO                                                          PC000870
&NAME    GR03  &DUMMY                                                   PC000880
*********************************************************************** PC000890
*        FORMAT OF GR03 CONTROL CARDS                                 * PC000900
*********************************************************************** PC000910
         SPACE 1                                                        PC000920
*        SPECIFY THE KEEY FIELDS                                        PC000930
         SPACE 1                                                        PC000940
GR03CARD DSECT                                                          PC000950
GR03ID   DS    CL4                 CARD ID ('GR03')                     PC000960
GR03KEY1 DS    0CL19               1ST KEY DEFINITION                   PC000970
GR03POS  DS    CL3                 POSN OF KEY FIELD                    PC000980
GR03LEN  DS    CL2                 LGTH OF KEY FIELD                    PC000990
GR03TYP  DS    CL1                 TYPE OF KEY FIELD                    PC001000
*                                   ' ' - UNPACKED NUMERIC              PC001010
*                                   'N' - UNPACKED NUMERIC              PC001020
*                                   'C' - CHARACTER                     PC001030
*                                   'P' - PACKED DECIMAL                PC001040
*                                   'X' - HEXADECIMAL                   PC001050
GR03TOT  DS    CL1                 TOTAL BREAK INDICATOR                PC001060
*                                   ' ' - NO TOTAL BREAK                PC001070
*                                   'N' - NO TOTAL BREAK                PC001080
*                                   'Y' - TOTAL BREAK                   PC001090
GR03PSKP DS    CL1                 PAGE SKIP INDICATOR                  PC001100
*                                   ' ' - NO PAGE SKIP                  PC001110
*                                   'N' - NO PAGE SKIP                  PC001120
*                                   'Y' - PAGE SKIP ON TOTAL BREAK      PC001130
*                                   'R' - PAGESKIP & RESET PAGE COUNTER PC001140
GR03NPOS DS    CL3                 POSN O ASSOC NAME FIELD              PC001150
GR03NLEN DS    CL2                 LGTH O ASSOC NAME FIELD              PC001160
GR032080 DS    CL1                 TWENTY-80 INDICATOR ( KEY 1 ONLY )   PC001170
*                                   ' ' - NO TWENTY-80 REQUIRED         PC001180
*                                   'N' - NO TWENTY-80 REQUIRED         PC001190
*                                   'Y' - TWENTY-80 REQUIRED            PC001200
GR03PLIM DS    CL2                 PAGE LIMIT ( 1ST KEY ONLY )          PC001210
         ORG   GR032080            REDEFINE FOF ALL BUT 1ST KEY         PC001220
         DS    CL4                 UNUSED                               PC001230
GR03KLBL DS    CL2                 (OPTIONAL) LABEL ASSOC WITH KEY FIEL PC001240
GR03KEY2 DS    CL19                AS GR03POS - GR03NLEN                PC001250
GR03KEY3 DS    CL19                AS GR03POS - GR03NLEN                PC001260
GR03KEY4 DS    CL19                AS GR03POS - GR03NLEN                PC001270
GR03LGTH EQU   *-GR03CARD          LENGTH OF DSECT                      PC001280
         SPACE 5                                                        PC001290
*        IF THE FIRST POSITION OF A KEY DEFINITION BUCKET CONTAINS '*', PC001300
*         THEN THE BUCKET IS TREATED AS A COMMENT.                      PC001310
*        KEY DEFINITION MAY BE DEFERRED BY SPECIFYING 'FLDXX' IN PLACE  PC001320
*         OF THE  FIELD'S PPPLL.                                        PC001330
         MEND                                                           PC001340
