         MACRO                                                          PC003850
&NAME    GR40  &DUMMY                                                   PC003860
*********************************************************************** PC003870
*        FORMAT OF GR40 CONTROL CARD                                  * PC003880
*********************************************************************** PC003890
         SPACE 1                                                        PC003900
*        DEFINE THE START OF A SUB-ROUTINE OF GR07/13 CONTROL CARDS     PC003910
         SPACE 1                                                        PC003920
GR40CARD DSECT                                                          PC003930
GR40ID   DS    CL4                 CARD ID ( 'GR40' )                   PC003940
GR40FID  DS    CL2                 NAME OF SUB-ROUTINE                  PC003950
         DS    CL74                UNUSED                               PC003960
GR40LGTH EQU   *-GR40CARD          LENGTH OF DSECT                      PC003970
         MEND                                                           PC003980
