         MACRO                                                          PC004000
&NAME    GR41  &DUMMY                                                   PC004010
*********************************************************************** PC004020
*        FORMAT OF GR41 CONTROL CARD                                  * PC004030
*********************************************************************** PC004040
         SPACE 1                                                        PC004050
*        DEFINE THE END OF A SUB-ROUTINE OF GR07/13 CONTROL CARDS       PC004060
         SPACE 1                                                        PC004070
GR41CARD DSECT                                                          PC004080
GR41ID   DS    CL4                 CARD ID ( 'GR41' )                   PC004090
GR41FID  DS    CL2                 NAME OF SUB-ROUTINE                  PC004100
         DS    CL74                UNUSED                               PC004110
GR41LGTH EQU   *-GR41CARD          LENGTH OF DSECT                      PC004120
         MEND                                                           PC004130
