         MACRO                                                          PD018230
&NAME    JCL   &DUMMY                                                   PD018240
*********************************************************************** PD018250
*        JCL - JCL STATEMENT CONTROL LINKAGE                          * PD018260
*********************************************************************** PD018270
         SPACE 1                                                        PD018280
JCLNTRY  DSECT                                                          PD018290
JCLID    DS    0CL1                CONTROL BLOCK IDENTIFIER             PD018300
JCLJCL   DS    F                   ADDRESS OF NEXT JCL                  PD018310
JCLSW    DS    CL1                 SWITCH BYTE                          PD018320
         DS    CL1                 UNUSED                               PD018330
JCLLEN   DS    H                   LENGTH OF DD STATEMENT               PD018340
JCLCARD  EQU   *                   VARIABLE LENGTH DD STATEMENT         PD018350
JCLLGTH  EQU   *-JCLNTRY           LENGTH OF BASIC C/B                  PD018360
         SPACE 5                                                        PD018370
         MEND                                                           PD018380
