         MACRO                                                          BC003130
&NAME    MS14  &DUMMY                                                   BC003140
*********************************************************************** BC003150
*        FORMAT OF MS14 CONTROL CARD                                  * BC003160
*********************************************************************** BC003170
         SPACE 1                                                        BC003180
*        DESCRIBES A SERIES OF INDICATOR TESTS WHICH, IF NOT SATISFIED, BC003190
*         WILL CAUSE EITHER THE OVERALL BATCH OR AN INDIVIDUAL RECORD   BC003200
*         TO BE FLAGGED WITH AN ERROR.                                  BC003210
*        THE TESTS APPLY EITHER TO THE PRECEDING MS02 CARD ( WHEN IT    BC003220
*         APPLIES TO THE WHHOLE BATCH ) OR TO THE PRECEDING MS11/12     BC003230
*         CARD ( WHEN IT APPLIES TO A SINGLE RECORD ), WHICHEVER WAS    BC003240
*         THE MOST RECENT.                                              BC003250
*        NOTE THAT IF ALL THE RELATIONSHIPS SPECIFIED IN THIS CARD ARE  BC003260
*         SATISFIED, THEN THE RECORD HAS FAILED THE COMPOSITE TEST, AND BC003270
*         IS IN ERROR.                                                  BC003280
         SPACE 1                                                        BC003290
MS14CARD DSECT                                                          BC003300
MS14ID   DS    CL4                 CARD ID ('MS14')                     BC003310
MS14ERRI DS    CL1                 RESULT INDICATOR                     BC003320
*                                   ' ' - HARD ERROR                    BC003330
*                                   '1' - SOFT ERROR                    BC003340
*                                   '2' - DELETE RECORD ('D' ONLY )     BC003350
*                                   '3' - SET INDICATOR ONLY            BC003360
MS14RIND DS    CL2                 RESULT INDICATOR                     BC003370
MS14TST0 DS    0CL4                DEFINE 1ST INDICATOR TEST            BC003380
MS14IND  DS    CL2                 INDICATOR TO BE TESTED               BC003390
MS14ONOF DS    CL2                 REQUIRED IND STATUS ( ON / OF )      BC003400
MS14TST1 DS    CL4                 AS MS14IND - MS14ONOF                BC003410
MS14TST2 DS    CL4                 AS MS14IND - MS14ONOF                BC003420
MS14TST3 DS    CL4                 AS MS14IND - MS14ONOF                BC003430
MS14TST4 DS    CL4                 AS MS14IND - MS14ONOF                BC003440
MS14TST5 DS    CL4                 AS MS14IND - MS14ONOF                BC003450
MS14TST6 DS    CL4                 AS MS14IND - MS14ONOF                BC003460
MS14TST7 DS    CL4                 AS MS14IND - MS14ONOF                BC003470
MS14TST8 DS    CL4                 AS MS14IND - MS14ONOF                BC003480
MS14PFLD DS    CL2                 POSN OF FIELD TO BE UNDERLINED (OPT) BC003490
MS14LFLD DS    CL2                 LGTH OF FIELD TO BE UNDERLINED (OPT) BC003500
MS14BORD DS    CL1                 LEVEL INDICATOR:                     BC003510
*                                   'B' - APPLIES TO TOTAL BATCH        BC003520
*                                   'D' - APPLIES TO SINGLE RECORD      BC003530
*                                   ' ' - APPLIES TO SINGLE RECORD      BC003540
*                                   'C' - BATCH LEVEL, BUT IN MS13 SEQ  BC003550
         DS    CL2                 UNUSED                               BC003560
MS14MESS DS    CL30                OPTIONAL ERROR MESSAGE               BC003570
MS14LGTH EQU   *-MS14CARD          LENGTH OF SDECT                      BC003580
         MEND                                                           BC003590
