         MACRO                                                          BC003610
&NAME    MS15  &DUMMY                                                   BC003620
*********************************************************************** BC003630
*        FORMAT OF MS15 CONTROL CARD                                  * BC003640
*********************************************************************** BC003650
         SPACE 1                                                        BC003660
*        DESCRIBES A SINGLE FIELD IN A DETAIL RECORD AGAINST WHICH      BC003670
*         OTHER FIELDS IN THE SAME RECORD ARE TO BE BALANCED.           BC003680
         SPACE 1                                                        BC003690
MS15CARD DSECT                                                          BC003700
MS15ID   DS    CL4                 CARD ID ('MS15')                     BC003710
MS15FNO  DS    CL2                 FIELD NAME ( LABEL )                 BC003720
MS15POS  DS    CL3                 POSN OF FIELD IN INPUT               BC003730
MS15LEN  DS    CL2                 LGTH OF FIELD IN INPUT               BC003740
MS15NDEC DS    CL1                 NO OF IMPILED DECIMALS               BC003750
MS15ABID DS    CL1                 TOTALLING TYPE :-                    BC003760
*                                   ' ' - ALGEBRAIC                     BC003770
*                                   '1' - BALANCING                     BC003780
MS15ERRI DS    CL1                 ERROR INDICATOR :-                   BC003790
*                                   ' ' - HARD ERROR                    BC003800
*                                   '1' - SOFT ERROR                    BC003810
*                                   '2' - DELETE RECORD IN ERROR        BC003820
*                                   '3' - SET INDICATOR ONLY            BC003830
MS15NEGI DS    0CL11               DEFINITION OF -VE INDICATOR          BC003840
MS15PNEG DS    CL3                 POSN OF NEGATIVE INDICATOR           BC003850
MS15LNEG DS    CL1                 LGTH OF NEGATIVE INDICATOR           BC003860
MS15IDNG DS    CL7                 LITERAL NEGATIVE INDICATOR           BC003870
MS15RIND DS    CL2                 RESULT INDICATOR                     BC003880
MS15PACK DS    CL1                 PACK FLAG                            BC003890
*                                   'P' - INPUT IS PACKED DECIMAL       BC003900
*                                   ' ' - INPUT ISDISPLAY NUMERIC       BC003910
MS15ABS  DS    CL1                 ABSOLUTE INDICATOR                   BC003920
*                                   'A' - MODULUS TOTAL                 BC003930
*                                   ' ' - ALGEBRAIC TOTAL               BC003940
         DS    CL21                UNUSED                               BC003950
MS15MESS DS    CL30                OPTIONAL ERROR MESSAGE               BC003960
MS15LGTH EQU   *-MS15CARD          LENGTH OF DSECT                      BC003970
         MEND                                                           BC003980
