         MACRO                                                          BC004000
&NAME    MS16  &DUMMY                                                   BC004010
*********************************************************************** BC004020
*        FORMAT OF MS16 CONTROL CARD                                  * BC004030
*********************************************************************** BC004040
         SPACE 1                                                        BC004050
*        DESCRIBES FIELDS WHICH ARE TO BE BALANCED AGAINST ANOTHER      BC004060
*         FIELD IN THE SAME CARD DEFINED BY AN MS15 CAONTROL CARD.      BC004070
         SPACE 1                                                        BC004080
MS16CARD DSECT                                                          BC004090
MS16ID   DS    CL4                 CARD ID ('MS16')                     BC004100
MS16FNO  DS    CL2                 NAME OF ASSOC CONTROL FIELD (        BC004110
MS16FLD0 DS    0CL17               DEFINITION OF 1ST FIELD              BC004120
MS16POS  DS    CL3                 POSN OF FIELD IN INPUT               BC004130
MS16LEN  DS    CL2                 LGTH OF FIELD IN INPUT               BC004140
MS16NDEC DS    CL1                 NO OF ( IMPLIED ) DECIMALS           BC004150
MS16PNEG DS    CL3                 POSN OF NEGATINE INDICATOR           BC004160
MS16LNEG DS    CL1                 LGTH OF NEGATINE INDICATOR           BC004170
MS16IDNG DS    CL7                 LITERAL NEGATINE INDICATOR           BC004180
         ORG   *-2                 RESET COUNTER FOR REDEFINITION       BC004190
MS16PACK DS    CL1                 PACK FLAG                            BC004200
*                                   'P' - INPUT IS PACKED DECIMAL       BC004210
*                                   ' ' - INPUT IS DISPLAY NUMERIC      BC004220
MS16ABS  DS    CL1                 ABSOLUTE INDICATOR                   BC004230
*                                   'A' - MODULUS TOTAL REQUIRED        BC004240
*                                   ' ' - ALGEBRAIC TOTAL RESUIRED      BC004250
MS16FLD1 DS    CL17                AS MS16POS - MS16IDNG                BC004260
MS16FLD2 DS    CL17                AS MS16POS - MS16IDNG                BC004270
MS16FLD3 DS    CL17                AS MS16POS - MS16IDNG                BC004280
         DS    CL6                 UNUSED                               BC004290
MS16LGTH EQU   *-MS16CARD          LENGTH OF DESECT                     BC004300
         MEND                                                           BC004310
