         MACRO                                                          BC005140
&NAME    MS30  &DUMMY                                                   BC005150
*********************************************************************** BC005160
*        FORMAT OF MS30 CONTROL CARD                                  * BC005170
*********************************************************************** BC005180
         SPACE 1                                                        BC005190
*        DESCRIBES THE RANGES FORR A TEST SPECIFIED IN AN MS13 CARD,    BC005200
*         OR CONTAINS THE LITERAL AGAINST WHICH TO TEST                 BC005210
         SPACE 1                                                        BC005220
MS30CARD DSECT                                                          BC005230
MS30ID   DS    CL4                 CARD ID ('MS30')                     BC005240
MS30TID  DS    CL2                 TEST IDENTIFIER ( LABEL )            BC005250
MS30RID  DS    CL1                 RANGE TYPE :-                        BC005260
*                                   ' ' - CHARACTER (LEFT-ADJUSTED)     BC005270
*                                   'N' - NUMERIC (RIGHT-ADJUSTED)      BC005280
MS30TYPE DS    CL1                 COMPARISON TYPE :-                   BC005290
*                                   ' ' - R1 <= FLD <= R2               BC005300
*                                   'X' R1 < R2 & FLD < R1 | R2 < FLD   BC005310
MS30RNG1 DS    CL16                RANGE 1 ( START )                    BC005320
MS30RNG2 DS    CL16                RANGE I ( END )                      BC005330
         DS    CL40                UNUSED                               BC005340
MS30LGTH EQU   *-MS30CARD          LENGTH OF DSECT                      BC005350
         MEND                                                           BC005360
