         MACRO                                                          BC006480
&NAME    MS34  &DUMMY                                                   BC006490
*********************************************************************** BC006500
*        FORMAT OF MS34 CONTROL CARD                                  * BC006510
*********************************************************************** BC006520
         SPACE 1                                                        BC006530
*        CONTAINS A LIST OF VALID VALUES FOR A FIELD DEFINED IN AN      BC006540
*         MS13 CONTROL CAD.                                             BC006550
         SPACE 1                                                        BC006560
MS34CARD DSECT                                                          BC006570
MS34ID   DS    CL4                 CARD ID ('MS34')                     BC006580
MS34TID  DS    CL2                 TEST ID ( LABEL ) SPECIFIED IN MS13  BC006590
MS34NLST DS    CL3                 NUMBER OF ENTRIES IN THE LIST        BC006600
MS34LLST DS    CL1                 LENGTH OF EACH ENTRY                 BC006610
MS34LIST DS    CL70                LEFT-ADJUSTED CONCATENATED LIST      BC006620
MS34LGTH EQU   *-MS34CARD          LENGTH OF DSECT                      BC006630
         MEND                                                           BC006640
