         MACRO                                                          BC007610
&NAME    MS38  &DUMMY                                                   BC007620
*********************************************************************** BC007630
*        FORMAT OF MS38 CONTROL CARD                                  * BC007640
*********************************************************************** BC007650
         SPACE 1                                                        BC007660
*        TRANSFORM ONE FIELD AGAINST ANOTHER                            BC007670
         SPACE 1                                                        BC007680
MS38CARD DSECT                                                          BC007690
MS38ID   DS    CL4                 CARD ID ('MS38')                     BC007700
MS38TID  DS    CL2                 TEST ID ( LABEL )                    BC007710
MS38POS1 DS    CL3                 POSN OF SOURCE FIELD                 BC007720
*                                   OR 'S  ' TO DERIVE FROM MS13 CARD   BC007730
MS38LEN1 DS    CL2                 LGTH OF SOURCE FIELD                 BC007740
MS38POS2 DS    CL3                 POSN OF RECEIVINF FIELD              BC007750
*                                   OR 'S  ' TO DERIVE FROM MS13        BC007760
MS38TYPE DS    CL1                 TYPE OF TRANSFORMATION               BC007770
*                                   'C' - COLUMN BY COLUMN              BC007780
*                                   'F' - TOTAL FIELD IN ONE OPERATION  BC007790
*                                   ' ' - TOTAL FIELD IN ONE OPERATION  BC007800
         DS    CL65                UNUSED                               BC007810
MS38LGTH EQU   *-MS38CARD          LENGTH OF DSECT                      BC007820
         MEND                                                           BC007830
