         MACRO                                                          BD014320
&NAME POOLDEFN &DUMMY                                                   BD014330
*********************************************************************** BD014340
*        FORMAT OF SUB-BLOCK DEFINING 'WORKFILE' STORAGE POOLS        * BD014350
*********************************************************************** BD014360
         SPACE 1                                                        BD014370
*        THIS CONTROL BLOCK IS USED TO DESCRIBE ACQUIRED STORAGE POOLS  BD014380
*         OR UNUSED CSECTS WHICH ARE AVAILABLE TO THE GETAMIN AND       BD014390
*         WORKFILE ROUTINES.                                            BD014400
         SPACE 1                                                        BD014410
POOLDEFN DSECT                     SUB-BLOCK DEFINING STORAGE POOL      BD014420
POOLSW   DS    0CL1                SWITCH BYTE                          BD014430
POOLADR  DS    F                   ADDRESS OF POOL                      BD014440
POOLSIZ  DS    F                   SIZE OF POOL                         BD014450
         ORG   POOLADR             REDEFINE OVER MULTI-USE FIELD        BD014460
GETMNPOS DS    F                   START OF AREA AVAILABLE FOR GETMAINS BD014470
GETMNLEN DS    F                   LGTH  OF AREA AVAILABLE FOR GETMAINS BD014480
POOLCAP  DS    F                   CAPACITY OF POOL ( IN RECORDS )      BD014490
POOLPTR  DS    F                   PTR TO NEXT AVAILABLE SLOT           BD014500
POOLLGTH EQU   *-POOLDEFN          LENGTH OF SUB-BLOCK                  BD014510
SPDLGTH  EQU   POOLLGTH            LENGTH OF SUB-BLOCK                  BD014520
         SPACE 5                                                        BD014530
POOLUSE  EQU   1                   STORAGE POOL AVAILABLE FOR USE       BD014540
POOLWORK EQU   2                   STORAGE POOL BEING USED BY WORK FILE BD014550
POOLGETM EQU   4                   STORAGE POOL MUST BE ACQUIRED BY GET BD014560
POOLPFRE EQU   8                   STORAGE POOL MAY BE FREEMAINED       BD014570
POOLFREE EQU   16                  STORAGE POOL HAS BEEN FREEMAINED     BD014580
POOLCSCT EQU   32                  STORAGE POOL DEFINES A CSECT         BD014590
POOLGTM  EQU   64                  STORAGE POOL AVAILABLE FOR INT GETMN BD014600
         SPACE 5                                                        BD014610
*        SECONDARY EQUATES FOR COMPATIBILITY WITH PARROT CODE           BD014620
         SPACE 1                                                        BD014630
MSPDUSE  EQU   POOLUSE             STORAGE POOL AVAILABLE FOR USE       BD014640
MSPDWORK EQU   POOLWORK            STORAGE POOL BEING USED BY WORK FILE BD014650
MSPDGETM EQU   POOLGETM            STORAGE POOL MUST BE ACQUIRED BY GET BD014660
MSPDPFRE EQU   POOLPFRE            STORAGE POOL MAY BE FREEMAINED       BD014670
MSPDFREE EQU   POOLFREE            STORAGE POOL HAS BEEN FREEMAINED     BD014680
MSPDCSCT EQU   POOLCSCT            STORAGE POOL DEFINES A CSECT         BD014690
MSPDGTM  EQU   POOLGTM             STORAGE POOL AVAILABLE FOR INT GETMN BD014700
         MEND                                                           BD014710
