         MACRO                                                          PD011410
&NAME    RAE   &DUMMY                                                   PD011420
*********************************************************************** PD011430
*        RAE - RANGE ANALYSIS ELEMENT                                 * PD011440
*********************************************************************** PD011450
         SPACE 1                                                        PD011460
*        ACCCUMULATORS FOR A SINGLE RANGE VALUE                         PD011470
         SPACE 1                                                        PD011480
RAENTRY  DSECT                                                          PD011490
RAEID    DS    0CL1                CONTROL BLOCK IDENTIFIER             PD011500
RAERAE   DS    F                   ADDRESS OF NEXTRAE                   PD011510
RAESW    DS    CL1                 SWITCH BYTE                          PD011520
RAERVAL  DS    CL8            (FP) UPPER RANGE LIMIT                    PD011530
RAETNO   DS    PL4                 NO OF ENTRIES FROM TOTAL FILE        PD011540
RAETVAL  DS    CL8            (FP) ACCUMULATED TOTAL FOR FILE           PD011550
RAELGTH  EQU   *-RAENTRY           LENGTH OF BASIC DSECT                PD011560
RAEKNO   DS    PL4                 NO OF ENTRIES FOR MAJOR KEY          PD011570
RAEKVAL  DS    CL8            (FP) ACCUMULATED VALUE FOR MAJOR KEY      PD011580
RAESLGTH EQU   *-RAENTRY           LENGTH OF RAE WITH SUBANAL FIELDS    PD011590
         SPACE 5                                                        PD011600
MRAELOW  EQU   1                   THIS RAE ACCUMULATES BELOW BOTTOM    PD011610
MRAEHIGH EQU   2                   THIS RAE ACCUMULATES ABOVE TOP       PD011620
         MEND                                                           PD011630
