         MACRO                                                          PD018400
&NAME    SAB   &DUMMY                                                   PD018410
*********************************************************************** PD018420
*        SAB - SUBROUTINE ANCHOR BLOCK                                * PD018430
*********************************************************************** PD018440
         SPACE 1                                                        PD018450
SABNTRY  DSECT                                                          PD018460
SABID    DS    0CL1                CONTROL BLOCK IDENTIFIER             PD018470
SABSAB   DS    F                   ADDRESS OF NEXT SAB                  PD018480
SAB1ST   DS    F                   ADDRESS OF 1ST PCB IN SUBROUTINE     PD018490
SABLAST  DS    F                   ADDRESS OF LAST PCB IN SUBROUTINE    PD018500
SABTID   DS    CL2                 SUBROUTINE NAME ( GR40 LABEL )       PD018510
SABSW    DS    CL1                 SWITCH BYTE                          PD018520
SABLGTH  EQU   *-SABNTRY           LENGTH OF SUBROUTINE                 PD018530
         MEND                                                           PD018540
