         MACRO                                                          PM009970
&NAME    SUBIN &SAVE=,&PREFIX=,&FLOWTHR=                                PM009980
         GBLA  &SUBINC                                                  PM009990
         GBLC  &SUBALL                                                  PM010000
         GBLC  &CBAL                                                    PM010010
         LCLA  &N,&S                                                    PM010020
         LCLC  &R,&P,&PP                                                PM010030
         LCLC  &NAME1                                                   PM010040
&CBAL    SETC  'N'                                                      PM010050
&SUBALL  SETC  ' '                                                      PM010060
&SUBINC SETA   &SUBINC+1                                                PM010070
&NAME1   SETC  '&NAME'                                                  PM010080
         AIF   ('&SAVE' NE 'ALL').F00                                   PM010090
&P       SETC  '&PREFIX'                                                PM010100
         AIF   ('&P' NE '').G00                                         PM010110
&P       SETC  '$&SUBINC'                                               PM010120
.G00     ANOP                                                           PM010130
&NAME1   SETC  '&P.ALL'                                                 PM010140
&SUBALL  SETC  '&NAME1'                                                 PM010150
&NAME1   DS    16F                 SAVE AREA FOR ALL REGISTERS          PM010160
&NAME    STM   R0,R15,*-64         PRESERVE ALL REGISTERS               PM010170
         MEXIT                                                          PM010180
.F00     ANOP                                                           PM010190
         AIF   ('&FLOWTHR' EQ '').D00                                   PM010200
         AIF   ('&FLOWTHR' EQ 'YES').D01                                PM010210
         MNOTE 4,'UNKNOWN ''FLOWTHR'' SPECIFICATION - IGNORED'          PM010220
         AGO   .D00                                                     PM010230
.D01     B     &NAME               BR AROUND SAVE AREAS                 PM010240
.D00     ANOP                                                           PM010250
&N       SETA  N'&SAVE                                                  PM010260
         AIF   (&N GT 0).C1                                             PM010270
&NAME    DS    0H                                                       PM010280
         MEXIT                                                          PM010290
.C1      ANOP                                                           PM010300
&P       SETC  '&PREFIX'                                                PM010310
         AIF   ('&P' EQ '').C2                                          PM010320
&PP      SETC  '&P.SAVE'                                                PM010330
         AGO   .C3                                                      PM010340
.C2      ANOP                                                           PM010350
&PP      SETC  '$&SUBINC'                                               PM010360
.C3      ANOP                                                           PM010370
.C5      ANOP                                                           PM010380
&S       SETA  &S+1                                                     PM010390
         AIF   (&S GT &N).C6                                            PM010400
&PP&SAVE(&S) DS F 0                SAVE AREA                            PM010410
         AGO   .C5                                                      PM010420
.C6      ANOP                                                           PM010430
&S       SETA  0                                                        PM010440
.E01     ANOP                                                           PM010450
&S       SETA  &S+1                                                     PM010460
         AIF   (&S GT &N).C4                                            PM010470
&NAME1   ST    &SAVE(&S),&PP&SAVE(&S) 0      PRESERVE REGISTER          PM010480
&NAME1   SETC  ' '                                                      PM010490
         AGO   .E01                                                     PM010500
.C4      ANOP                                                           PM010510
         MEND                                                           PM010520
