         MACRO                                                          BM006230
        RTNDEF &RTN,&SS                                                 BM006240
.*                                                                      BM006250
.*       CREATE ROUTINE DEFINITION OF THE FORM                          BM006260
.*             . =(ROUTINE)                                             BM006270
.*             . AL1(CSECT SUFFIX NO)                                   BM006280
.*             . AL3(BASE REGISTER SAVE AREA)                           BM006290
.*                                                                      BM006300
         LCLC  &N                                                       BM006310
         LCLC  &S                                                       BM006320
&S       SETC  'BUDGIE3&SS'                                             BM006330
&N       SETC  '0'                                                      BM006340
         AIF      ('&S' EQ 'BUDGIE3A').A01                              BM006350
&N       SETC  '1'                                                      BM006360
         AIF      ('&S' EQ 'BUDGIE3B').A01                              BM006370
&N       SETC  '2'                                                      BM006380
         AIF      ('&S' EQ 'BUDGIE3C').A01                              BM006390
&N       SETC  '3'                                                      BM006400
         AIF      ('&S' EQ 'BUDGIE3D').A01                              BM006410
&N       SETC  '4'                                                      BM006420
         AIF      ('&S' EQ 'BUDGIE3E').A01                              BM006430
&N       SETC  '5'                                                      BM006440
         AIF      ('&S' EQ 'BUDGIE3F').A01                              BM006450
&N       SETC  '6'                                                      BM006460
         AIF      ('&S' EQ 'BUDGIE3G').A01                              BM006470
&N       SETC  '7'                                                      BM006480
         AIF      ('&S' EQ 'BUDGIE3H').A01                              BM006490
&N       SETC  '8'                                                      BM006500
         AIF      ('&S' EQ 'BUDGIE3I').A01                              BM006510
&N       SETC  '9'                                                      BM006520
         AIF      ('&S' EQ 'BUDGIE3J').A01                              BM006530
&N       SETC  '10'                                                     BM006540
         AIF      ('&S' EQ 'BUDGIE3K').A01                              BM006550
&N       SETC  '11'                                                     BM006560
         AIF      ('&S' EQ 'BUDGIE3L').A01                              BM006570
&N       SETC  '12'                                                     BM006580
         AIF      ('&S' EQ 'BUDGIE3M').A01                              BM006590
&N       SETC  '13'                                                     BM006600
         AIF      ('&S' EQ 'BUDGIE3N').A01                              BM006610
&N       SETC  '14'                                                     BM006620
         AIF      ('&S' EQ 'BUDGIE3O').A01                              BM006630
&N       SETC  '15'                                                     BM006640
         AIF      ('&S' EQ 'BUDGIE3P').A01                              BM006650
&N       SETC  '16'                                                     BM006660
         AIF      ('&S' EQ 'BUDGIE3Q').A01                              BM006670
&N       SETC  '17'                                                     BM006680
         AIF      ('&S' EQ 'BUDGIE3R').A01                              BM006690
&N       SETC  '18'                                                     BM006700
         AIF      ('&S' EQ 'BUDGIE3S').A01                              BM006710
&N       SETC  '19'                                                     BM006720
         AIF      ('&S' EQ 'BUDGIE3T').A01                              BM006730
&N       SETC  '20'                                                     BM006740
         AIF      ('&S' EQ 'BUDGIE3U').A01                              BM006750
&N       SETC  '21'                                                     BM006760
         AIF      ('&S' EQ 'BUDGIE3V').A01                              BM006770
&N       SETC  '22'                                                     BM006780
         AIF      ('&S' EQ 'BUDGIE3W').A01                              BM006790
&N       SETC  '23'                                                     BM006800
         AIF      ('&S' EQ 'BUDGIE3X').A01                              BM006810
&N       SETC  '24'                                                     BM006820
         AIF      ('&S' EQ 'BUDGIE3Y').A01                              BM006830
&N       SETC  '25'                                                     BM006840
         AIF      ('&S' EQ 'BUDGIE3Z').A01                              BM006850
         MNOTE *,'UNKNOWN CSECT'                                        BM006860
#&RTN    DC    A(0),A(0) ^         DUMMY ROUTINE DEFINITION             BM006870
         MEXIT                                                          BM006880
         MEXIT                                                          BM006890
.A01     ANOP                                                           BM006900
#&RTN    DC    V(&RTN),AL1(&N),AL3(0) ROUTINE DEFINITION                BM006910
         MEND                                                           BM006920
