&****** REPLACE *************** ===> ATTENTION <=== ****************************
&
&
&   YOUR REQUEST IS IN ERROR
&
$   MODULE#PGMNAME $HAS BEEN UPDATED SINCE IT WAS LAST RETRIEVED
$
$   DATE OF RETRIEVAL    &===>#CTLDATE      $(MMDDYY)
$   LAST UPDATE ON MODULE&===>#UPDDATE      $(MMDDYYHHMM)
$
$
$   IT IS POSSIBLE THAT SOMEONE ELSE IS ALSO UPDATING THIS MODULE
$   PLEASE CHECK CAREFULLY AND THEN RESPOND AS INDICATED BELOW:
$
$
$   PRESS&PF3$(END KEY) TO SUPPRESS THE UPDATE TO LIBRARYN MASTER
$   PRESS&ENTER$TO CONTINUE WITH THE REQUEST
<ACTION>
1 PGMNAME CHAR(8) INIT($PARM1) CURSOR;
2 CTLDATE CHAR(6) INIT($PARM2) NOCURSOR;
3 UPDDATE CHAR(10) INIT($PARM3) NOCURSOR;
<END>
