<FIELDS>^%!&$#@
&TUTORIAL ------------ LIBRARYN - RETRIEVE A MODULE ------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
&                     -----------------------------------
                      |            RETRIEVE             |
                      -----------------------------------
$
  &RETRIEVE$(OPTION&1$) LOADS A LIBRARYN MODULE FROM THE MASTER FILE ON WHICH
  IT RESIDES INTO A SEQUENTIAL OR PARTITIONED DATA SET WHERE IT CAN BE EASILY
  ACCESSED BY SPF. THE OUTPUT DATA SET MUST BE COMPATIBLE WITH CARD-IMAGES I.E.
  MUST HAVE A RECORD LENGTH OF&80$AND A RECORD FORMAT OF &F$OR&FB$. NORMAL SPF
  FILES WILL ALREADY BE IN THIS FORMAT.

  IF YOU ARE GOING TO UNLOAD TO A SEQUENTIAL DATA SET, THEN IT MUST HAVE
  ALREADY ALLOCATED AND SHOULD BE EMPTY.

  IN EITHER CASE, (PARTITIONED OR SEQUENTIAL), IF YOUR OUTPUT FILE DOES
  CONTAIN DATA ALREADY, YOU WILL BE SHOWN THE FIRST THREE LINES OF THE DATA
  AND ASKED IF YOU WANT TO OVERWRITE IT. MAKE SURE YOU DO NOT RETRIEVE A
  MODULE, UPDATE IT, AND THEN ACCIDENTLY RETRIEVE IT AGAIN AND LOSE YOUR
  ALTERATIONS.
                           (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('ZTUTOR00');
4 * CHAR(8) INIT('ZTUTORU ');
5 * CHAR(8) INIT('ZTUTORR2');
<END>
