<FIELDS>^%!&$#@
&TUTORIAL ------------ LIBRARYN - REPLACE A MODULE -------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
$ BEFORE THE MODULE IS REPLACED ON LIBRARYN, CHECKS ARE MADE TO DETERMINE
  WHETHER THE REQUEST IS A VALID ONE OR CONTAINS LOGICAL INCONSISTENCIES.
  THE TESTS MADE ARE:

 &1)$YOUR TSO ID IS COMPARED WITH THE ID OF THE PERSON WHO ORIGINALLY
     RETRIEVED THE MODULE. THIS IS IN CASE TWO PEOPLE ARE BOTH UPDATING THE
     SAME MODULE AND SO CORRUPT IT.
 &2)$A CHECK IS MADE TO SEE THAT THE MODULE WAS RETRIEVED BY THE INTERFACE IN
     THE FIRST PLACE.
 &3)$THE DATE OF RETRIEVAL AND THE TIME OF LAST UPDATE ARE COMPARED TO SEE IF
     ANYONE HAS UPDATED THIS MODULE IN BATCH SINCE IT WAS RETRIEVED.

  IF ANY OF THESE ERRORS IS DETECTED, A WARNING MESSAGE IS DISPLAYED,
  TELLING YOU OF THE ERROR, GIVING ALL THE RELEVANT DETAILS AND ASKING
  YOU IF YOU WANT TO PROCEED, (IN WHICH CASE PRESS&ENTER$), OR ABORT THE
  UPDATE, (IN WHICH CASE YOU SHOULD HIT&PF3$).

  IF YOU DO ABORT THE UPDATE, YOUR COPY OF THE MODULE WILL REMAIN UNCHANGED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('ZTUTOR00');
4 * CHAR(8) INIT('ZTUTORA ');
5 * CHAR(8) INIT('        ');
<END>
