<FIELDS>^%!&$#@
&TUTORIAL ------------ LIBRARYN - REPLACE A MODULE -------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
&                     -----------------------------------
                      |             REPLACE             |
                      -----------------------------------
$
  &REPLACE$TAKES THE COPY OF A MODULE WHICH IS HELD ON AN SPF FILE OR LIBRARY
  AND RETURNS IT TO THE LIBRARYN MASTER FROM WHICH IT CAME. THE OLD DATA
  IS REPLACED AND HISTORY DATA IS UPDATED. THE MODULE&MUST$ALREADY EXIST
  ON LIBRARYN AND MUST HAVE BEEN PREVIOUSLY RETRIEVED BY THE RETRIEVE FACILITY
  (OPTION&1$).

  SPF AUTOMATICALLY PROVIDES THE PASSWORD AND THE VERS OPERAND SO THERE IS NO
  NEED FOR YOU TO ENTER THESE. HISTORY DATA MUST BE ENTERED HOWEVER TO
  PROVIDE A CHECK ON THE CHANGES APPLIED TO A MODULE. YOU WILL BE PROMPTED
  FOR AT LEAST ONE HISTORY CARD ALTHOUGH UP TO 3 MAY BE ENTERED.

  ONCE YOUR MODULE HAS BEEN LOADED BACK INTO LIBRARYN, THE SOURCE STATEMENTS
  WILL BE DELETED. THIS IS TO PREVENT ANYONE CONTINUING TO UPDATE THE SPF
  COPY OF A MODULE AFTER IT HAS BEEN RETURNED TO LIBRARYN.
                           (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('ZTUTOR00');
4 * CHAR(8) INIT('ZTUTORA ');
5 * CHAR(8) INIT('ZTUTORU2');
<END>
