//JEAASMFX JOB (1140,5),'J ABBEY',CLASS=N
// EXEC ASMFCL,L=H
JEADBD1  DBD   NOSEGS=5
         SEGMENT ROOT,LEVEL=1
         SEGMENT SEG1,PARENT=ROOT,LEVEL=2
         SEGMENT SEG2,PARENT=SEG1,LEVEL=3
         SEGMENT SEG3,PARENT=SEG1,LEVEL=3
         SEGMENT SEG4,PARENT=ROOT,LEVEL=2
         END
//LKED.SYSLMOD DD DSN=SYS2.TESTLIB(JEADBD1),DISP=SHR
