         MACRO
&LABEL   DATA  &LINE,&COL,&DATA,&BRIGHT=NO,&CHANGE=NO,&CURSOR=NO
         GBLA  &GBLSCRN,&BASE
&GBLSCRN SETA  &GBLSCRN+1
X&BASE.&GBLSCRN EQU *
         DC    AL2(&LINE,&COL)     LINE AND COLUMN POSITION
         AIF   ('&BRIGHT' NE 'YES').NOBRITE
         DC    C'B'                DISPLAY IS TO BE BRIGHT
         AGO   .CONT1
.NOBRITE DC    C' '                DISPLAY NORMAL INTENSITY
.CONT1   ANOP
         AIF   ('&CHANGE' NE 'YES').NOCHNG
         DC    C'C'                DATA IN FIELD CAN BE CHANGED
         AGO   .CONT2
.NOCHNG  ANOP
         DC    C' '                DATA CANNOT BE CHANGED
.CONT2   ANOP
         AIF   ('&CURSOR' NE 'YES').NOCURS
         DC    C'C'                CURSOR IS TO BE INSERTED HERE
         AGO   .CONT3
.NOCURS  ANOP
         DC    C' '                NO CURSOR TO BE USED THIS FIELD
.CONT3   ANOP
         DC    AL1(L'IHB&SYSNDX)
&LABEL   DS    0CL(L'IHB&SYSNDX)
IHB&SYSNDX DC C&DATA
         MEND
