         MACRO
&LABEL   DDNAME &LAST=,&ADCON=
         GBLB  &DDSW
         GBLC  &NEXNAM
         AIF   (&DDSW).TIOTOK
         AIF   (T'&ADCON NE 'O').NOADCON
         CNOP  0,4
         B     *+8
JHB&SYSNDX DC  A(0)
.NOADCON L     1,16                    CVT
         L     1,0(1)
         L     1,4(1)
         L     1,12(1)
         LA    1,24(1)
         B     *+8
&DDSW    SETB  1
         AIF   (T'&ADCON EQ 'O').JHB
&NEXNAM  SETC  '&ADCON'
         AGO   .TIOTOK
.JHB     ANOP
&NEXNAM  SETC  'JHB&SYSNDX'
.TIOTOK  ANOP
&LABEL   L     1,&NEXNAM
         XR    15,15
         IC    15,0(1)
         AIF   (T'&LAST EQ 'O').NOTEST
         LTR   15,15
         BZ    &LAST
         BZ    &LAST
.NOTEST  LA    14,0(15,1)
         ST    14,&NEXNAM
         LA    1,4(1)
         MEND
