         MACRO
         EDITWK2  &DSECT=YES
         AIF   ('&DSECT' NE 'YES').NODSCT
WDSECT   DSECT
.NODSCT  ANOP
         SPACE 2
***********************************************************************
*        THESE AREAS NEED NOT BE INITIALISED
***********************************************************************
         SPACE 2
         DS    18A                 REGISTER SAVE AREA
OPERANDS DS    F                   ADDRESS OF NEXT OPERAND FIELD
ERROPNDS DS    F                   ADDRESS OF  LAST FIELD DELIMITED
OPERENDS DS    F                   END OF OPERANDS DETECTED BY SETDELIM
STACKTOP DS    F                   ADDRESS OF TOP OF CONSOLE STACK
FREESTAK DS    F                   ADDRESS OF FREE STACK ENTRY CHAIN
DATASTAK DS    F                   ADDRESS OF STACK OF DATA BLOCKS
CURRENT  DS    3F                  CURRENT RECORD ADDRESSES
DUMMY    DS    3F                  ANCHOR FOR CHAIN OF RECORDS
DUMMY2   DS    3F                  ANCHOR FOR CHAIN OF RECORDS
STACKREG DS    2F                  SAVE AREA FOR GATMAIN REGISTERS
SCRNREGS DS    2F                  SAVE AREA FOE GETMAIN REGISTERS
$DPOFFST DS    F                   WORK AREA FOR $MOVE
INSTRING DS    F                   ADDRESS OF CHANGE INPUT STRING
OUSTRING DS    F                   ADDRESS OF CHANGE OUT STRING
INLENGTH DS    F                   LENGTH OF INPUT STRING
OULENGTH DS    F                   LENGTH OF REPLACE STRING
LOCLENTH DS    F                   LENGTH OF LOCATE COMMAND DATA
LOCDATA  DS    F                   ADDRESS OF LOCATE COMMAND DATA
CARDCNT  DS    F                   NUMBER OF CHANGE PER CARD
RECCNT   DS    F                   NUMBER OF RECORDS TO CHANGE
POINT    DS    F                   ADDRESS OF REPLACE POINT
RESTART  DS    F                   RESTART ADDRESS FOR COMPARE
READPRMS DS    2F                  START AND COUNT RECORDS FOR 'GET'
WORKAREA DS    CL80                SAVE AREA FOR MANIPULATING CARDS
DBLWORD  DS    D                   WORK AREA
TPUTLEN  DS    F                   LENGTH OF SCREEN I/O AREA
SCREEN   DS    F                   ADDRESS OF GETMAINED SCREEN AREA
ERRMSG   DS    F                   ADDRESS OF ERROR MESSAGE AREA
DSNAREA  DS    F                   ADDRESS OF DATA SET NAME AREA
DATAAREA DS    F                   ADDRESS OF DATA PORTION OF SCREEN
CMNDLINE DS    F                   ADDRESS OF COMMAND LINE IN OUT BUF
CMNDENDS DS    F                   ADDRESS OF END OF COMMAND AREA
GETSAVE  DS    F                   WORK SAVE AREA
A        DS    F                   NOT USED
B        DS    F                   NOT USED
UT501D   CALL  ,(0,0,0,0,0),VL,MF=L CALL PARAMETER LIST
CALLLIST DS    12F                 WORK AREA TO BUILD CALL LISTS
SYSUT1   DCB   DDNAME=SYSUT1,DSORG=PS,MACRF=(GM,PM)
OPENLIST OPEN  (0,INPUT),MF=L      OPEN PARAMETER LIST
CLOSLIST CLOSE (0),MF=L            CLOSE PARAMETER LIST
LRECL    DS    H                   LENGTH OF A RECORD
RENWORK  DS    CL9                 WORK AREA FOR RENUMBER
WORKFLAG DC    X'00'               PROCESSING FLAG
SAVEFLG  EQU   X'80'               SAVE OPERATION REQUESTED
IN1LINE  EQU   X'40'               SINGLE LINE INPUT MODE
SUBMTFLG EQU   X'20'               SUBMIT IN OPERATION
PFKCASE  EQU   X'10'               PA2 HAS BEEN HIT PRIOR TO A PFK
DANGER   EQU   X'08'               CHANGED DATA MAY NOT BE RE-READ
TABCOL1  EQU   X'04'               TAB HAS JUST MOVED CURSOR TO COL 1
$DPFLAG  DC    X'00'
$DPMOVE  EQU   X'80'               A DP OPERATION REQUIRING DELETION
RETCODE  DC    X'00'               RETURN CODE FROM UT501
EDITNAME DS    CL16                NAME OF EDIT FILE BEING READ/WRITTEN
DSNAME   DS    CL54                WORK AREA FOR OS DATA SET NAME
JCLDATA  DC    H'80'               START OF UT501 PARM FIELD
         DS    CL100               WORK AREA TO BUILD ALLOC JCL
DATALNTH DS    H                   EFFECTIVE LENGTH OF THIS IO
COMMANDX DS    0CL126              RESTORE AREA FOR STACK ENTRY
AID      DS    XL6
COMMAND  DS    CL120                  RETURN AREA FOR COMMANDS
         DS    C                    OVERFLOW AREA
SAVECMND DS    CL120               SAVE AREA FOR COMMANDS AGAINST '='
TGETDATA DS    0CL6                START OF TGET PARAMETER AREAS
IOAID    DS    X                  INPUT DATA TYPE IDENTIFIER
CURSORID DS    XL2
INPUTSBA DS    XL3
IOAREA   DS    CL120              INPUT IOAREA FROM CONSOLE
         XAL   GENERATE            GENERATE SPACE FOR LINK REGISTERS
WALENGTH EQU   *-WDSECT            LENGTH OF THE DSECT
         MEND
