         MACRO
         GETCC &OPER
         GBLA  &CCVAL
         AIF   ('&OPER' EQ 'EQ').SETCC8
         AIF   ('&OPER' EQ 'NE').SETCC7
         AIF   ('&OPER' EQ 'LT').SETCC4
         AIF   ('&OPER' EQ 'GT').SETCC2
         AIF   ('&OPER' EQ 'LE').SETCC12
         AIF   ('&OPER' EQ 'GE').SETCC10
         AIF   ('&OPER' EQ 'O').SETCC1
         AIF   ('&OPER' EQ 'Z').SETCC8
         AIF   ('&OPER' EQ 'NZ').SETCC7
         AIF   ('&OPER' EQ 'H').SETCC2
         AIF   ('&OPER' EQ 'L').SETCC4
         AIF   ('&OPER' EQ 'M').SETCC4
         AIF   ('&OPER' EQ 'ONE').SETCC1
         AIF   ('&OPER' EQ 'ZERO').SETCC8
         AIF   ('&OPER' EQ 'MIXED').SETCC4
         MNOTE 8,'INVALID CONDITIONAL OPERATOR - &OPER'
.SETCC12 ANOP
&CCVAL   SETA  12
         AGO   .END
.SETCC10 ANOP
&CCVAL   SETA  10
         AGO   .END
.SETCC8  ANOP
&CCVAL   SETA  8
         AGO   .END
.SETCC7  ANOP
&CCVAL   SETA  7
         AGO   .END
.SETCC4  ANOP
&CCVAL   SETA  4
         AGO   .END
.SETCC2  ANOP
&CCVAL   SETA  2
         AGO   .END
.SETCC1  ANOP
&CCVAL   SETA  1
         AGO   .END
.END     ANOP
         MEND
