//JEAMACRO JOB (1140,5),'J ABBEY',CLASS=N
// EXEC PGM=IEBUPDTE,REGION=80K
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=SYS2.MACLIB,DISP=OLD
//SYSUT2 DD DSN=SYS2.MACLIB,DISP=OLD
>> REPL NAME=IHAABDA
>> NUMBER NEW1=1000,INCR=1000
         MACRO
         IHAABDA
ABDAREA  DSECT
ABDTCB   DS    A                       ADDRESS OF TCB FOR TASK
*                                      TO BE DISPLAYED
ABDCTCB  DS    A                       ADDRESS OF CURRENT TCB
ABDCRB   DS    A                       ADDRESS OF ABDUMPS SVRB
ABDPARMS DS    0CL20                   COPY OF ABDUMP PARAMETER LIST
ABDPID   DS    CL1                     USER SUPPLIED ID FOR DUMP
ABDFLAG  DS    B                       FLAG BYTE
APFSNAP  EQU   X'80'                   0=SNAP REQUEST
*                                      1=SVC DUMP REQUEST
APFVS2   EQU   X'40'                   0=OS/VS2 REL.1
*                                      1=OS/VS2 REL.2
*        EQU   X'20'                   RESERVED
APFABEND EQU   X'10'                   0=ABEND REQUEST
*                                      1=SNAP REQUEST
APFID    EQU   X'08'                   ID SPECIFIED
APFTCB   EQU   X'04'                   TCB ADDRESS SPECIFIED BY USER
APFSNAPP EQU   X'02'                   STORAGE LIST PROVIDED
*        EQU   X'01'                   RESERVED
         DS    H                       RESERVED
APFSDATA DS    B                       SDATA OPTIONS
APFNUC   EQU   X'80'                   DUMP PSA, NUCLEUS, LSQA, SQA
APFSQA   EQU   X'40'                   DUMP SQA
APFLSQA  EQU   X'20'                   DUMP LSQA
APFSWA   EQU   X'10'                   DUMP SWA
APFTRACE EQU   X'08'                   INCLUDE TRACE TABLES(SUPERVISOR
*                                      OR GTF)
APFSUPDA EQU   X'04'                   FORMAT CONTROL BLOCKS FOR TASK
APFQCB   EQU   X'02'                   FORMAT ENQ CONTROL BLOCKS FOR
*                                      TASK
*        EQU   X'01'                   RESERVED
         DS    B                       RESERVED
APFPDATA DS    B                       PDATA OPTIONS
APFSAVE  EQU   X'80'                   DISPLAY SAVE AREA TRACE
APFSAVE2 EQU   X'40'                   0=DISPLAY ENTIRE SAVE AREA
*                                      1=DISPLAY HEADINGS ONLY
APFREGS  EQU   X'20'                   DISPLAY REGISTERS ON ENTRY
*                                      TO SNAP OR ABEND
APFLPA   EQU   X'10'                   DISPLAY ACTIVE LPA MODULES
APFJPA   EQU   X'08'                   DISPLAY JPA MODULES
APFPSW   EQU   X'04'                   DISPLAY PSW,ILC,INTERRUPT CODE
APFSPALL EQU   X'02'                   DISPLAY ALL SUBPOOLS
*                                      LESS THAN SUBPOOL 128
*        EQU   X'01'                   RESERVED
         DS    B                       RESERVED
ABDPDCBP DS    A                       ADDRESS OF DCB FOR DUMP
*                                      DATA SET
ABDPTCBP DS    A                       ADDRESS OF TCB TO BE DISPLAYED
ABDSNAPP DS    A                       ADDRESS OF SNAP LIST
ABDPARA  DS    A                       ADDRESS OF USER COPY OF
*                                      PARAMETER LIST
****
*
*
ABD$$1   DS    CL16                UNKNOWN AREA
*
*
****
ABDDECB  DS    A                       ADDRESS OF DCB IN SP0 FOR SNAP
ABDSAVE  DS    A                       ADDRESS OF SAVE AREA FOR USE
*                                      BY OUTPUT
ABDECB   DS    F                       ECB FOR ABDUMP DECB
ABDTYPE  DS    CL2                     TYPE OF IO REQUEST
ABDLEN   DS    H                       LENGTH OF RECORD TO BE WRITTEN
ABDDCB   DS    A                       ADDRESS OF DCB FOR IO
ABDPTR   DS    A                       ADDRESS OF BUFFER TO BE WRITTEN
ABDIOBP  DS    A                       ADDRESS OF IOB
ABDLCTR  DS    H                       LINE COUNTER
ABDPCTR  DS    H                       PAGE COUNTER
ABDPTRS  DS    0CL12                   BLOCKING BUFFER POINTERS
ABDPTRS1 DS    A                       START OF BUFFER
ABDPTRS2 DS    A                       NEXT AVAILABLE BYTE OF BUFFER
ABDPTRS3 DS    A                       END OF BUFFER
ABDCP    DS    A                       ADDRESS OF CURRENT TRACE TABLE
*                                      ENTRY IN GETMAINED USER CORE
*                                      AFTER MOVE OF TRACE TABLE
ABDFP    DS    A                       ADDRESS OF FIRST TRACE ENTRY
ABDLP    DS    A                       ADDRESS OF LAST TRACE ENTRY
ABDCP1   DS    A                       ADDRESS OF CURRENT TRACE TABLE
*                                      ENTRY IN GETMAINED USER CORE
*                                      BEFORE MOVE OF TRACE TABLE
ABDUPRXT DS    A                       ADDRESS OF SPECIFIC EXIT ROUTINE
*                                      IF UPR EXPECTED, OR ZERO
ABDWORK1 DS    D                       CONVERT TO DECIMAL WORK AREA
ABDFLAG1 DS    B                       FLAG BYTE
ABDQCBHD EQU   X'80'                   QUEUE CONTROL BLOCK HEADER HAS
*                                      BEEN PRINTED
ABDQCBMJ EQU   X'40'                   MAJOR QCB HAS BEEN PRINTED
ABDQCBMN EQU   X'20'                   MINOR QCB HAS BEEN PRINTED
ABDLSTHD EQU   X'10'                   THE STORAGE LIST HEADING LINE
*                                      HAS BEEN PRINTED
ABDSQSDM EQU   X'08'                   SQS HAS BEEN DUMPED
ABDSVCHD EQU   X'04'                   THE SVC HEADING LINE HAS
*                                      BEEN PRINTED
ABDSPHD  EQU   X'02'                   THE SUBPOOL HEADER HAS BEEN
*                                      PRINTED
*        EQU   X'01'                   RESERVED
ABDFLAG2 DS    B                       FLAG BYTE
ABDSUPER EQU   X'80'                   SUPERVISOR TRACE TO BE PROVIDED
ABDGTF   EQU   X'40'                   GTF TRACE TO BE PROVIDED
ABDTRBIT EQU   X'20'                   0=CORE FREED FOR SUPER TRACE
*                                      1=CORE ALLOCATED FOR SUPER TRACE
ABDTRNAV EQU   X'10'                   SUPER TRACE NOT AVAILABLE
ABDGTFCL EQU   X'08'                   IEAVAD08 ENTERED FOR GTF
ABDSWAP  EQU   X'04'                   USED BY IEAVAD0D TO DETERMINE
*                                      OWNERSHIP OF SWA SUBPOOLS
ABDSTAT  EQU   X'02'                   INDICATE STATUS ISSUED
ABDLSQA  EQU   X'01'                   IEAVAD0D ENTERED FOR SP229/230
ABDKEY   DS    B                       SAVE KEY FOR MODESET
ABDRES1  DS    B                       RESERVED
ABDWORK  DS    CL48                    GENERAL WORK AREA
ABDSSPAR DS    CL56                    WORKAREA FOR BUILDING PARAMETER
*                                      LISTS TO SUBSYSTEMS AND
*                                      FORMATTING ROUTINES OF OTHER
*                                      COMPONENTS
ABDBPTR  DS    A                       ADDRESS OF CONTROL BLOCK TO
*                                      BE FORMATTED
ABDLLINE DS    A                       ADDRESS OF LAYOUT LINE
****
*
*
ABD$$2   DS    CL8                 UNKNOWN AREA
*
*
****
ABDLPTR  DS    A                       ADDRESS OF NEXT AVAILABLE BYTE
*                                      OF ABDLINE
ABDFMTWK DS    CL9                     WORK AREA FOR FORMAT SUBROUTINE
ABDUPRF  DS    B                       UNDEFINED PAGE REFERENCE FLAGS
UPRFMAT  EQU   X'08'                   UPR EXPECTED ON THIS CALL TO
*                                      FORMAT OR FORMAT01 SUBROUTINE
UPRFMET  EQU   X'40'                   UPR EXPECTED ON THIS CALL TO
*                                      FORMET
UPRFMT20 EQU   X'20'                   UPR EXPECTED ON THIS CALL TO
*                                      FORMAT20 OR FORMAT22
ABDUPRFN DS    B                       ACTION REQUESTED BY CALLER IF
*                                      UPR ENCOUNTERED IN FORMET
ABDUPRPM EQU   X'80'                   PRINT A MESSAGE SPECIFYING
*                                      LOCATIONS X TO Y UNDEFINED,AND
*                                      CONTINUE WITH NEXT VALID PAGE
*                                      UNTIL COUNT RUNS OUT
ABDUPRSL EQU   X'40'                   SKIP A LINE AND FIND THE NEXT
*                                      VALID PAGE TO PRINT UNTIL
*                                      COUNT RUNS OUT.  IF ABDUPRPM AND
*                                      ABDUPRSL ARE BOTH 0, DISCONTINUE
*                                      PRINTING AND RETURN TO CALLER
ABDBLNKS DS    B                       BLANK CONTROL
ABDBLKN3 EQU   X'80'                   IF ABDBLKN3=0 FORMAT01 WILL
*                                      PUT 3 BLANKS BETWEEN THE END OF
*                                      ONE FIELD AND THE BEGINNING
*                                      OF THE NEXT LABEL.IF ABDBLKN3=1
*                                      THE NUMBER OF BLANKS SPECIFIED
*                                      IN BITS 4 TO 7 WILL BE PLACED
*                                      BETWEEN THE END OF ONE FIELD AND
*                                      THE BEGINNING OF THE NEXT LABEL
ABDSTAD  DS    A                       LOCATION COUNTER FOR FORMAT20,
*                                      USED AS A WORK CELL BY FORMET
ABDBLOCK DS    A                       ADDRESS OF BLOCK OF STORAGE TO
*                                      BE DUMPED
ABDLENTH DS    F                       NUMBER OF BYTES OF STORAGE TO
*                                      BE DUMPED
ABDSIZE  DS    F                       USED TO SAVE SIZE OF BLOCK
ABDIND   DS    H                       INDENTATION FACTOR FOR FIRST
*                                      LINE TO BE PRINTED
ABDIDENT DS    H                       NUMBER OF IDENTICAL LINES
*                                      ENCOUNTERED
ABDFWORK DS    A                       WORK CELL FOR FORMET ROUTINE
ABDINCPL DS    H                       LENGTH OF INCOMPLETE LINE
ABDLLNGH DS    B                       LENGTH OF THE PRINT LINE
ABDPCAP  DS    B                       MAXIMUM LINES PER PAGE
ABDUPRID DS    A                       RETURN ADDRESS FOR IDENTICAL
*                                      LINE PROCESSING IN FORMET
ABDSTADS DS    A                       SAVE AREA FOR OLD VALUE OF
*                                      ABDSTAD
ABSLCTSV DS    A                       SAVE AREA FOR OLD VALUE OF
*                                      LINES TO BE PRINTED
ABDBUFFS DS    0CL8
ABDBUFAD DS    A                       ADDR OF OUTPUT BUFFER
ABDBUFS2 DS    F                       SIZE OF OUTPUT BUFFER
ABDGMA   DS    0CL16                   WORK AREA FOR BUILDING
*                                      CONDITIONAL GETMAIN LISTS
ABDAAREA DS    A                       PDINTER TO ACQUIRED AREA
ABDASIZE DS    F                       SIZE OF ACQUIRED AREA
ABDPAREA DS    A                       ADDRESS OF ABDAAREA
ABDCDID  DS    CL2                     CODE AND SUBPOOL ID
         DS    H                       UNUSED
ABDSVCB  DS    A                       BASE FOR SVC 51
ABDRTRN  DS    A                       ADDRESS OF SVC 51
ESPARM   DS    0CL24                   ESTAE PARAMLIST
ESBSREG  DS    A                       BASE REG FOR IEAVAD01
ESAUTOP  DS    A                       ADDR OF AUTOMATIC DATA
EABDAREA DS    A                       ADDR OF SNAP WORK AREA
EMODNAME DS    CL4                     LAST 4 CHAR OF MOD NAME
ERESTART DS    A                       RESTART ADDR.
ESTAEFLG DS    B                       FLAG BYTE
ESUBSYT  EQU   X'80'                   1=SUBSYSTEM RTN. IN CNTRL
ETCB     EQU   X'40'                   1=TCB VALIDITY CHECK IN PROGRESS
EDCB     EQU   X'20'                   1=DCB VALIDITY CHECK IN PROGRESS
         DS    CL3                     RESERVED
ABDLCNT  DS    F                   COUNT OF COMPLETE LINES
ABDPHY   DS    H                       BUFFER DESCRIPTOR LENGTH
ABDSRC1  DS    H                       SYSTEM RESERVED CHARACTERS
ABDLOG   DS    H                       RECORD DESCRIPTOR LENGTH
ABDSRC2  DS    H                       SYSTEM RESERVED CHARACTERS
****
*
*
ABD$$3   DS    CL8                 UNKNOWN AREA
*
*
****
ABDLINEA DS    0CL205                  205 CHARACTER REFERENCE FOR
*                                      ABDCC+ABDLINE
ABDCC    DS    CL1                     CARRIAGE CONTROL CHARACTER
ABDLINE  DS    CL204                   PRINT LINE FOR OUTPUT
ABDPADC  DS    CL3                     RESERVED CHARACTERS FOR
*                                      UNPACKING TO END OF ABDLINE
         MEND
/*
