         MACRO
&LABEL   SCEND
         GBLA  &GBLSCRN,&BASE
         GBLC  &SCNAME
         LCLA  &WORK
&SCNAME  DS    0F
.LOOP    ANOP
         AIF   (&WORK EQ &GBLSCRN).MEXIT
&WORK    SETA  &WORK+1
         DC    A(X&BASE.X&WORK)     LINE PARAMETER FIELD
         AGO   .LOOP
.MEXIT   DC    X'80'
         DC    AL3(IHB&SYSNDX)
IHB&SYSNDX DC    C'F'
         MEND
