         MACRO
         SEGPTRS &N
         GBLA  &S,&ORG,&CDNBR
         GBLA  &SB(255),&SLDP(255),&TRK(10),&DSL(10)
         GBLA  &REC(10),&BLK(10),&OREC(10),&OBLK(10)
         GBLB  &GB1(16),&GB2(16),&GB3(16)
         GBLC  &SN(500)
         LCLA  &D,&X,&Y,&Z
.**********************************************************************
.**********************************************************************
.**                                                                  **
.**                           APARLOG 1.1.1                          **
.**                                                                  **
.**      PP43872 MSG DFS0730I I,01 PREFIX WAS ONE BYTE TOO SHORT     **
.**              AFTER APPLYING APAR PP41912                         **
.**                                                                  **
.**********************************************************************
.**********************************************************************
.**
         AIF   ('&N' EQ 'S').H
&D       SETA  (&SLDP(&N)-&SLDP(&N)/4096*4096)/32      DATASET ID
&X       SETA  &SB(&N)/65536+(&SB(&N)-&SB(&N)/65536*65536)  SEGMENT LTH
         AIF   (&D EQ 0).G
&Y       SETA  &DSL(&D)/65536           LARGEST SEGMENT IN DATASET
         AIF   (&X LE &Y).A
&Y       SETA  &X
.A       AIF   (&X LE &TRK(&D)/65536).C
         AIF   (NOT &GB1(2)).B
         AIF   (&X LE 32256-7).C
         MNOTE 8,'SEGM350 - SEGMENT(&SN(&N).) SIZE EXCEEDS CI SIZE. '
         MNOTE *,'          SEGMENT SIZE=&X  MAXIMUM CI SIZE=32256 '
&GB1(16) SETB  1
         AGO   .C
.B       MNOTE 8,'SEGM350 - SEGMENT(&SN(&N).) SIZE EXCEEDS TRACK LENGTH,
               .'
&Z       SETA  &TRK(&D)/65536
         MNOTE *,'          SEGMENT SIZE=&X   TRACK LENGTH=&Z '
&GB1(16) SETB  1
.C       ANOP
&DSL(&D) SETA  &Y*65536
&Y       SETA  &REC(&D)
&Z       SETA  &BLK(&D)
         AIF   (&N EQ 1).E
         AIF   (&OREC(&D) EQ 0).D
&Y       SETA  &OREC(&D)
.D       AIF   (&OBLK(&D) EQ 0).E
&Z       SETA  &OBLK(&D)
.E       ANOP
         AIF   (&ORG NE 12 AND &ORG NE 15).E1  ACCESS EQUAL IND@BA43872
&X       SETA  &X-1           PREFIX ONE LESS ON DISK          @BA43872
.E1      ANOP                 WAS A SIZE PARAMETER CODED       @BA43872
         AIF   (&Y EQ 0).G    NO EXIT MACRO                    @BA43872
         AIF   (&Y GE &X).F
         AIF   (&ORG EQ 3 AND &S EQ 1).G
         MNOTE 8,'SEGM330 - SEGMENT(&SN(&N).) LENGTH PLUS PREFIX IS'
         MNOTE *,'          GREATER THAN SPECIFIED RECORD LENGTH - &X '
&GB1(16) SETB  1
.F       AIF   ((&ORG GT 2 AND &ORG LT 7) OR &GB2(&D)+&GB3(&D) EQ 0 OR ,
               (&N NE 1 AND NOT &GB3(&D))).F3
         AIF   (NOT &GB2(&D) OR &N NE 1).F1
&Z       SETA  &BLK(&D)
.F1      AIF   (&N EQ 1).F2
&Z       SETA  &OBLK(&D)
.F2      AIF   (&Z GE &X).G
         AGO   .F4
.F3      AIF   (&Z EQ 0 OR &Y*&Z GE &X).G
.F4      MNOTE 8,'SEGM340 - SEGMENT(&SN(&N).) LENGTH PLUS PREFIX'
         MNOTE *,'          EXCEEDS BLOCK SIZE - &X..'
&GB1(16) SETB  1
.G       MEXIT
.H       AIF   (&Z EQ &S).G
&Z       SETA  &Z+1
&X       SETA  &SB(&Z)/65536+(&SB(&Z)-&SB(&Z)/65536*65536)  SEG. SIZE
&D       SETA  (&SLDP(&Z)-&SLDP(&Z)/4096*4096)/32      DATASET NUMBER
         AIF   (&D EQ 0).H         LOGICAL SEGMENT ?
&Y       SETA  &DSL(&D)-&DSL(&D)/65536*65536      SMALLEST SEGMENT
         AIF   (&X GE &Y AND &Y NE 0).H
&DSL(&D) SETA  &DSL(&D)/65536*65536+&X
         AGO   .H
         MEND
