         MACRO
         SRLDSECT
SRLWORK  DSECT ,                   SRL WORK AREA
         DS    18A                 REGISTER SAVE AREA
SRLSTRT  EQU   *                   START OF ACTUAL WORK AREA
DECB1    DS    8F                  IO CONTROL BLOCKS
BLKREFL  EQU   *-DECB1             OFFSET TO BLKREF FIELD
BLKREF1  DS    F                   BLOCK ID USED FOR IO ON 1
CHAINL   EQU   *-DECB1             OFFSET TO CHAIN FIELD
         DS    F                   CHAINING FIELD
DECB2    DS    8F                  IO CONTROL BLOCKS
BLKREF2  DS    F                   BLOCK ID USED FOR IO ON 2
         DS    F                   CHAINING FIELD
DECB3    DS    8F                  IO CONTROL BLOCKS
BLKREF3  DS    F                   BLOCK ID USED FOR IO ON 3
         DS    F                   CHAINING FIELD
DECB4    DS    8F                  IO CONTROL BLOCKS
BLKREF4  DS    F                   BLOCK ID USED FOR IO ON 4
         DS    F                   CHAINING FIELD
GETREGS  DS    2F                  GETMAIN/FREEMAIN REGISTERS
PUTREGS  DS    3F                  CURRENT BLOCK DETAILS
BLOCKID  DS    F                   ID OF LAST BLOCK TO BE READ
BLOCKID2 DS    F                   ID OF LAST BLOCK TO BE READ
NEXTREC  DS    F                   ADDRESS OF NEXT LOGICAL RECORD
NEXTREC2 DS    F                   ADDRESS OF NEXT LOGICAL RECORD
CURNTMAP DS    F                   ADDRESS OF BIT MAP IN USE
CURNTMP2 DS    F                   ADDRESS OF BIT MAP IN USE
HOLDBITS DS    CL1024              BUILD AREA FOR NEW BIT MAPS
SYSUT2   DS    CL108               BDAM OUTPUT DCB
RECLENTH DS    H                   LENGTH OF RECORD TO BE COMPRESSED
         SPACE 2
CNTLPARM DS    0F
CNTLID   DS    CL16                IDENTIFIER FOR CONTROL PARM
CNTLRECL DS    H                   RECORD LENGTH FOR CONTROL FILE
CNTLBITS DS    H                   NUMBER OF BYTES IN THE MAP
CNTLMAP  DS    0C                  BIT MAP OF CNTL BLOCKS
         DS    CL1024              MAXIMUM LENGTH OF BIT MAPS
CNTLLEN  EQU   *-CNTLPARM          MAX LENGTH OF A FILE ENTRY
         SPACE 2
FILEPARM DS    0F
FILEID   DS    CL16                NAME OF THE FILE
FILERECL DS    H                   LENGTH OF THE RECORDS
FILEBITS DS    H                   NUMBER OF BYTES IN THE MAP
FILEMAP  DS    0C                  BIT MAP OF BLOCKS
         DS    CL1024              MAXIMUM LENGTH OF BIT MAPS
         SPACE 2
FREEPARM DS    0F
FREEID   DS    CL16                IDENTIFIER FOR CONTROL PARM
FREERECL DS    H                   RECORD LENGTH FOR CONTROL FILE
FREEBITS DS    H                   NUMBER OF BYTES IN THE MAP
FREEMAP  DS    0C                  BIT MAP OF CNTL BLOCKS
         DS    CL1024              MAXIMUM LENGTH OF BIT MAPS
WORKPARM DS    0F
WORKID   DS    CL16                IDENTIFIER FOR CONTROL PARM
WORKRECL DS    H                   RECORD LENGTH FOR CONTROL FILE
WORKBITS DS    H                   NUMBER OF BYTES IN THE MAP
WORKMAP  DS    0C                  BIT MAP OF CNTL BLOCKS
         DS    CL1024              MAXIMUM LENGTH OF BIT MAPS
SRLWKLEN EQU   *-SRLSTRT           LENGTH OF DSECT AFTER REG S/A
         MEND
