         MACRO
&LABEL   ZCLOSE &DCB
         AIF   ('&DCB' EQ '').MNOTE
&LABEL   LA    1,&DCB LOAD REG1 WITH DCB ADDRESS
         L     1,42(1)                 LOAD REG1 WITH DEB ADDRESS
         L      1,0(1)                           TCB
         L     0,8(1)                            FIRST DEB
IHB&SYSNDX.A LR     1,0
         L     0,4(1)                  LOAD REG0 WITH NEXT DEB ADDRESS
         L     1,24(1)                 LOAD REG1 WITH DCB ADDRESS
         TM    44(1),X'10'             IS DCB OPEN
         BZ    IHB&SYSNDX.B            NO - BRANCH ROUND CLOSE
         CNOP  0,4
         ST    1,*+12
         MVI   *+8,X'80'
         BAL   1,*+12
         DC    A(0)                    DCB ADDRESS
MASK     DC    X'00FFFFFF'
         SVC   20                      ISSUE CLOSE SVC
IHB&SYSNDX.B N     0,MASK              NULL OUT HIGH ORDER BIT
         LTR   0,0                     IS IT LAST DEB?
         BNZ   IHB&SYSNDX.A
         AGO   .END
.MNOTE   MNOTE 8,'**** NO DCB SPECIFIED'
.END     ANOP
         MEND
