//LIBR     PROC LIB=SRCLIB,LIBROUT=NULLFILE,BKUP=NULLFILE,DISP1=NEW
//*                                                                   *
//*********************************************************************
//*        LIBRARIAN DISK MASTER PROCEDURE                            *
//*                                                                   *
//* NOTE:                                                             *
//*  1. LIBR EXECUTIONS CREATING OUTPUT ON THE DATA SET DEFINED       *
//*     BY THE OSJOB DD STATEMENT MUST SUPPLY THE FOLLOWING PARAMETER *
//*     ON THE EXEC STATEMENT - LIBROUT='ANY.DATA.SET.NAME'           *
//*********************************************************************
//*                                                                   *
//LIBR     EXEC PGM=LIBRLIBR,PARM='DEPTH=56,NJTA,NRJS',REGION=60K
//STEPLIB  DD   DSN=SYS1.PPLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=A
//INDEX    DD   SYSOUT=A
//LIST     DD   SYSOUT=A
//BACKUP   DD   DSN=&BKUP,DISP=(&DISP1,KEEP),UNIT=(TAPE,,DEFER),
// DCB=BLKSIZE=3000
//MASTER   DD   DSN=&LIB,DISP=SHR
//OSJOB    DD   DSN=&LIBROUT,DISP=(NEW,PASS),UNIT=DISK,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680),SPACE=(CYL,(3,1),RLSE,CONTIG)
// PEND


//LIBRTAPE PROC CYCLE=NULLFILE,LIBROUT=NULLFILE,BKUP=NULLFILE,DISP1=NEW
//*                                                                   *
//*********************************************************************
//*        LIBRARIAN TAPE MASTER PROCEDURE                            *
//*                                                                   *
//* NOTE:                                                             *
//*  1. LIBRTAPE EXECUTIONS CREATING OUTPUT ON THE DATA SET DEFINED   *
//*     BY THE OSJOB DD STATEMENT MUST SUPPLY THE FOLLOWING PARAMETER *
//*     ON THE EXEC STATEMENT - LIBROUT='ANY.DATA.SET.NAME'           *
//*  2. LIBRTAPE EXECUTIONS REQUIRING A CYCLE CONTROL FILE MUST       *
//*     SUPPLY THE FOLLOWING PARAMETER ON THE EXEC STATEMENT -        *
//*     CYCLE='ANY.CYCLE.CONTROL.FILE'                                *
//*********************************************************************
//*                                                                   *
//LIBR     EXEC PGM=LIBRLIBR,PARM='DEPTH=56,NJTA,NRJS',REGION=72K
//STEPLIB  DD   DSN=SYS1.PPLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=A
//INDEX    DD   SYSOUT=A
//LIST     DD   SYSOUT=A
//SYSAF01  DD   UNIT=DISK,DCB=BLKSIZE=2296,SPACE=(CYL,(1,1))
//SYSAF02  DD   UNIT=DISK,DCB=BLKSIZE=2296,SPACE=(CYL,(1,1))
//SYSAF03  DD   UNIT=DISK,DCB=BLKSIZE=820,SPACE=(CYL,(1,1))
//CYCLE    DD   DSN=&CYCLE,DISP=OLD
//BACKUP   DD   DSN=&BKUP,DISP=(&DISP1,KEEP),UNIT=(TAPE,,DEFER),
// DCB=BLKSIZE=3000
//MASTIN   DD   UNIT=(TAPE,,DEFER),DISP=OLD,VOL=SER=DUMMY
//MASTOUT  DD   UNIT=(TAPE,,DEFER),DISP=(NEW,KEEP),DCB=BLKSIZE=3000
//OSJOB    DD   DSN=&LIBROUT,DISP=(NEW,PASS),UNIT=DISK,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680),SPACE=(CYL,(3,1),RLSE,CONTIG)
// PEND
