//RES206       JOB  (5930,5),'PREALLOCATE DATASETS',CLASS=T
//STEP01   EXEC     PGM=IEFBR14
//BXLDCB       DD   DSN=BXLDCB,DISP=(,KEEP),SPACE=(TRK,0),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1280)
//DSCB         DD   DSN=DSCB,DISP=(,KEEP),SPACE=(TRK,0),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//MODLDSCB     DD   DSN=MODLDSCB,DISP=(,KEEP),SPACE=(TRK,0),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//RESERVE      DD   DSN=SYS1.DEADPSCE,DISP=(,KEEP),SPACE=(TRK,13),
//             UNIT=2314,VOL=SER=RES206
//TELCMLIB DD  DSN=SYS1.TELCMLIB,DISP=(,KEEP),SPACE=(TRK,(3,1,2)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//IMAGELIB DD  DSN=SYS1.IMAGELIB,DISP=(,KEEP),SPACE=(TRK,(3,1,3)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//PROCLIB  DD  DSN=SYS1.PROCLIB,DISP=(,KEEP),SPACE=(CYL,(1,,12)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//NUCLEUS      DD  DSN=SYS1.NUCLEUS,DISP=(,KEEP),SPACE=(CYL,(4,,2)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//ASRLIB       DD   DSN=SYS1.ASRLIB,DISP=(,KEEP),SPACE=(TRK,(11,,1)),
//             UNIT=2314,VOL=SER=RES206
//ALGLIB       DD   DSN=SYS1.ALGLIB,DISP=(,KEEP),SPACE=(TRK,(9,1,17)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//EDITLIB      DD   DSN=SYS2.EDITLIB,DISP=(,KEEP),SPACE=(TRK,(15,1,4)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//CONTRLIB DD  DSN=SYS1.CONTRLIB,DISP=(,KEEP),SPACE=(TRK,(5,1,2)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=(,KEEP),SPACE=(CYL,(3,1,40)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//FORTLIB      DD   DSN=SYS1.FORTLIB,DISP=(,KEEP),SPACE=(CYL,(1,1,28)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//PL1LIB       DD  DSN=SYS1.PL1LIB,DISP=(,KEEP),SPACE=(TRK,(50,10,82)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//COBLIB       DD   DSN=SYS1.COBLIB,DISP=(,KEEP),SPACE=(TRK,(25,1,68)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//PARMLIB      DD   DSN=SYS1.PARMLIB,DISP=(,KEEP),SPACE=(TRK,(5,1,3)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//MACLIB2      DD   DSN=SYS2.MACLIB,DISP=(,KEEP),SPACE=(CYL,(1,1,5)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=7280)
//MACLIB       DD   DSN=SYS1.MACLIB,DISP=(,KEEP),SPACE=(CYL,(15,1,17)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=7280)
//FDLIB        DD   DSN=FDLIB,DISP=(,KEEP),SPACE=(CYL,(10,1,17)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//PROCLIB2     DD DSN=SYS2.PROCLIB,DISP=(,KEEP),SPACE=(CYL,(5,1,34)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//LINKLIB2 DD  DSN=SYS2.LINKLIB,DISP=(,KEEP),SPACE=(CYL,(20,2,51)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//SMSRTLIB     DD   DSN=SM01.SORTLIB,DISP=(,KEEP),SPACE=(CYL,(2,1,34)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//LOGREC       DD   DSN=SYS1.LOGREC,DISP=(,KEEP),SPACE=(CYL,2,,CONTIG),
//             UNIT=2314,VOL=SER=RES206
//HASPOLIB     DD   DSN=SYS2.HASPOLIB,DISP=(,KEEP),SPACE=(CYL,1),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=1024)
//SYSJOBQE DD  DSN=SYS1.SYSJOBQE,DISP=(,KEEP),SPACE=(CYL,(7),,CONTIG),
//             UNIT=2314,VOL=SER=RES206
//SVCLIB       DD  DSN=SYS1.SVCLIB,DISP=(,KEEP),SPACE=(CYL,(10,1,151)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//SYSCTLG      DD   DSN=SYSCTLG,DISP=(,KEEP),SPACE=(TRK,10),
//             UNIT=2314,VOL=SER=RES206
//LINKLIB1 DD  DSN=SYS1.LINKLIB,DISP=(,KEEP),SPACE=(CYL,(45,1,170)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//ACCT         DD   DSN=SYS1.ACCT,DISP=(,KEEP),SPACE=(CYL,10,,CONTIG),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=F,LRECL=160,BLKSIZE=160)
//DUMP         DD   DSN=SYS1.DUMP,DISP=(,KEEP),SPACE=(CYL,9,,CONTIG),
//             UNIT=2314,VOL=SER=RES206
//TESTLIB      DD   DSN=TESTLIB,DISP=(,KEEP),SPACE=(CYL,(5,1,17)),
//             UNIT=2314,VOL=SER=RES206,
//             DCB=(RECFM=U,BLKSIZE=7294)
//STEP01A   EXEC   MOD,DD1=RES206
000940ME DSNAME=SYS1.CONTRLIB,VOL=2314=RES206,NEWNAME=SYS2.CONTRLIB
/*
//STEP02   EXEC     MAPDISK,DD1=RES206
