//DCLOAD JOB (1140,5,,,104),CARTWRIGHT,CLASS=T
/*MESSAGE      USE A SCRATCH TAPE - DO NOT KEEP
//TOTAPE       EXEC PGM=COPY
//SYSPRINT     DD   SYSOUT=A
//SYSUT2       DD   DSN=&&IEHMOVE,DISP=(,PASS),UNIT=TAPE,
//             LABEL=(,BLP),VOL=SER=SCRTCH,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSUT1       DD   *,DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)
/*
//LOAD EXEC PGM=IEHMOVE
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD UNIT=SYSDA,SPACE=(CYL,(2,2))
//SPOOL DD UNIT=DISK,DISP=SHR,VOL=SER=SPOOL1
//NEWTAPE      DD   DSN=&&IEHMOVE,DISP=(OLD,DELETE),
//             UNIT=TAPE,LABEL=(,BLP),
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN DD *
 COPY PDS=SYS.DNKTEMP,TO=DISK=SPOOL1,FROM=TAPE=SCRTCH,CATLG,           C
               RENAME=SYS2.FORTREAD,FROMDD=NEWTAPE
/*
//LKED EXEC PGM=IEWL,PARM='XREF,LIST,LET'
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD UNIT=SYSDA,SPACE=(TRK,(3,1))
//SYSLMOD      DD   DSN=SYS2.REREAD,DISP=(,CATLG),UNIT=DISK,
//             VOL=SER=SYSRES,SPACE=(TRK,(1,1,1)),LABEL=EXPDT=99365,
//             DCB=SYS1.FORTLIB
//FORTREAD     DD   DSN=SYS2.FORTREAD,DISP=OLD,UNIT=DISK,VOL=SER=SPOOL1
//SYSLIN DD *
 INCLUDE FORTREAD(IHCECOMH)
 ENTRY IBCOM#
 ALIAS IBCOM#
 NAME IHCECOMH(R)
/*
//NEXTJOB      EXEC RELEASE,JOB=FRDRPROC
//FRDRPROC     JOB  (1140,5),'FORTRAN PROCS',CLASS=N
/*SETUP
//ALTER        EXEC PGM=SHARDISK,PARM='MOPUT2,IEBUPDTE'
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DISP=SHR,DSN=SYS1.PROCLIB
//SYSUT2       DD   DISP=SHR,DSN=SYS1.PROCLIB
//SYSDISK      DD   DISP=SHR,DSN=SYS1.PROCLIB
//SYSIN        DD   DATA
./             CHANGE LIST=ALL,NAME=FORTECG
//FORTECG      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTECL
//FORTECL      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTECLG
//FORTECLG     PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTELG
//FORTELG      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTGCL
//FORTGCL      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTGCLD
//FORTGCLD     PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTGCLG
//FORTGCLG     PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTGLG
//FORTGLG      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTHCL
//FORTHCL      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTHCLD
//FORTHCLD     PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTHCLG
//FORTHCLG     PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
./             CHANGE LIST=ALL,NAME=FORTHLG
//FORTHLG      PROC LKLBDSN='SYS1.FORTLIB'
//SYSLIB       DD   DSN=&LKLBDSN,DISP=SHR
//             DD   DSN=SYS1.FORTLIB,DISP=SHR
/*
//TEST         EXEC RELEASE,JOB=DCFORT12
//DCFORT12 JOB (1140,5,,,104),CARTWTIGHT,CLASS=N
/*SETUP
//COMPILE EXEC FORTGCLG,LKLBDSN='SYS2.REREAD'
//FORT.SYSIN DD *
   51 FORMAT(A4)
   52 FORMAT(G1.0)
   61 FORMAT(/4X,A4)
   62 FORMAT(4X,I4)
  121 FORMAT('CRAP')
      READ(5,51) I
      WRITE(6,61) I
      I=0
      READ(12,51) I
      WRITE(6,61) I
      WRITE(12,121)
      I=0
      READ(12,51) I
      WRITE(6,61) I
      READ(5,52) I
      WRITE(6,62) I
      RETURN
      END
/*
//LKED.SYSLIB DD DISP=SHR,DSN=SYS2.REREAD
//            DD DISP=SHR,DSN=SYS1.FORTLIB
//            DD DISP=SHR,DSN=SYS2.LINKLIB
//GO.SYSIN DD *
1234
          89*
10
                           8910
4321
ABCD
/*
//
