//PSGALLOC     JOB  (5930,5),'STAGE1 DATASETS R216',CLASS=T               000010
//STEP01   EXEC     PGM=IEHPROGM                                          000020
//SYSPRINT     DD   SYSOUT=A                                              000030
//UT1          DD   DSN=SYS1.UT1,DISP=(,KEEP),                            000040
//             UNIT=DISK,VOL=SER=SYSPK4,SPACE=(CYL,(12,1))                000050
//UT2          DD   DSN=SYS1.UT2,DISP=(,KEEP),                            000060
//             UNIT=DISK,VOL=SER=SYSPK2,SPACE=(CYL,(8,1))                 000070
//UT3          DD   DSN=SYS1.UT3,DISP=(,KEEP),                            000080
//             UNIT=DISK,VOL=SER=SYSPK1,SPACE=(CYL,(14,1))                000090
//R206LIB      DD   DSN=SYS1.R206LIB,DISP=(,KEEP),                        000100
//             UNIT=DISK,VOL=SER=SYSPK4,SPACE=(CYL,(5,1,17)),             000110
//             DCB=(RECFM=U,BLKSIZE=7294)                                 000120
//STAGE2       DD   DSN=SYS2.STAGE2.AUG973,DISP=(,KEEP),                  000130
//             UNIT=DISK,VOL=SER=SYSPK4,SPACE=(CYL,(3,1)),                000140
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)                       000150
//GENLIB       DD   DSN=SYS1.GENLIB,UNIT=DISK,VOL=SER=DLIB02,DISP=OLD     000160
//SYSIN        DD   *                                                     000170
     UNCATLG   DSNAME=SYS1.UT1                                            000180
     UNCATLG   DSNAME=SYS1.UT2                                            000190
     UNCATLG   DSNAME=SYS1.UT3                                            000200
     UNCATLG   DSNAME=SYS1.UT4                                            000210
     CATLG     DSNAME=SYS1.UT1,VOL=DISK=SYSPK4                            000220
     CATLG     DSNAME=SYS1.UT2,VOL=DISK=SYSPK2                            000230
     CATLG     DSNAME=SYS1.UT3,VOL=DISK=SYSPK1                            000240
     CATLG  DSNAME=SYS1.R206LIB,VOL=2314=SYSPK4                           000250
     CATLG   DSNAME=SYS2.STAGE2.AUG973,VOL=2314=SYSPK4                    000260
     RENAME    DSNAME=SYS1.GENLIB,VOL=DISK=DLIB02,MEMBER=SGGBLPAK,     C  000270
               NEWNAME=SGPAK96                                            000280
     RENAME    DSNAME=SYS1.GENLIB,VOL=DISK=DLIB02,MEMBER=SGPAK248,     C  000290
               NEWNAME=SGGBLPAK                                           000300
/*                                                                        000310
