//FIXDATES     JOB  (1140,5),'OF DSCBS',CLASS=T                           000010
//S01      EXEC     PGM=UTLXDSCB,PARM='00000'                             000020
//SYSDISK      DD   DSN=DSCB,DISP=SHR                                     000030
//S02      EXEC     PGM=UTLXDSCB,PARM='00000'                             000040
//SYSDISK      DD   DSN=BXLDCB,DISP=SHR                                   000050
//S03      EXEC     PGM=UTLXDSCB,PARM='00000'                             000060
//SYSDISK      DD   DSN=MODLDSCB,DISP=OLD                                 000070
//STEP04   EXEC     MAPDISK,DD1=RES206                                    000080
//ABEND806     JOB  (5930,5),PAT,CLASS=T                                  000090
//STEP01       EXEC  PGM=PHANTOM                                          000100
//INPLACE      JOB  (5930,5),'CHECK FOR I/O ERROR',CLASS=T                000110
//STEP02   EXEC   LISTPDS                                                 000120
//SYSUT1       DD   DSN=SYS1.PROCLIB,UNIT=2314,VOL=SER=SYSRES,DISP=OLD    000130
   GROUP NAME=LISTPD                                                      000140
/*                                                                        000150
//STEP02   EXEC     PGM=IEBUPDTE                                          000160
//SYSPRINT     DD   SYSOUT=A                                              000170
//SYSUT1       DD   DSN=SYS1.PROCLIB,UNIT=2314,VOL=SER=SYSRES,DISP=OLD    000180
//SYSIN  DD   DATA                                                        000190
./   CHANGE   UPDATE=INPLACE,NAME=LISTPDS,SEQFLD=783                      000200
//STEPLIB      DD   DSN=SYS2.LINKLIB,DISP=SHR                             000210
//*            A SYSUT4 CARD NO LONGER REQD.                              000220
/*                                                                        000230
V (230,231,232,233,234,235,236),OFFLINE                                   000240
//TESTPL1L     JOB  (5930,5,,,104),'AFTER SYSGEN',CLASS=N                 000250
//S1   EXEC   PL1LFCLG,PARM.PL1L='S,NL,A,X,LD,ND,SM=(2,72),EB,C',         000260
//             PARM.LKED='LET'
//PL1L.SYSIN DD *
 IEMSP2 : PROCEDURE OPTIONS(MAIN);
 /* THIS PROGRAM TRANSFERS CARD IMAGES FROM ONE FILE TO ANOTHER.
 /* EACH IMAGE HAS A TYPE NUMBER AS FIRST CHARACTER.THE PROGRAM
 /* RECORDS THE NUMBER OF CARDS THERE ARE OF EACH TYPE. */
    DECLARE CARDS INPUT ENVIRONMENT(F(80)) ,
            BUILD OUTPUT ENVIRONMENT(F(480,80)),
          1 CARD,
          2 TYP CHAR(1),
          2 BODY CHAR(79),
            T FIXED BINARY,
            TYPE(0:9) FIXED(3) STATIC INITIAL((10) 0 );
    PUT EDIT('OUTPUT OF PL/1 SAMPLE PROGRAM')(COLUMN(45),A) PAGE;
    ON ENDFILE(CARDS) GOTO FINISH;
    ON CONVERSION BEGIN;PUT EDIT
 ('THIS CARD IGNORED BECAUSE TYPE IS NOT NUMERIC := ',CARD)(A) SKIP(2);
    GOTO LOOP; END;
 LOOP: READ FILE(CARDS) INTO(CARD);
    T=TYP;TYPE(T) = TYPE(T) + 1;
    WRITE FROM(CARD) FILE(BUILD);
    GOTO LOOP;
 FINISH: PUT DATA(TYPE) SKIP(3);
    PUT EDIT('END OF SAMPLE OUTPUT')(COLUMN(47),A) SKIP(2);
    END IEMSP2;
/*
//GO.SYSABEND  DD  SYSOUT=A
//GO.BUILD DD UNIT=SYSDA,SPACE=(480,(10,5))
//GO.CARDS DD *,DCB=BLKSIZE=80
2    FIRST OF DATA FOR PL1 SAMPLE PROGRAM
6
6 THE
8  CONTENTS
6   OF
2   THESE
4     CARDS
7      IMMATERIAL
2       SINCE
0       THEY
6        ARE
6         ONLY
6          TRANSMITTED
6           NOT
6            PRINTED
6
&       DELIBERATE DUD CARD
6
2   LAST OF SOURCE DATA FOR PL1 SAMPLE
/*
//TESTCOBE     JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       000760
//PSG   EXEC   COBECG                                                     000770
//COB.SYSIN DD *
000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID. 'TCECBP01'.
000020 REMARKS.
000030     MINIMUM ENVIRONMENT REQUIRED TO COMPILE AND EXECUTE
000040         SYSTEM/360 MODEL 30 WITH 32K STORAGE
000050         CONTROL PROGRAM
000060         COBOL COMPILER E
000070     SPECIAL OPERATOR INSTRUCTIONS-NONE
000080     PURPOSE
000090         TEST THE COBOL COMPILERS ABILITY TO READ AND
000100         WRITE FROM TAPE CHECKING PROPER DATA ALIGNMENT
000110         WHERE DATA IS A MIXTURE OF DISPLAY COMPUTATIONAL
000120         AND COMPUTATIONAL-3.
000130         FILES ARE HOMOGENEOUS HETROGENEOUS EQUAL AND DIFFERING.
000140     PREREQUISITES
000150         ALL PREVIOUS GROUP A AND B TEST CASES OPERATIONAL.
000160     INDIVIDUAL TEST CASES IN THIS PROGRAM
000170         GROUP B
000180         LEVEL P
000190         TEST CASE 1
000200     NUMBER OF SOURCE STATEMENTS
000210         575
000220     EXPECTED RESULTS
000230         HEADING
000240         END OF TEST
000250     ERROR INDICATIONS
000260         ********** (PARAGRAPH-NAME)  FAILED
000270     DATE STARTED TEST WRITING
000280         JANUARY 25 1965
000290     DATE FINISHED TEST WRITING
000300         JANUARY 28 1965
000310     DATE DEBUGGED ON CURRENT SYSTEM
000320
000330     DATE ADDED TO ATP SYSTEM
000340
000350 AUTHOR.
000360         D50 TEST AND RELEASE PROCESSOR A GROUP
000370         P J MITCHELL
000380 ENVIRONMENT DIVISION.
000390 CONFIGURATION SECTION.
000400 SOURCE-COMPUTER. IBM-360 E50.
000410 OBJECT-COMPUTER. IBM-360 E50.
000420 INPUT-OUTPUT SECTION.
000430 FILE-CONTROL.
000440     SELECT HOMO-WRITE-FILE1-FIXED ASSIGN TO
           'SYS004'
000460     UTILITY.
000470     SELECT HOMO-READ-FILE1-FIXED ASSIGN TO
           'SYS004'
000490     UTILITY.
000500     SELECT HETRO-WRITE-FILE1-EQUAL ASSIGN TO
           'SYS005'
000520     UTILITY.
000530     SELECT  HETRO-READ-FILE1-EQUAL ASSIGN TO
           'SYS005'
000550     UTILITY.
000560     SELECT  HETRO-WRITE-FILE1-DIFF ASSIGN TO
           'SYS006'
000580     UTILITY.
000590     SELECT  HETRO-READ-FILE1-DIFF ASSIGN TO
           'SYS006'
000610     UTILITY.
000620 DATA DIVISION.
000630 FILE SECTION.
000640 FD  HOMO-READ-FILE1-FIXED
000650     RECORD CONTAINS 24 CHARACTERS
000660     RECORDING MODE IS F
000670     LABEL RECORDS ARE OMITTED
000680     DATA RECORD IS REC-1.
000690 01  REC-1.
000700 02  FORMAT-1-REC-1.
000710 03  NUM-1-REC-1 PICTURE 9 DISPLAY.
000720 03  FILLER PICTURE 9(1).
000730 03  NUM-2-REC-1     PICTURE S9(4)                  COMPUTATIONAL.
000740 03  NUM-3-REC-1 PICTURE 9 DISPLAY.
000750 03  FILLER PICTURE 9(3).
000760 03  NUM-4-REC-1     PICTURE S9(9)                  COMPUTATIONAL.
000770 03  NUM-5-REC-1   PICTURE 999 COMPUTATIONAL-3.
000780 03  FILLER PICTURE 9(2).
000790 03  NUM-6-REC-1     PICTURE S9(18)                 COMPUTATIONAL.
000800 02  FORMAT-2-REC-1 REDEFINES FORMAT-1-REC-1.
000810 03  NUM-7-REC-1   PICTURE 9(15) DISPLAY.
000820 03  NUM-8-REC-1  REDEFINES NUM-7-REC-1.
000830 04  NUM-9-REC-1   PICTURE 9(7) DISPLAY.
000840 04  NUM-10-REC-1   PICTURE 9(8)  DISPLAY.
000850 04  NUM-11-REC-1 REDEFINES NUM-10-REC-1.
000860 05  NUM-12-REC-1   PICTURE 9(4) DISPLAY.
000870 05  NUM-13-REC-1   PICTURE 9(4) DISPLAY.
000880 03  FILLER PICTURE 9(1).
000890 03  NUM-14-REC-1    PICTURE S9(18)                 COMPUTATIONAL.
000900 02  FORMAT-3-REC-1   REDEFINES FORMAT-2-REC-1.
000910 03  NUM-15-REC-1 OCCURS 24 TIMES PICTURE   9 DISPLAY.
000920 FD  HOMO-WRITE-FILE1-FIXED
000930     RECORD CONTAINS 24 CHARACTERS
000940     RECORDING MODE IS F
000950     LABEL RECORDS ARE OMITTED
000960     DATA RECORD IS REC-2.
000970 01  REC-2.
000980 02  FORMAT-1-REC-2.
000990 03  NUM-1-REC-2 PICTURE 9 DISPLAY.
001000 03  NUM-2-REC-2     PICTURE S9(4)                  COMPUTATIONAL.
001010 03  NUM-3-REC-2 PICTURE 9 DISPLAY.
001020 03  NUM-4-REC-2     PICTURE S9(9)                  COMPUTATIONAL.
001030 03  NUM-5-REC-2   PICTURE 999 COMPUTATIONAL-3.
001040 03  NUM-6-REC-2     PICTURE S9(18)                 COMPUTATIONAL.
001050 02  FORMAT-2-REC-2 REDEFINES FORMAT-1-REC-2.
001060 03  NUM-7-REC-2   PICTURE 9(15) DISPLAY.
001070 03  NUM-8-REC-2  REDEFINES NUM-7-REC-2.
001080 04  NUM-9-REC-2   PICTURE 9(7) DISPLAY.
001090 04  NUM-10-REC-2   PICTURE 9(8)  DISPLAY.
001100 04  NUM-11-REC-2 REDEFINES NUM-10-REC-2.
001110 05  NUM-12-REC-2   PICTURE 9(4) DISPLAY.
001120 05  NUM-13-REC-2   PICTURE 9(4) DISPLAY.
001130 03  NUM-14-REC-2    PICTURE S9(18)                 COMPUTATIONAL.
001140 02  FORMAT-3-REC-2   REDEFINES FORMAT-2-REC-2.
001150 03  NUM-15-REC-2 OCCURS 24 TIMES PICTURE   9 DISPLAY.
001160 FD  HETRO-READ-FILE1-EQUAL
001170     RECORD CONTAINS 24 CHARACTERS
001180     RECORDING MODE IS F
001190     LABEL RECORDS ARE OMITTED
001200     DATA RECORDS ARE REC-3 REC-5.
001210 01  REC-3.
001220 02  FORMAT-1-REC-3.
001230 03  NUM-1-REC-3 PICTURE 9 DISPLAY.
001240 03  FILLER PICTURE 9(1).
001250 03  NUM-2-REC-3     PICTURE S9(4)                  COMPUTATIONAL.
001260 03  NUM-3-REC-3 PICTURE 9 DISPLAY.
001270 03  FILLER PICTURE 9(3).
001280 03  NUM-4-REC-3     PICTURE S9(9)                  COMPUTATIONAL.
001290 03  NUM-5-REC-3   PICTURE 999 COMPUTATIONAL-3.
001300 03  FILLER PICTURE 9(2).
001310 03  NUM-6-REC-3     PICTURE S9(18)                 COMPUTATIONAL.
001320 02  FORMAT-2-REC-3 REDEFINES FORMAT-1-REC-3.
001330 03  NUM-7-REC-3   PICTURE 9(15) DISPLAY.
001340 03  NUM-8-REC-3  REDEFINES NUM-7-REC-3.
001350 04  NUM-9-REC-3   PICTURE 9(7) DISPLAY.
001360 04  NUM-10-REC-3   PICTURE 9(8)  DISPLAY.
001370 04  NUM-11-REC-3 REDEFINES NUM-10-REC-3.
001380 05  NUM-12-REC-3   PICTURE 9(4) DISPLAY.
001390 05  NUM-13-REC-3   PICTURE 9(4) DISPLAY.
001400 03  FILLER PICTURE 9(1).
001410 03  NUM-14-REC-3    PICTURE S9(18)                 COMPUTATIONAL.
001420 02  FORMAT-3-REC-3   REDEFINES FORMAT-2-REC-3.
001430 03  NUM-15-REC-3 OCCURS 24 TIMES PICTURE   9 DISPLAY.
001440 01  REC-5.
001450 03  NUM-6-REC-5     PICTURE S9(18)                 COMPUTATIONAL.
001460 03  NUM-5-REC-5   PICTURE 999 COMPUTATIONAL-3.
001470 03  FILLER PICTURE 9(2).
001480 03  NUM-4-REC-5     PICTURE S9(9)                  COMPUTATIONAL.
001490 03  NUM-3-REC-5 PICTURE 9 DISPLAY.
001500 03  FILLER PICTURE 9(1).
001510 03  NUM-2-REC-5     PICTURE S9(4)                  COMPUTATIONAL.
001520 03  NUM-1-REC-5 PICTURE 9(4) DISPLAY.
001530 FD  HETRO-WRITE-FILE1-EQUAL
001540     RECORD CONTAINS 24 CHARACTERS
001550     RECORDING MODE IS F
001560     LABEL RECORDS ARE OMITTED
001570     DATA RECORDS ARE REC-4 REC-6.
001580 01  REC-4.
001590 02  FORMAT-1-REC-4.
001600 03  NUM-1-REC-4 PICTURE 9 DISPLAY.
001610 03  NUM-2-REC-4     PICTURE S9(4)                  COMPUTATIONAL.
001620 03  NUM-3-REC-4 PICTURE 9 DISPLAY.
001630 03  NUM-4-REC-4     PICTURE S9(9)                  COMPUTATIONAL.
001640 03  NUM-5-REC-4   PICTURE 999 COMPUTATIONAL-3.
001650 03  NUM-6-REC-4     PICTURE S9(18)                 COMPUTATIONAL.
001660 02  FORMAT-2-REC-4 REDEFINES FORMAT-1-REC-4.
001670 03  NUM-7-REC-4   PICTURE 9(15) DISPLAY.
001680 03  NUM-8-REC-4  REDEFINES NUM-7-REC-4.
001690 04  NUM-9-REC-4   PICTURE 9(7) DISPLAY.
001700 04  NUM-10-REC-4   PICTURE 9(8)  DISPLAY.
001710 04  NUM-11-REC-4 REDEFINES NUM-10-REC-4.
001720 05  NUM-12-REC-4   PICTURE 9(4) DISPLAY.
001730 05  NUM-13-REC-4   PICTURE 9(4) DISPLAY.
001740 03  NUM-14-REC-4    PICTURE S9(18)                 COMPUTATIONAL.
001750 02  FORMAT-3-REC-4   REDEFINES FORMAT-2-REC-4.
001760 03  NUM-15-REC-4 OCCURS 24 TIMES PICTURE   9 DISPLAY.
001770 01  REC-6.
001780 03  NUM-6-REC-6     PICTURE S9(18)                 COMPUTATIONAL.
001790 03  NUM-5-REC-6   PICTURE 999 COMPUTATIONAL-3.
001800 03  NUM-4-REC-6     PICTURE S9(9)                  COMPUTATIONAL.
001810 03  NUM-3-REC-6 PICTURE 9 DISPLAY.
001820 03  NUM-2-REC-6     PICTURE S9(4)                  COMPUTATIONAL.
001830 03  NUM-1-REC-6 PICTURE 9(4) DISPLAY.
001840 FD  HETRO-READ-FILE1-DIFF
001850     RECORD CONTAINS 21 TO 24 CHARACTERS
001860     LABEL RECORDS ARE OMITTED
001870     DATA RECORDS ARE REC-7 REC-9.
001880 01  REC-7.
001890 02  FORMAT-1-REC-7.
001900 03  NUM-1-REC-7 PICTURE 9 DISPLAY.
001910 03  FILLER PICTURE 9(1).
001920 03  NUM-2-REC-7     PICTURE S9(4)                  COMPUTATIONAL.
001930 03  NUM-3-REC-7 PICTURE 9 DISPLAY.
001940 03  FILLER PICTURE 9(3).
001950 03  NUM-4-REC-7     PICTURE S9(9)                  COMPUTATIONAL.
001960 03  NUM-5-REC-7   PICTURE 999 COMPUTATIONAL-3.
001970 03  FILLER PICTURE 9(2).
001980 03  NUM-6-REC-7     PICTURE S9(18)                 COMPUTATIONAL.
001990 02  FORMAT-2-REC-7 REDEFINES FORMAT-1-REC-7.
002000 03  NUM-7-REC-7 PICTURE 9(15) DISPLAY.
002010 03  NUM-8-REC-7  REDEFINES NUM-7-REC-7.
002020 04  NUM-9-REC-7   PICTURE 9(7) DISPLAY.
002030 04  NUM-10-REC-7   PICTURE 9(8)  DISPLAY.
002040 04  NUM-11-REC-7 REDEFINES NUM-10-REC-7.
002050 05  NUM-12-REC-7   PICTURE 9(4) DISPLAY.
002060 05  NUM-13-REC-7   PICTURE 9(4) DISPLAY.
002070 03  FILLER PICTURE 9(1).
002080 03  NUM-14-REC-7    PICTURE S9(18)                 COMPUTATIONAL.
002090 02  FORMAT-3-REC-7   REDEFINES FORMAT-2-REC-7.
002100 03  NUM-15-REC-7 OCCURS 24 TIMES PICTURE   9 DISPLAY.
002110 01  REC-9.
002120 03  NUM-6-REC-9     PICTURE S9(18)                 COMPUTATIONAL.
002130 03  NUM-5-REC-9   PICTURE 999 COMPUTATIONAL-3.
002140 03  FILLER PICTURE 9(2).
002150 03  NUM-4-REC-9     PICTURE S9(9)                  COMPUTATIONAL.
002160 03  NUM-3-REC-9 PICTURE 9 DISPLAY.
002170 03  FILLER PICTURE 9(1).
002180 03  NUM-2-REC-9     PICTURE S9(4)                  COMPUTATIONAL.
002190 03  NUM-1-REC-9 PICTURE 9 DISPLAY.
002200 FD  HETRO-WRITE-FILE1-DIFF
002210     RECORD CONTAINS 21 TO 24 CHARACTERS
002220     LABEL RECORDS ARE OMITTED
002230     DATA RECORDS ARE REC-8 REC-10.
002240 01  REC-8.
002250 02  FORMAT-1-REC-8.
002260 03  NUM-1-REC-8 PICTURE 9 DISPLAY.
002270 03  NUM-2-REC-8     PICTURE S9(4)                  COMPUTATIONAL.
002280 03  NUM-3-REC-8 PICTURE 9 DISPLAY.
002290 03  NUM-4-REC-8     PICTURE S9(9)                  COMPUTATIONAL.
002300 03  NUM-5-REC-8   PICTURE 999 COMPUTATIONAL-3.
002310 03  NUM-6-REC-8     PICTURE S9(18)                 COMPUTATIONAL.
002320 02  FORMAT-2-REC-8 REDEFINES FORMAT-1-REC-8.
002330 03  NUM-7-REC-8   PICTURE 9(15) DISPLAY.
002340 03  NUM-8-REC-8  REDEFINES NUM-7-REC-8.
002350 04  NUM-9-REC-8   PICTURE 9(7) DISPLAY.
002360 04  NUM-10-REC-8   PICTURE 9(8)  DISPLAY.
002370 04  NUM-11-REC-8 REDEFINES NUM-10-REC-8.
002380 05  NUM-12-REC-8   PICTURE 9(4) DISPLAY.
002390 05  NUM-13-REC-8   PICTURE 9(4) DISPLAY.
002400 03  NUM-14-REC-8    PICTURE S9(18)                 COMPUTATIONAL.
002410 02  FORMAT-3-REC-8   REDEFINES FORMAT-2-REC-8.
002420 03  NUM-15-REC-8 OCCURS 24 TIMES PICTURE   9 DISPLAY.
002430 01  REC-10.
002440 03  NUM-6-REC-10    PICTURE S9(18)                 COMPUTATIONAL.
002450 03  NUM-5-REC-10  PICTURE 999 COMPUTATIONAL-3.
002460 03  NUM-4-REC-10    PICTURE S9(9)                  COMPUTATIONAL.
002470 03  NUM-3-REC-10 PICTURE 9 DISPLAY.
002480 03  NUM-2-REC-10    PICTURE S9(4)                  COMPUTATIONAL.
002490 03  NUM-1-REC-10 PICTURE 9 DISPLAY.
002500 WORKING-STORAGE SECTION.
       77 MESSAGE-1 PICTURE X(50) VALUE
              'INFORMATION AS EXISTS IN BUFFERS / WORKING-STORAGE'.
       77 MESSAGE-2 PICTURE X(41) VALUE
              'RESULTS ARE FOLLOWED BY RESULTS SHOULD BE'.
       77 MESSAGE-3 PICTURE X(48) VALUE
              ' 0                 1                   2        '.
       77 MESSAGE-4 PICTURE X(48) VALUE
              ' 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4'.
002510 77  SUB-1 PICTURE 99 VALUE 00 DISPLAY.
002520 77  SUB-2 PICTURE 99 VALUE 00 DISPLAY.
002530 77  ERROR1   PICTURE X(11) VALUE '********** ' DISPLAY.
       01 PARAGRAPH-NOS.
        02 NAME-1 PICTURE X(10) VALUE 'PARAGRAPH-'.
        02 PARAGRAPH-NO PICTURE 99 VALUE ZERO.
002540 01  PRIMARY-DATA.
002550 02  NUMBER-1 PICTURE 9 VALUE 9 DISPLAY.
002560 02  FILLER   PICTURE 9 VALUE 0 DISPLAY.
002570 02  NUMBER-2        PICTURE S9(4) VALUE 9999       COMPUTATIONAL.
002580 02  NUMBER-3 PICTURE 9 VALUE 9 DISPLAY.
002590 02  FILLER   PICTURE 999 VALUE 000 DISPLAY.
002600 02  NUMBER-4        PICTURE S9(9) VALUE 999999999  COMPUTATIONAL.
002610 02  NUMBER-5 PICTURE 999  VALUE 999 COMPUTATIONAL-3.
002620 02  FILLER   PICTURE 99 VALUE 00 DISPLAY.
002630 02  NUMBER-6        PICTURE S9(18) VALUE 999999999999999999
002640         COMPUTATIONAL.
002650 01  PRIMARY-DATA-1.
002660 02  NUMBER-7 PICTURE 9(15) VALUE 888888888888888 DISPLAY.
002670 02  FILLER   PICTURE 9 VALUE 0 DISPLAY.
002680 02  NUMBER-14       PICTURE S9(18) VALUE 888888888888888888
002690         COMPUTATIONAL.
002700 01  PRIMARY-DATA-2.
002710 02  NUMBER-9  PICTURE 9(7)  VALUE 7777777  DISPLAY.
002720 02  NUMBER-10 PICTURE 9(8)  VALUE 77777777 DISPLAY.
002730 02  FILLER    PICTURE 9     VALUE 0        DISPLAY.
002740 02  NUMBER-14       PICTURE S9(18) VALUE 777777777777777777
002750         COMPUTATIONAL.
002760 01  PRIMARY-DATA-3.
002770 02  NUMBER-9  PICTURE 9(7)  VALUE 6666666  DISPLAY.
002780 02  NUMBER-12 PICTURE 9(4)  VALUE 6666     DISPLAY.
002790 02  NUMBER-13 PICTURE 9(4)  VALUE 6666     DISPLAY.
002800 02  FILLER    PICTURE 9     VALUE 0        DISPLAY.
002810 02  NUMBER-14       PICTURE S9(18) VALUE 666666666666666666
002820         COMPUTATIONAL.
002830 01  PRIMARY-DATA-4.
002840 02  NUMBER-06       PICTURE S9(18) VALUE 999999999999999999
002850         COMPUTATIONAL.
002860 02  NUMBER-05 PICTURE 999   VALUE 999 COMPUTATIONAL-3.
002870 02  FILLER    PICTURE 99 VALUE 00 DISPLAY.
002880 02  NUMBER-04       PICTURE S9(9)  VALUE 999999999 COMPUTATIONAL.
002890 02  NUMBER-03 PICTURE 9 VALUE 9  DISPLAY.
002900 02  FILLER    PICTURE 9 VALUE 0  DISPLAY.
002910 02  NUMBER-02       PICTURE S9(4)  VALUE 9999      COMPUTATIONAL.
002920 02  NUMBER-01 PICTURE 9999 VALUE 9999 DISPLAY.
002930 01  PRIMARY-DATA-5.
002940 02  NUMBER-06       PICTURE S9(18) VALUE 888888888888888888
002950         COMPUTATIONAL.
002960 02  NUMBER-05 PICTURE 999 VALUE 888 COMPUTATIONAL-3.
002970 02      FILLER    PICTURE 99 VALUE 00 DISPLAY.
002980 02  NUMBER-04       PICTURE S9(9)  VALUE 888888888 COMPUTATIONAL.
002990 02  NUMBER-03 PICTURE 9 VALUE 8 DISPLAY.
003000 02  FILLER    PICTURE 9 VALUE 0 DISPLAY.
003010 02  NUMBER-02       PICTURE S9(4)  VALUE 8888      COMPUTATIONAL.
003020 02  NUMBER-01 PICTURE 9 VALUE 8 DISPLAY.
003030 01  TEST-AREAS.
003040 02  TEST-AREA-RD.
003050 03  TRD OCCURS 24 TIMES PICTURE X.
003060 02  TEST-AREA-WT.
003070 03  TWT OCCURS 48 TIMES PICTURE X.
003080 PROCEDURE DIVISION.
003090 DISPLAY-HEADER.
003100     DISPLAY '          GROUP B LEVEL P TEST CASE 1'.
003110     DISPLAY ' '.
003120 01-FDSLACKTEST.
003130     PERFORM 31-OPEN-OUT-FILES.
       PARAGRAPH-01.
003140     PERFORM 50-SETUP-FORMAT-1-REC-2-4-8 THRU 51-EXIT.
           IF FORMAT-1-REC-2 NOT = PRIMARY-DATA   PERFORM 62-MESSAGE
           MOVE FORMAT-1-REC-2 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT MOVE PRIMARY-DATA    TO
           TEST-AREA-RD PERFORM 27-PRINT-ROUTINE THRU 28-EXIT
           ELSE NEXT SENTENCE.
       PARAGRAPH-02.
003170     PERFORM 52-SETUP-FORMAT-2-RD THRU 53-EXIT.
           IF FORMAT-2-REC-2 NOT = PRIMARY-DATA-1 PERFORM 62-MESSAGE
           MOVE FORMAT-2-REC-2 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT MOVE PRIMARY-DATA-1  TO
           TEST-AREA-RD PERFORM 27-PRINT-ROUTINE THRU 28-EXIT
           ELSE NEXT SENTENCE.
       PARAGRAPH-03.
           PERFORM 54-SETUP-FORMAT-2-RD2 THRU 55-EXIT.
           IF FORMAT-2-REC-2 NOT = PRIMARY-DATA-2 PERFORM 62-MESSAGE
           MOVE FORMAT-2-REC-2 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT MOVE PRIMARY-DATA-2  TO
           TEST-AREA-RD PERFORM 27-PRINT-ROUTINE THRU 28-EXIT
           ELSE NEXT SENTENCE.
       PARAGRAPH-04.
003230     PERFORM 56-SETUP-FORMAT-3-RD3 THRU 57-EXIT.
           IF FORMAT-2-REC-2 NOT = PRIMARY-DATA-3 PERFORM 62-MESSAGE
           MOVE FORMAT-2-REC-2 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT MOVE PRIMARY-DATA-3  TO
           TEST-AREA-RD PERFORM 27-PRINT-ROUTINE THRU 28-EXIT
           ELSE NEXT SENTENCE.
003260     PERFORM 33-CLOSE-OUT-FILES.
003270 02-FORMAT-1-REC-1-2-CHK.
003280     OPEN OUTPUT HOMO-WRITE-FILE1-FIXED.
003290     WRITE REC-2 FROM PRIMARY-DATA.
003300     CLOSE HOMO-WRITE-FILE1-FIXED.
003310     OPEN INPUT HOMO-READ-FILE1-FIXED.
003320     READ HOMO-READ-FILE1-FIXED AT END GO TO 11-EARLY-END-FILE.
003340     IF FORMAT-1-REC-1 EQUAL TO PRIMARY-DATA NEXT SENTENCE ELSE
           PERFORM 19-HOMO-FD-ERROR.
003330     CLOSE HOMO-READ-FILE1-FIXED.
003360 03-FORMAT-2-RD-CHK.
003370     OPEN OUTPUT HOMO-WRITE-FILE1-FIXED.
003380     WRITE REC-2 FROM PRIMARY-DATA-1.
003390     CLOSE HOMO-WRITE-FILE1-FIXED.
003400     OPEN INPUT HOMO-READ-FILE1-FIXED.
003410     READ HOMO-READ-FILE1-FIXED AT END GO TO 11-EARLY-END-FILE.
003430     IF FORMAT-2-REC-1 EQUAL TO PRIMARY-DATA-1 NEXT SENTENCE ELSE
           PERFORM 20-HOMO-FD-ERROR.
003420     CLOSE HOMO-READ-FILE1-FIXED.
003450 04-FORMAT-2-RD2-CHK.
003460     OPEN OUTPUT HOMO-WRITE-FILE1-FIXED.
003470     WRITE REC-2 FROM PRIMARY-DATA-2.
003480     CLOSE HOMO-WRITE-FILE1-FIXED.
003490     OPEN INPUT  HOMO-READ-FILE1-FIXED.
003500     READ HOMO-READ-FILE1-FIXED AT END GO TO 11-EARLY-END-FILE.
003520     IF FORMAT-2-REC-1 EQUAL TO PRIMARY-DATA-2 NEXT SENTENCE ELSE
           PERFORM 21-HOMO-FD-ERROR.
003510     CLOSE HOMO-READ-FILE1-FIXED.
003540 05-FORMAT-2-RD3-CHK.
003550     OPEN OUTPUT HOMO-WRITE-FILE1-FIXED.
003560     WRITE REC-2 FROM PRIMARY-DATA-3.
003570     CLOSE HOMO-WRITE-FILE1-FIXED.
003580     OPEN  INPUT HOMO-READ-FILE1-FIXED.
003590     READ  HOMO-READ-FILE1-FIXED AT END GO TO 11-EARLY-END-FILE.
003610     IF FORMAT-2-REC-1 EQUAL TO PRIMARY-DATA-3 NEXT SENTENCE ELSE
           PERFORM 22-HOMO-FD-ERROR.
003600     CLOSE HOMO-READ-FILE1-FIXED.
003630 06-RD-IMP-EQU-REC-CHK.
003640     PERFORM 31-OPEN-OUT-FILES.
003650     WRITE REC-4 FROM PRIMARY-DATA.
003660     WRITE REC-4 FROM PRIMARY-DATA-1.
003670     WRITE REC-4 FROM PRIMARY-DATA-2.
003680     WRITE REC-4 FROM PRIMARY-DATA-3.
003690      WRITE REC-6 FROM PRIMARY-DATA-4.
003700     PERFORM 33-CLOSE-OUT-FILES.
003710     PERFORM 31-OPEN-IN-FILES.
003720     READ HETRO-READ-FILE1-EQUAL AT END GO TO 12-EARLY-END-FILE.
           IF FORMAT-1-REC-3 NOT = PRIMARY-DATA
004950     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-1-REC-3 TO TEST-AREA-RD PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT MOVE PRIMARY-DATA   TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT ELSE NEXT SENTENCE.
003750     READ HETRO-READ-FILE1-EQUAL AT END GO TO 12-EARLY-END-FILE.
           IF FORMAT-2-REC-3 NOT = PRIMARY-DATA-1
004950     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-3 TO TEST-AREA-RD PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT MOVE PRIMARY-DATA-1 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT ELSE NEXT SENTENCE.
003780     READ HETRO-READ-FILE1-EQUAL AT END GO TO 12-EARLY-END-FILE.
           IF FORMAT-2-REC-3 NOT = PRIMARY-DATA-2
004950     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-3 TO TEST-AREA-RD PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT MOVE PRIMARY-DATA-2 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT ELSE NEXT SENTENCE.
003810     READ HETRO-READ-FILE1-EQUAL AT END GO TO 12-EARLY-END-FILE.
           IF FORMAT-2-REC-3 NOT = PRIMARY-DATA-3
004950     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-3 TO TEST-AREA-RD PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT MOVE PRIMARY-DATA-3 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT ELSE NEXT SENTENCE.
003840     READ HETRO-READ-FILE1-EQUAL AT END GO TO 12-EARLY-END-FILE.
           IF REC-5          NOT = PRIMARY-DATA-4
004950     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE REC-5          TO TEST-AREA-RD PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT MOVE PRIMARY-DATA-4 TO TEST-AREA-RD PERFORM
           27-PRINT-ROUTINE THRU 28-EXIT ELSE NEXT SENTENCE.
003870     READ HETRO-READ-FILE1-EQUAL AT END GO TO 07-CLOSE-HETRO.
003880     GO TO 13-NO-END-FILE.
003890 07-CLOSE-HETRO.
003900     PERFORM 33-CLOSE-IN-FILES.
003910 08-RD-IMP-DIFF-REC-CHK.
003920     PERFORM 31-OPEN-OUT-FILES.
003930     PERFORM 50-SETUP-FORMAT-1-REC-2-4-8 THRU 51-EXIT.
003940     WRITE REC-8.
003950     WRITE REC-8 FROM PRIMARY-DATA-1.
003960     WRITE REC-8 FROM PRIMARY-DATA-2.
003970     PERFORM 56-SETUP-FORMAT-3-RD3.
003980     WRITE REC-8.
003990     WRITE REC-10 FROM PRIMARY-DATA-5.
004000     PERFORM 60-SETUP-REC-10-DIFF.
004010     WRITE REC-10.
004020     PERFORM 33-CLOSE-OUT-FILES.
004030     PERFORM 31-OPEN-IN-FILES.
004040     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004050     IF FORMAT-1-REC-7 EQUAL TO PRIMARY-DATA NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-1-REC-7 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA   TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004070     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004080     IF FORMAT-2-REC-7 EQUAL TO PRIMARY-DATA-1 NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-7 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA-1 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004100     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004110     IF FORMAT-2-REC-7 EQUAL TO PRIMARY-DATA-2 NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-7 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA-2 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004130     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004140     IF FORMAT-2-REC-7 EQUAL TO PRIMARY-DATA-3 NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE FORMAT-2-REC-7 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA-3 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004160     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004170     IF REC-9 EQUAL TO PRIMARY-DATA-5 NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE REC-9          TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA-5 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004190     READ HETRO-READ-FILE1-DIFF AT END GO TO 15-EARLY-END-FILE.
004200     IF REC-9 EQUAL TO PRIMARY-DATA-5 NEXT SENTENCE ELSE
           DISPLAY ERROR1 '08-RD-IMP-DIFF-REC-CHK FAILED'
           PERFORM 63-MESSAGE
           MOVE REC-9          TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR
           MOVE PRIMARY-DATA-5 TO TEST-AREA-RD
           PERFORM 24-HETRO-DIFF-ERROR.
004220     READ HETRO-READ-FILE1-DIFF AT END GO TO 09-CLOSE-HETRO.
004230     GO TO 16-NO-END-FILE.
004240 09-CLOSE-HETRO.
004250     PERFORM 33-CLOSE-IN-FILES.
004260 10-END-PROGRAM.
004270     DISPLAY '          END OF PROGRAM'.
004280     STOP RUN.
004290 11-EARLY-END-FILE.
004300     DISPLAY ERROR1     '02-FORMAT-1-REC-2-CHK FAILED DUE TO EARLY
004310     ' END OF FILE'.
004320     CLOSE HOMO-READ-FILE1-FIXED.
004330     GO TO 10-END-PROGRAM.
004340 12-EARLY-END-FILE.
004350     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED DUE TO EARLY
004360     ' END OF FILE'.
004370     PERFORM 33-CLOSE-IN-FILES.
004380     GO TO 10-END-PROGRAM.
004390 13-NO-END-FILE.
004400     DISPLAY ERROR1     '06-RD-IMP-EQU-REC-CHK FAILED DUE TO NO EN
004410     'D OF FILE'.
004420     PERFORM 33-CLOSE-IN-FILES.
004430     GO TO 10-END-PROGRAM.
004440 15-EARLY-END-FILE.
004450     DISPLAY ERROR1     '08-RD-IMP-DIFF-REC-CHK FAILED DUE TO EARL
004460     'Y END OF FILE'.
004470     PERFORM 33-CLOSE-IN-FILES.
004480     GO TO 10-END-PROGRAM.
004490 16-NO-END-FILE.
004500     DISPLAY ERROR1     '08-RD-IMP-DIFF-REC-CHK FAILED DUE TO NO E
004510     'ND OF FILE'.
004520     PERFORM 33-CLOSE-IN-FILES.
004530     GO TO 10-END-PROGRAM.
004660 19-HOMO-FD-ERROR.
004670     DISPLAY ERROR1     '02-FORMAT-1-REC-1-2-CHK FAILED'.
           PERFORM 63-MESSAGE.
004680     MOVE FORMAT-1-REC-1 TO TEST-AREA-RD.
                               PERFORM 27-PRINT-ROUTINE THRU 28-EXIT.
           MOVE PRIMARY-DATA   TO TEST-AREA-RD. PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT.
004710 20-HOMO-FD-ERROR.
004720     DISPLAY ERROR1     '03-FORMAT-2-RD-CHK FAILED'.
           PERFORM 63-MESSAGE.
004740     MOVE FORMAT-2-REC-1 TO TEST-AREA-RD.
                               PERFORM 27-PRINT-ROUTINE THRU 28-EXIT.
           MOVE PRIMARY-DATA-1 TO TEST-AREA-RD. PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT.
004760 21-HOMO-FD-ERROR.
004770     DISPLAY ERROR1     '04-FORMAT-2-RD2-CHK FAILED'.
           PERFORM 63-MESSAGE.
           MOVE FORMAT-2-REC-1 TO TEST-AREA-RD.
                               PERFORM 27-PRINT-ROUTINE THRU 28-EXIT.
           MOVE PRIMARY-DATA-2 TO TEST-AREA-RD. PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT.
004790 22-HOMO-FD-ERROR.
004800     DISPLAY ERROR1     '05-FORMAT-2-RD3-CHK FAILED'.
           PERFORM 63-MESSAGE.
           MOVE FORMAT-2-REC-1 TO TEST-AREA-RD.
                               PERFORM 27-PRINT-ROUTINE THRU 28-EXIT.
           MOVE PRIMARY-DATA-3 TO TEST-AREA-RD. PERFORM 27-PRINT-ROUTINE
           THRU 28-EXIT.
005000 24-HETRO-DIFF-ERROR.
005040     PERFORM 27-PRINT-ROUTINE.
005150 27-PRINT-ROUTINE.
005160     MOVE SPACES TO TEST-AREA-WT.
005190     MOVE 1 TO SUB-1.
005200     MOVE 2 TO SUB-2.
005210     PERFORM 29-PRINT-ROUTINE THRU 30-EXIT 24 TIMES.
005220     DISPLAY TEST-AREA-WT.
005230 28-EXIT.
005240     EXIT.
005250 29-PRINT-ROUTINE.
005260     MOVE TRD (SUB-1) TO TWT (SUB-2).
005270     ADD 1 SUB-1 GIVING SUB-1.
005280     ADD 2 SUB-2 GIVING SUB-2.
005290 30-EXIT.
005300     EXIT.
005310 31-OPEN-OUT-FILES.
005320     OPEN OUTPUT HOMO-WRITE-FILE1-FIXED HETRO-WRITE-FILE1-EQUAL
005330     HETRO-WRITE-FILE1-DIFF.
005340 31A-EXIT.
005350     EXIT.
005360 31-OPEN-IN-FILES.
005370     OPEN INPUT HOMO-READ-FILE1-FIXED HETRO-READ-FILE1-EQUAL
005380     HETRO-READ-FILE1-DIFF.
005390 32-EXIT.
005400     EXIT.
005410 33-CLOSE-OUT-FILES.
005420     CLOSE
005430     HOMO-WRITE-FILE1-FIXED
005440     HETRO-WRITE-FILE1-EQUAL
005450     HETRO-WRITE-FILE1-DIFF.
005460 33A-EXIT.
005470     EXIT.
005480 33-CLOSE-IN-FILES.
005490     CLOSE
005500     HOMO-READ-FILE1-FIXED
005510     HETRO-READ-FILE1-EQUAL
005520     HETRO-READ-FILE1-DIFF.
005530 34-EXIT.
005540     EXIT.
005550 50-SETUP-FORMAT-1-REC-2-4-8.
005560     MOVE ZERO TO REC-2 REC-4 REC-8.
005570     MOVE NUMBER-1 TO NUM-1-REC-2 NUM-1-REC-4 NUM-1-REC-8.
005580     MOVE NUMBER-2 TO NUM-2-REC-2 NUM-2-REC-4 NUM-2-REC-8.
005590     MOVE NUMBER-3 TO NUM-3-REC-2 NUM-3-REC-4 NUM-3-REC-8.
005600     MOVE NUMBER-4 TO NUM-4-REC-2 NUM-4-REC-4 NUM-4-REC-8.
005610     MOVE NUMBER-5 TO NUM-5-REC-2 NUM-5-REC-4 NUM-5-REC-8.
005620     MOVE NUMBER-6 TO NUM-6-REC-2 NUM-6-REC-4 NUM-6-REC-8.
005630 51-EXIT.
005640     EXIT.
005650 52-SETUP-FORMAT-2-RD.
005660     MOVE ZERO TO REC-2 REC-4 REC-8.
005670     MOVE NUMBER-7  TO NUM-7-REC-2 NUM-7-REC-4 NUM-7-REC-8.
005680     MOVE NUMBER-14 IN PRIMARY-DATA-1 TO NUM-14-REC-2
005690     NUM-14-REC-4 NUM-14-REC-8.
005700 53-EXIT.
005710     EXIT.
005720 54-SETUP-FORMAT-2-RD2.
005730     MOVE ZERO TO REC-2 REC-4 REC-8.
005740     MOVE NUMBER-10 TO NUM-10-REC-2 NUM-10-REC-4 NUM-10-REC-8.
005750     MOVE NUMBER-14 IN PRIMARY-DATA-2 TO
005760     NUM-14-REC-2 NUM-14-REC-4 NUM-14-REC-8.
005770     MOVE NUMBER-9 IN PRIMARY-DATA-2 TO
005780     NUM-9-REC-2 NUM-9-REC-4 NUM-9-REC-8.
005790 55-EXIT.
005800     EXIT.
005810 56-SETUP-FORMAT-3-RD3.
005820     MOVE ZERO TO REC-2 REC-4 REC-8.
005830     MOVE NUMBER-9 IN PRIMARY-DATA-3 TO
005840     NUM-9-REC-2 NUM-9-REC-4 NUM-9-REC-8.
005850     MOVE NUMBER-12 TO NUM-12-REC-2 NUM-12-REC-4 NUM-12-REC-8.
           MOVE NUMBER-13 TO NUM-13-REC-2 NUM-13-REC-4 NUM-13-REC-8.
005880     MOVE NUMBER-14 IN PRIMARY-DATA-3 TO
005890     NUM-14-REC-2 NUM-14-REC-4 NUM-14-REC-8.
005900 57-EXIT.
005910     EXIT.
005920 58-SETUP-REC-6-EQU.
005930     MOVE ZERO TO REC-6.
005940     MOVE NUMBER-06 IN PRIMARY-DATA-4 TO NUM-6-REC-6.
005950     MOVE NUMBER-05 IN PRIMARY-DATA-4 TO NUM-5-REC-6.
005960     MOVE NUMBER-04 IN PRIMARY-DATA-4 TO NUM-4-REC-6.
005970     MOVE NUMBER-03 IN PRIMARY-DATA-4 TO NUM-3-REC-6.
005980     MOVE NUMBER-02 IN PRIMARY-DATA-4 TO NUM-2-REC-6.
005990     MOVE NUMBER-01 IN PRIMARY-DATA-4 TO NUM-1-REC-6.
006000 59-EXIT.
006010     EXIT.
006020 60-SETUP-REC-10-DIFF.
006030     MOVE ZERO TO REC-10.
006040     MOVE NUMBER-06 IN PRIMARY-DATA-5 TO NUM-6-REC-10.
006050     MOVE NUMBER-05 IN PRIMARY-DATA-5 TO NUM-5-REC-10.
006060     MOVE NUMBER-04 IN PRIMARY-DATA-5 TO NUM-4-REC-10.
006070     MOVE NUMBER-03 IN PRIMARY-DATA-5 TO NUM-3-REC-10.
006080     MOVE NUMBER-02 IN PRIMARY-DATA-5 TO NUM-2-REC-10.
006090     MOVE NUMBER-01 IN PRIMARY-DATA-5 TO NUM-1-REC-10.
006100 61-EXIT.
006110     EXIT.
       62-MESSAGE.
           ADD 1 TO PARAGRAPH-NO. DISPLAY ERROR1 '01-FDSLACKTEST FAILED'
           'IN' PARAGRAPH-NOS. PERFORM 63-MESSAGE.
       63-MESSAGE. DISPLAY MESSAGE-1. DISPLAY MESSAGE-2. DISPLAY
           ' '. DISPLAY MESSAGE-3. DISPLAY MESSAGE-4.
/*
//GO.SYSOUT DD SYSOUT=A,DCB=(,BLKSIZE=120,LRECL=120)
//GO.SYS004    DD   UNIT=2400,LABEL=(,NL)                                 007410
//GO.SYS005    DD   UNIT=2400,LABEL=(,NL)                                 007420
//GO.SYS006    DD   UNIT=2400,LABEL=(,NL)                                 007430
//TESTCOBF     JOB  (5930,5,,,104),'AFTER SYSGEN',CLASS=T                 007440
//S3   EXEC   COBFCLG,PARM.COB='MAP'                                      007450
//COB.SYSPUNCH DD   DUMMY                                                 007460
//COB.SYSLIB   DD   UNIT=SYSDA,SPACE=(TRK,(0,0,1)),DISP=(,PASS)           007470
//COB.SYSABEND DD SYSOUT=A
//COB.SYSIN  DD    *
000000 IDENTIFICATION DIVISION.
000010 PROGRAM-ID. 'TESTRUN'.
000020   AUTHOR. PROGRAMMER NAME.
000030   INSTALLATION. NEW YORK PROGRAMMING CENTER.
000040   DATE-WRITTEN. MAY 31 1966.
000050   DATE-COMPILED.
000060   REMARKS. THIS PROGRAM HAS BEEN WRITTEN AS A SAMPLE PROGRAM FOR
000070     COBOL USERS. IT CREATES AN OUTPUT FILE AND READS IT BACK AS
000080     INPUT.
000090 ENVIRONMENT DIVISION.
000100 CONFIGURATION SECTION.
000110   SOURCE-COMPUTER. IBM-360 E50.
000120   OBJECT-COMPUTER. IBM-360 E50.
000130 INPUT-OUTPUT SECTION.
000140 FILE-CONTROL.
000150     SELECT FILE-1 ASSIGN TO 'SAMPLE' UTILITY.
000160     SELECT FILE-2 ASSIGN TO 'SAMPLE' UTILITY.
000170 DATA DIVISION.
000180 FILE SECTION.
000190 FD  FILE-1
000200     LABEL RECORDS ARE OMITTED
000210     BLOCK CONTAINS 100 CHARACTERS
000220     RECORDING MODE IS F
000230     DATA RECORD IS RECORD-1.
000240   01 RECORD-1.
000250     02 FIELD-A  PICTURE IS X(20).
000260 FD  FILE-2
000270     LABEL RECORDS ARE OMITTED
000280     BLOCK CONTAINS 5 RECORDS
000290     RECORD CONTAINS 20 CHARACTERS
000300     RECORDING MODE IS F
000310     DATA RECORD IS RECORD-2.
000320   01 RECORD-2.
000330     02 FIELD-A  PICTURE IS X(20).
000340 WORKING-STORAGE SECTION.
000350        77 NUMBER  PICTURE S99 COMPUTATIONAL.
000360     77 ALPHABET  PICTURE X(26) VALUE IS 'ABCDEFGHIJKLMNOPQRSTUVWX
000370-    'YZ'.
000380     77 ALPHA REDEFINES ALPHABET PICTURE X OCCURS 26 TIMES.
000390        77 COUNT   PICTURE S99 COMPUTATIONAL.
000400     77 DEPENDENTS  PICTURE X(26) VALUE IS '0123401234012340123401
000410-    '2340'.
000420     77 DEPEND REDEFINES DEPENDENTS PICTURE X OCCURS 26 TIMES.
000430   01 WORK-RECORD.
000440     02 NAME-FIELD  PICTURE X.
000450     02 FILLER  PICTURE X  VALUE SPACE.
000460     02 RECORD-NO  PICTURE XXXX  JUSTIFIED RIGHT.
000470     02 FILLER  PICTURE X  VALUE SPACE.
000480     02 LOCATION  PICTURE AAA VALUE 'NYC'.
000490     02 FILLER  PICTURE X  VALUE SPACE.
000500     02 NO-OF-DEPENDENTS  PICTURE XX.
000510     02 FILLER  PICTURE X(7)  VALUE SPACES.
000520 PROCEDURE DIVISION.
000540 BEGIN. READY TRACE.
000550     NOTE THAT THE FOLLOWING OPENS THE OUTPUT FILE TO BE CREATED
000560     AND INITIALIZES COUNTERS.
000570 STEP-1. OPEN OUTPUT FILE-1. MOVE ZERO TO COUNT, NUMBER.
000580     NOTE THAT THE FOLLOWING CREATES INTERNALLY THE RECORDS TO BE
000590     CONTAINED IN THE FILE, WRITES THEM ON TAPE, AND DISPLAYS THEM
000600     ON THE CONSOLE.
000610 STEP-2. ADD 1 TO COUNT, ADD 1 TO NUMBER. MOVE ALPHA (COUNT) TO
000620         NAME-FIELD.
000630         MOVE DEPEND (COUNT) TO NO-OF-DEPENDENTS.
000640         MOVE NUMBER TO RECORD-NO.
000650 STEP-3. DISPLAY WORK-RECORD UPON CONSOLE. WRITE RECORD-1 FROM
000660         WORK-RECORD.
000670 STEP-4. PERFORM STEP-2 THRU STEP-3 UNTIL COUNT IS EQUAL TO 26.
000680     NOTE THAT THE FOLLOWING CLOSES OUTPUT AND REOPENS IT AS
000690     INPUT.
000700 STEP-5. CLOSE FILE-1. OPEN INPUT FILE-2.
000710     NOTE THAT THE FOLLOWING READS BACK THE FILE AND SINGLES OUT
000720     EMPLOYEES WITH NO DEPENDENTS.
000730 STEP-6. READ FILE-2 RECORD INTO WORK-RECORD AT END GO TO STEP-8.
000740 STEP-7. IF NO-OF-DEPENDENTS IS EQUAL TO '0' MOVE 'Z' TO
000750         NO-OF-DEPENDENTS. EXHIBIT NAMED WORK-RECORD. GO TO
000760         STEP-6.
000770 STEP-8. CLOSE FILE-2.
000790         STOP RUN.
/*                                                                        008280
//GO.SAMPLE DD UNIT=2400,LABEL=(,NL)
//GO.SYSOUT DD SYSOUT=A
//TESTSORT     JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       008310
//STEP01       EXEC PGM=IEBGENER                                          008320
//SYSPRINT     DD   SYSOUT=A                                              008330
//SYSIN        DD   DUMMY                                                 008340
//SYSUT2       DD   DSN=TESTDATA,DISP=(,PASS),UNIT=2400,                  008350
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                         008360
//SYSUT1       DD   *,DCB=BLKSIZE=80                                      008370
*****000001**************************** AQA007CCD***********************
*****000002****************************DUEG00HIJ0***********************
*****000003****************************LMOP00Q7SU***********************
*****000004****************************FXYZ0025Q7***********************
*****000005****************************9K3E00XACU***********************
*****000006****************************GKOQ00TY2P***********************
*****000007****************************7O9O00BHNQ***********************
*****000008****************************T05T00AWBE***********************
*****000009****************************I2PW00K37R***********************
*****000010****************************AEYM00VJ48***********************
*****000011****************************SAFJ004T2Q***********************
*****000012****************************E3CM00RW6F***********************
*****000013****************************6 UK00VK6A***********************
*****000014****************************2BNT00YJCI***********************
*****000015****************************4U6W00QGSI***********************
*****000016****************************5C6G00U17W***********************
*****000017****************************LSZP00ELT7***********************
*****000018****************************J GO003EEL***********************
*****000019****************************91C800DL91***********************
*****000020****************************D9DM003FGP***********************
*****000021****************************6JDM00UPKT***********************
*****000022****************************2YBT002 8L***********************
*****000023****************************E4KD00XRYS***********************
*****000024****************************6EO800LKV5***********************
*****000025****************************4IC300NI2X***********************
*****000026****************************I93I00JU56***********************
*****000027****************************LG8T00P7IT***********************
*****000028****************************XDZN00J73E***********************
*****000029****************************QVB000OK6J***********************
*****000030****************************W1IF007XUC***********************
*****000031****************************IV8 00XUMU***********************
*****000032****************************B 2U00S JX***********************
*****000033****************************CA2000GU3M***********************
*****000034****************************LF9800Q1XW***********************
*****000035****************************EQ5N00MHWE***********************
*****000036****************************D77A00Q421***********************
*****000037****************************L0YX00IXWW***********************
*****000038****************************HXXX00IYZZ***********************
*****000039****************************L14500 Q7C***********************
*****000040****************************DGXJ00KP7T***********************
*****000041****************************UF05006RDF***********************
*****000042****************************K5SU00I08H***********************
*****000043****************************ZNQB00Z 7X***********************
*****000044****************************JMBU0058FY***********************
*****000045****************************ORF400F5SV***********************
*****000046****************************M6DH00W7ZN***********************
*****000047****************************RI2A00EV81***********************
*****000048****************************QUN700FK 3***********************
*****000049****************************G05E00ZUYN***********************
*****000050****************************CHCX00CYD9***********************
*****000051****************************Z5F100W2RI***********************
*****000052****************************OK6G00MB R***********************
*****000053****************************YF5N00964V***********************
*****000054****************************2D0Y005WOV***********************
*****000055****************************TRZQ00HPOO***********************
*****000056****************************VMEM00L9LT***********************
*****000057****************************KCKL009LTK***********************
*****000058****************************DMMM00VNFO***********************
*****000059****************************PQYR00KTUV***********************
*****000060****************************4XQZ00C135***********************
*****000061****************************Z8L800WJ9W***********************
*****000062****************************AKDI00MQ0U***********************
*****000063****************************OYD30077WK***********************
*****000064****************************  F500KVQL***********************
*****000065****************************WB290090QH***********************
*****000066****************************CKRX00950S***********************
*****000067****************************KAFM00U73Z***********************
*****000068****************************RKD 00HQ09***********************
*****000069****************************6ZTA00NKGT***********************
*****000070****************************A3G900Q42Z***********************
*****000071****************************TPKH00FTB4***********************
*****000072****************************CO0700 3LZ***********************
*****000073****************************YXTQ00NMKZ***********************
*****000074****************************IGEC00BR 4***********************
*****000075****************************JXDS007AP5***********************
*****000076****************************P5 Q006CTG***********************
*****000077****************************YN5A00DEFW***********************
*****000078****************************HKMO00P6RV***********************
*****000079****************************GY01005A8U***********************
*****000080****************************QM 700CHKN***********************
*****000081****************************5RWJ00246J***********************
*****000082****************************5K6D00JNQ9***********************
*****000083****************************V2P900U CG***********************
*****000084****************************0OWJ0027QB***********************
*****000085****************************FZNW00L59V***********************
*****000086****************************CHM700W4TH***********************
*****000087****************************7GQV000KAF***********************
*****000088****************************0Q0Q00H8IU***********************
*****000089****************************Z5SD00KQ3D***********************
*****000090****************************5CZP002TOE***********************
*****000091****************************SI5E008JAX***********************
*****000092****************************42CR00Y6WN***********************
*****000093****************************V3TL00T0TL***********************
*****000094****************************T1UM00V4W ***********************
*****000095****************************RZ8200FW6B***********************
*****000096****************************9MF400JDWP***********************
*****000097****************************VO7000I70E***********************
*****000098****************************CLVU00R2AP***********************
*****000099****************************JSN8003DN9***********************
*****000100****************************NNYP00KXS ***********************
*****000101****************************LWYE00A1OK***********************
*****000102****************************73FR00UAZN***********************
*****000103****************************J84H00TZFC***********************
*****000104****************************4URF00R4TP***********************
*****000105****************************H7OW009PMC***********************
*****000106****************************Q4US00LWEC***********************
*****000107****************************50YG00S6NL***********************
*****000108****************************FU9B00A32K***********************
*****000109****************************ZVUD00S5ON***********************
*****000110****************************M1KJ00IXHH***********************
*****000111****************************GXHH00HYII***********************
*****000112****************************J1MM00O6QR***********************
*****000113****************************DUYZ00M379***********************
*****000114****************************EVJK00Q8VW***********************
*****000115****************************I4BY00KMAS***********************
*****000116****************************14AS00HJT1***********************
*****000117****************************4REH00P24B***********************
*****000118****************************UKOB001C2P***********************
*****000119****************************TL4C00GV7Y***********************
*****000120****************************MQJ300CFWA***********************
*****000121****************************3RWP00JNC6***********************
*****000122****************************L49J003Y3S***********************
*****000123****************************HMH300CI4J***********************
*****000124****************************6M84000QWS***********************
*****000125****************************OUKB00IE0B***********************
*****000126****************************I7OY00F7P9***********************
*****000127****************************18J70054W4***********************
*****000128****************************F22100T1D1***********************
*****000129****************************091T001C11***********************
*****000130****************************91U300F345***********************
*****000131****************************Y6I70083PA***********************
*****000132****************************WI6T00G DG***********************
*****000133****************************5JTM00GQUY***********************
*****000134****************************82W600J2QG***********************
*****000135****************************AEKQ000VQ0***********************
*****000136****************************F64U00 KFA***********************
*****000137****************************LS07002TLB***********************
*****000138****************************FNV7002YRJ***********************
*****000139****************************CGPY0073XQ***********************
*****000140****************************JGDQ00Z9B4***********************
*****000141****************************LZXU007OJE***********************
*****000142****************************B NX009G9S***********************
*****000143****************************642X00VCQP***********************
*****000144****************************N1KH00DCAP***********************
*****000145****************************2ES600LZFT***********************
*****000146****************************988700A6Q6***********************
*****000147****************************665 004O55***********************
*****000148****************************54 500P556***********************
*****000149****************************7B8S00999F***********************
*****000150****************************XL3B00UL4 ***********************
*****000151****************************BDFX00ILPQ***********************
*****000152****************************SWZM00468I***********************
*****000153****************************2F0B00DGZM***********************
*****000154****************************REXZ0018E0***********************
*****000155****************************G2 G00JN6T***********************
*****000156****************************0N7T00BFZN***********************
*****000157****************************VJ3600RCG0***********************
*****000158****************************PXM600XFKP***********************
*****000159****************************Y9XL00BLAV***********************
*****000160****************************05PA00FL7W***********************
*****000161****************************7XOE00PG28***********************
*****000162****************************0AMT00ZM G***********************
*****000163****************************M90A003CZQ***********************
*****000164****************************3URH00WNKB***********************
*****000165****************************QI5F00ME2D***********************
*****000166****************************9KC1009D9M***********************
*****000167****************************D1EO00G4IB***********************
*****000168****************************SK9O00HYRW***********************
*****000169****************************O70F005YBH***********************
*****000170****************************QNLV0052FA***********************
*****000171****************************0HCW00Q ZT***********************
*****000172****************************9ITS00S3DU***********************
*****000173****************************O 0W00BCNY***********************
*****000174****************************1GB200QL84***********************
*****000175****************************FRVB00ZNJ7***********************
*****000176****************************3GSX00DA3S***********************
*****000177****************************PCO0007OLC***********************
*****000178****************************52JR004IG7***********************
*****000179****************************5JX600NLF8***********************
*****000180****************************6OYR00QJXD***********************
*****000181****************************B42K00ZSR ***********************
*****000182****************************O0JI00F9SB***********************
*****000183****************************A6 4003N1Z***********************
*****000184****************************ZJYX00XHXX***********************
*****000185****************************XHXY00YJ02***********************
*****000186****************************2N5B0078TE***********************
*****000187****************************FI1M00NASX***********************
*****000188****************************YM3A009HZM***********************
*****000189****************************OAW1004QCF***********************
*****000190****************************L8UX00M5BD***********************
*****000191****************************O7WZ00M CL***********************
*****000192****************************X1RI00LZA0***********************
*****000193****************************OSJ300BFV7***********************
*****000194****************************ZNRJ004DHY***********************
*****000195****************************B6UY00SMRG***********************
*****000196**************************** O9N00938Y***********************
*****000197****************************NSO900IOE ***********************
*****000198****************************RUA800Y5F1***********************
*****000199****************************X4UK00ROLS***********************
*****000200****************************I GD000BIR***********************
*****000201****************************A2KX00GUD9***********************
*****000202****************************TD9U00EXH2***********************
*****000203****************************M 9U00HACE***********************
*****000204****************************4HRK00DMQS***********************
*****000205****************************2WQZ00D363***********************
*****000206****************************SG9X00CMGA***********************
*****000207****************************LQV6001V6K***********************
*****000208****************************A7XC00NJEO***********************
*****000209****************************W29400VMDG***********************
*****000210****************************NW7200ZRIB***********************
*****000211****************************FNW90052UO***********************
*****000212****************************GD M00W560***********************
*****000213****************************IURP002JDG***********************
*****000214****************************R37 003KYW***********************
*****000215****************************T8QM00IGET***********************
*****000216****************************B5FS005HV9***********************
*****000217****************************885400M10Z***********************
*****000218****************************YWGV00UUTS***********************
*****000219****************************CRRR006PP ***********************
*****000220****************************PPP400PPPP***********************
*****000221****************************P6QQ00BRRR***********************
*****000222****************************8TTE00VWWX***********************
*****000223****************************ZK010034 7***********************
*****000224****************************R89I001ATN***********************
*****000225**************************** 7CG00IJ2O***********************
*****000226****************************SDWY0005B9***********************
*****000227****************************W TB00TGMR***********************
*****000228****************************UX3A009XDZ***********************
*****000229****************************EHK300RYL5***********************
*****000230****************************9SAF00ZNVJ***********************
*****000231****************************37SD00H2Q0***********************
*****000232****************************O9B000 JOS***********************
*****000233****************************2C1Q00FQE0***********************
*****000234****************************5VGM00S3D4***********************
*****000235**************************** WMY00NG9J***********************
*****000236****************************AW2900WJQW***********************
*****000237****************************LAGN002C6 ***********************
*****000238****************************G3U9000AYP***********************
*****000239****************************4WUL001TSL***********************
*****000240****************************1SUM002VWO***********************
*****000241****************************6YB100T3 I***********************
*****000242****************************71D 00IR9N***********************
*****000243****************************IR1X00BU4B***********************
*****000244****************************OI8Q00K4XG***********************
*****000245****************************61EE00OZYD***********************
*****000246****************************X8ID00YTD4***********************
*****000247****************************ZFFQ0013IE***********************
*****000248****************************5RM600HTWC***********************
*****000249****************************ZNJ7003FRW***********************
*****000250****************************C1QN008 MY***********************
*****000251****************************4LH200YFN0***********************
*****000252****************************EB2Z00ERZH***********************
*****000253****************************F81Y00GQ4K***********************
*****000254****************************I8AO002VTA***********************
*****000255****************************P0JH00D87P***********************
*****000256****************************2YXG00T8RR***********************
*****000257**************************** O3L00LJYI***********************
*****000258****************************IHXG00HHXH***********************
*****000259****************************IJZK00KN3P***********************
*****000260****************************QATV00WH04***********************
*****000261****************************6QCD00H2NO***********************
*****000262****************************BT0200 Q8E***********************
*****000263****************************GO6U00WI5E***********************
*****000264****************************2ORH00ZJ2T***********************
*****000265****************************VI 800I8VY***********************
*****000266****************************O8GJ00X 80***********************
*****000267****************************ORJ300BFV7***********************
*****000268****************************0PSL006EI0***********************
*****000269****************************D8W200BWPU***********************
*****000270****************************KDST0084TY***********************
*****000271****************************TPVK00AGCY***********************
*****000272****************************E2I700N74U***********************
*****000273****************************1CZV002TKQ***********************
*****000274****************************OMUK00BIH4***********************
*****000275****************************FMDC00BY H***********************
*****000276**************************** UE900TD9T***********************
*****000277****************************DVH 00AC0C***********************
*****000278****************************LEFH006JTL***********************
*****000279****************************ENQS001UNX***********************
*****000280****************************A02600Z8M ***********************
*****000281****************************0OCA00E4IS***********************
*****000282****************************NHRW00160Q***********************
*****000283****************************FB1G00RNHS***********************
*****000284****************************Y56Y00OFAI***********************
*****000285****************************PW84000RJB***********************
*****000286****************************FNW80040TM***********************
*****000287****************************EBKT00392W***********************
*****000288****************************EQNK00YF8 ***********************
*****000289****************************ALW80050VD***********************
*****000290****************************ROM000IEAK***********************
*****000291****************************W8IV008631***********************
*****000292****************************KZXW00USAP***********************
*****000293****************************OO3L00KIIH***********************
*****000294****************************WFED00CCSB***********************
*****000295****************************7AA 00 P 5***********************
*****000296****************************    00P 6 ***********************
*****000297**************************** AAQ00B7BD***********************
*****000298****************************DDUE00FIIJ***********************
*****000299****************************0LNO00PR8S***********************
*****000300****************************VGXZ00025R***********************
*****000301****************************89K300EYAB***********************
*****000302****************************UGKO00RTY3***********************
*****000303****************************P7OP00BHNQ***********************
*****000304****************************T06S00AXBF***********************
*****000305****************************I1PW00K38R***********************
*****000306****************************AFZM00VK48***********************
*****000307****************************TBFJ004T2Q***********************
*****000308****************************D4CM00SW6F***********************
*****000309****************************6AVK00VL6B***********************
*****000310****************************2BNS00YKCH***********************
*****000311****************************4U6W00QGTJ***********************
*****000312****************************5D6H00U28W***********************
*****000313****************************MSZO00ELS8***********************
*****000314****************************J GO004FEL***********************
*****000315****************************1D8D00L91D***********************
*****000316****************************9EM300FHQ7***********************
*****000317****************************JDNV00PLT2***********************
*****000318****************************XAT200 8LF***********************
*****000319****************************4LFY00SYS5***********************
*****000320****************************EN8M00LV65***********************
*****000321****************************JD3O00I3XI***********************
*****000322****************************84IJ00V56M***********************
*****000323****************************H8UP008JUX***********************
*****000324****************************C0NJ0073ER***********************
*****000325****************************VB0O00K96J***********************
*****000326****************************V1IF008YVB***********************
*****000327****************************IV8 00XULU***********************
*****000328****************************C 2V00TAJX***********************
*****000329****************************CA2Z00GT4N***********************
*****000330****************************KF8Q00 1XW***********************
*****000331****************************FQ5N00MHWF***********************
*****000332****************************E87A00P521***********************
*****000333****************************L0ZY00IYXW***********************
*****000334****************************HXXX00IZ00***********************
*****000335****************************L24400 Q7C***********************
*****000336****************************DGXK00LP6T***********************
*****000337****************************VG05006SEF***********************
*****000338****************************K6ST00IZ9H***********************
*****000339****************************ZOQC0007WJ***********************
*****000340****************************MBU6009FYO***********************
*****000341****************************SF4E005SWM***********************
*****000342****************************6EHW007ZNR***********************
*****000343****************************I3BF00W81P***********************
*****000344****************************UN8G00L 3H***********************
*****000345****************************05E000TYOD***********************
*****000346****************************IDYC00YD05***********************
*****000347****************************F1X200SINK***********************
*****000348****************************5GMC00 RYE***********************
*****000349****************************5N97004V2E***********************
*****000350****************************0Y5W00OVUS***********************
*****000351****************************ZQIP00PNVN***********************
*****000352****************************FMMM00TLDK***********************
*****000353****************************L9LT00LELM***********************
*****000354****************************NVNG00OPQZ***********************
*****000355****************************RKTU00W4XQ***********************
*****000356****************************ZD13005Z8L***********************
*****000357****************************9WJ900XBKE***********************
*****000358****************************HMQ000UPZD***********************
*****000359****************************386W00K AG***********************
*****000360****************************6KVQ00LWB3***********************
*****000361****************************80RI00DJQY***********************
*****000362****************************51SJ00BFMV***********************
*****000363****************************73ZR00KD I***********************
*****000364****************************R16Z00TANK***********************
*****000365****************************HUA300GR41***********************
*****000366****************************ZUPK00IGTB***********************
*****000367****************************5BO0007 3L***********************
*****000368****************************ZYWU00R OM***********************
*****000369****************************L0IG00EDCQ***********************
*****000370**************************** 4JX00ES7A***********************
*****000371****************************Q5P500AQ7C***********************
*****000372****************************THYN005ADE***********************
*****000373****************************FWHJ00MOP7***********************
*****000374****************************SVGY00Z15B***********************
*****000375****************************9VQN00 7DI***********************
*****000376****************************KM5R00XJ25***********************
*****000377****************************7J5L006DJM***********************
*****000378****************************P9X300Q9V ***********************
*****000379****************************DH1O00VJ47***********************
*****000380****************************QBFZ00NXL5***********************
*****000381****************************VDHM007W5U***********************
*****000382****************************H8HR00W1KA***********************
*****000383****************************F1Q100QH9J***********************
*****000384**************************** U0600SEKQ***********************
*****000385****************************3C5D00ZP3U***********************
*****000386****************************OESJ006E9J***********************
*****000387****************************AX4200DSZ6***********************
*****000388****************************WNV200ULT1***********************
*****000389****************************TLT200UNV3***********************
*****000390****************************XAR00082FX***********************
*****000391****************************5BMF004KDW***********************
*****000392****************************PVO7001H71***********************
*****000393****************************FCMW00US2B***********************
*****000394****************************PJTN0093CN***********************
*****000395****************************9NNY009QLX***********************
*****000396****************************S LW00ZE 1***********************
*****000397****************************OK7300FQVB***********************
*****000398****************************ZNJ9005HUZ***********************
*****000399****************************GC4V00RFS5***********************
*****000400****************************SPH700PWPM***********************
*****000401****************************CQ3V00SMWE***********************
*****000402****************************C61Z00HS7N***********************
*****000403****************************LGU900CB42***********************
*****000404****************************LZVV00DR6P***********************
*****000405****************************OM1K00KIYI***********************
*****000406****************************HHXG00HHYI***********************
*****000407****************************IK1L00MO7R***********************
*****000408****************************REUY000M2A***********************
*****000409****************************89EW00IKR8***********************
*****000410****************************VXJ400C9YK***********************
*****000411****************************MAS1004ATI***********************
*****000412****************************KT2400REHQ***********************
*****000413****************************14BU00LOC2***********************
*****000414****************************D2QT00K5CG***********************
*****000415****************************V7ZN00RK3B***********************
*****000416****************************GX 300SWQJ***********************
*****000417****************************OC6K005J4Y***********************
*****000418****************************3SIN00H3CI***********************
*****000419****************************5J7M00830Q***********************
*****000420****************************WSOU00LCIE***********************
*****000421****************************1BI700PYF7***********************
*****000422****************************P90800J765***********************
*****000423****************************W4F30031T1***********************
*****000424****************************D119001S1D***********************
*****000425****************************122U003F45***********************
*****000426****************************5X6I00793P***********************
*****000427****************************AWJ600TGAD***********************
*****000428****************************G6JT00NHQU***********************
*****000429****************************X82W006K2R***********************
*****000430****************************GAFL00P0VQ***********************
*****000431****************************1F6400U LG***********************
*****000432****************************BMTZ0062TK***********************
*****000433****************************CGNV0073ZR***********************
*****000434****************************JCGP00Y74X***********************
*****000435****************************QKHD00P0B5***********************
*****000436****************************MZWT007PJE***********************
*****000437****************************C NY00GR64***********************
*****000438****************************2YUC00QPO2***********************
*****000439****************************KGEC00BP3F***********************
*****000440****************************S6KZ00FU99***********************
*****000441****************************87B700R655***********************
*****000442****************************5 5P005546***********************
*****000443**************************** 5P500677B***********************
*****000444****************************8S9G00XL3B***********************
*****000445****************************TL4 00DEFX***********************
*****000446****************************IMPQ00SW0L***********************
*****000447****************************468I002G0B***********************
*****000448****************************EH0M00SEX0***********************
*****000449****************************28F100G3AG***********************
*****000450****************************JM6T000N7T***********************
*****000451**************************** CG000NVJ3***********************
*****000452****************************7RCG000PYM***********************
*****000453****************************7XFK00PZ8X***********************
*****000454****************************MBKA00W16Q***********************
*****000455****************************AGL600W8YO***********************
*****000456****************************EQF20080AN***********************
*****000457****************************TZM 00GN90***********************
*****000458****************************A4CZ00Q4VR***********************
*****000459****************************IWNK00BQI5***********************
*****000460****************************FNE200D9LD***********************
*****000461****************************19D900LD1F***********************
*****000462****************************NG4I00BSLO***********************
*****000463****************************HZSW00P70G***********************
*****000464****************************5YCH00ROLU***********************
*****000465****************************43G 000ICW***********************
*****000466****************************Q 0T009ISS***********************
*****000467****************************S3DT00OA1W***********************
*****000468****************************BCOZ001GC4***********************
*****000469****************************QL9400GSVB***********************
*****000470****************************ZNJ8004GSY***********************
*****000471****************************EA3S00PCO1***********************
*****000472****************************8PMC0052KR***********************
*****000473****************************4JG7004JX6***********************
*****000474****************************OLE8006OYS***********************
*****000475****************************QJXD00C53K***********************
*****000476****************************YTR 00O0JI***********************
*****000477****************************F9SC00B643***********************
*****000478****************************M10Z00JYXX***********************
*****000479****************************HXXX00HYZZ***********************
*****000480****************************J02200N5B8***********************
*****000481****************************8TEF00I1NO***********************
*****000482****************************ARXY00L3 A***********************
*****000483****************************HZMO00AW24***********************
*****000484****************************RCEL009VXM***********************
*****000485****************************5BEP007X0N***********************
*****000486****************************ADLY001RIL***********************
*****000487**************************** ZA9001PTK***********************
*****000488****************************4CFV007ZOS***********************
*****000489****************************K5DH00ZC5U***********************
*****000490****************************ZSMR00F P9***********************
*****000491****************************N93900YNSO***********************
*****000492****************************9JOE00 QUA***********************
*****000493****************************9Y5F001X4V***********************
*****000494****************************LSOL00SJ G***********************
*****000495****************************E0BI00 SA3***********************
*****000496****************************LXHU00D9TD***********************
*****000497****************************9UEX00I2N ***********************
*****000498****************************9VHA00CF4H***********************
*****000499****************************RKDN00QT3W***********************
*****000500****************************PZD30064SG***********************
/*                                                                        013380
//STEP02       EXEC SORTD                                                 013390
//SORTIN       DD   DSN=TESTDATA,DISP=(OLD,PASS),                         013400
//             DCB=(,RECFM=F,LRECL=80,BLKSIZE=80)
//SORTOUT      DD   SYSOUT=A,DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)           013420
//SORTWK01 DD  UNIT=2400,LABEL=(,NL)
//SORTWK02 DD  UNIT=2400,LABEL=(,NL)
//SORTWK03 DD  UNIT=2400,LABEL=(,NL)
//SYSIN  DD    *
 SORT FIELDS=(40,10,CH,A)
 RECORD TYPE=F,LENGTH=(80)
 END
/*                                                                        013500
//STEP03       EXEC SORTD                                                 013510
//SORTIN       DD   DSN=TESTDATA,DISP=(OLD,DELETE),                       013520
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                         013530
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                      013540
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                      013550
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                      013560
//SORTOUT      DD   SYSOUT=A,DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)           013570
//SYSIN  DD    *
 SORT FIELDS=(40,10,CH,A)
 RECORD TYPE=F,LENGTH=(80)
 END
/*                                                                        013620
//TSTALGOL     JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       013630
//STEP   EXEC  ALGOFCLG,PARM.ALGOL=(ISO),PARM.GO=(DUMP)                   013640
//SYSIN  DD  *                                                            013650
@BEGIN@ @COMMENT@ TEST PROGRAM Q09                                        013660
THIS PROGRAM GENERATES AND PRINTS THE FIRST TWENTY LINES OF PASCALS       013670
TRIANGLE.THE K TH ELEMENT P%K,J< OF THE J TH LINE SHOULD BE EQUAL TO      013680
THE SUM OF P%K-1,J-1< AND P%K,J-1< FOR K NOTEQUAL 0 AND K NOTEQUAL J.     013690
P%0,J<#P%J,J<#1. THUS BY ADDING TWO BY TWO ALL ELEMENTS IN ONE LINE       013700
PLACING EACH SUM BELOW AND BETWEEN THE TWO ELEMENTS THE NEXT LINE OF      013710
PASCALS TRIANGLE COULD BE EXPANDED .,                                     013720
@INTEGER@ L,K,N,I,M,POWERTEN.,                                            013730
@INTEGER@@ARRAY@ A%/0..19/<.,                                             013740
@BOOLEAN@ C.,                                                             013750
SYSACT%1,6,120<., SYSACT%1,8,62<.,                                        013760
SYSACT%1,12,1<., SYSACT%1,2,56<.,                                         013770
OUTSTRING %1,@%@PASCALS TRIANGLE@<@<.,                                    013780
@FOR@L.#0@STEP@1@UNTIL@19@DO@                                             013790
    @BEGIN@                                                               013800
    SYSACT%1,14,3<.,                                                      013810
    @IF@ L @LESS@ 19 @THEN@                                               013820
                         SYSACT%1,2,58-3*L<.,                             013830
    A%/L/<.#1.,                                                           013840
    @FOR@K.#L-1@STEP@-1@UNTIL@1@DO@                                       013850
    A%/K/<.#A%/K-1/<&A%/K/<.,                                             013860
    @FOR@K.#0@STEP@1@UNTIL@L@DO@                                          013870
         @BEGIN@                                                          013880
         C.#@TRUE@.,                                                      013890
         M.#A%/K/<.,                                                      013900
         @FOR@I.#5@STEP@-1@UNTIL@0@DO@                                    013910
              @BEGIN@                                                     013920
              POWERTEN.#10@POWER@I.,                                      013930
              N.#M@/@POWERTEN.,                                           013940
              M.#M-N*POWERTEN.,                                           013950
              @IF@N@EQUAL@0@THEN@                                         013960
                   @BEGIN@                                                013970
                   @IF@C@THEN@ OUTSYMBOL %1,@%@ @<@,1<                    013980
                   @ELSE@ OUTSYMBOL %1,@%@0@<@,1<.,                       013990
                   @END@                                                  014000
                   @ELSE@                                                 014010
                   @BEGIN@                                                014020
                   C.#@FALSE@.,                                           014030
                   OUTSYMBOL%1,@%@123456789@<@,N<.,                       014040
                   @END@                                                  014050
              @END@                                                       014060
         @END@                                                            014070
    @END@                                                                 014080
@END@                                                                     014090
/*                                                                        014100
//TSTFORTG     JOB  (5930,5,,,104),'AFTER SYSGEN',CLASS=T                 014110
//FTNGTEST EXEC  FORTGCLG,PARM.FORT='EBCDIC,LIST,MAP'
//FORT.SYSIN  DD  *
C   ********************************************************************
C   *                                                                  *
C   * THIS PROGRAM IS A TEST CASE DESIGNED TO VERIFY THAT THE FORTRAN  *
C   * IV (G) COMPILER HAS BEEN PROPERLY INSTALLED IN YOUR SYSTEM. THE  *
C   * REQUIRED JOB CONTROL LANGUAGE STATEMENTS AND THE DATA CARD       *
C   * ARE INCLUDED AS PART OF THE DECK.                                *
C   *                                                                  *
C   * THE PROGRAM GENERATES A TABLE OF BINOMIAL COEFFICIENTS WHICH IS  *
C   * THEN PRINTED ON THE SYSOUT DEVICE.  ALL DATA EXCEPT THE FIRST    *
C   * LINE OF OUTPUT IS PROGRAM GENERATED.                             *
C   *                                                                  *
C *                                                                    *
C *   THE OUTPUT SHOULD BE ---                                         *
C *                                                                    *
C *      I---------------------------------------------------------I   *
C *      I                           K                             I   *
C * I----I---------------------------------------------------------I   *
C * I  N I 1    2    3    4     5     6     7      8      9     10 I   *
C * I----I---------------------------------------------------------I   *
C * I  1 I  1    0    0    0     0     0     0      0      0     0 I   *
C * I  2 I  2    1    0    0     0     0     0      0      0     0 I   *
C * I  3 I  3    3    1    0     0     0     0      0      0     0 I   *
C * I  4 I  4    6    4    1     0     0     0      0      0     0 I   *
C * I  5 I  5   10   10    5     1     0     0      0      0     0 I   *
C * I  6 I  6   15   20   15     6     1     0      0      0     0 I   *
C * I  7 I  7   21   35   35    21     7     1      0      0     0 I   *
C * I  8 I  8   28   56   70    56    28     8      1      0     0 I   *
C * I  9 I  9   36   84  126   126    84    36      9      1     0 I   *
C * I 10 I 10   45  120  210   252   210   120     45     10     1 I   *
C * I 11 I 11   55  165  330   462   462   330    165     55    11 I   *
C * I 12 I 12   66  220  495   792   924   792    495    220    66 I   *
C * I 13 I 13   78  286  715  1287  1716  1716   1287    715   286 I   *
C * I 14 I 14   91  364 1001  2002  3003  3432   3003   2002  1001 I   *
C * I 15 I 15  105  455 1365  3003  5005  6435   6435   5005  3003 I   *
C * I 16 I 16 120  560 1820  4368  8008 11440  12870  11440   8008 I   *
C * I 17 I 17 136  680 2380  6188 12376 19448  24310  24310  19448 I   *
C * I 18 I 18 153  816 3060  8568 18564 31824  43758  48620  43758 I   *
C * I 19 I 19 171  969 3876 11624 27132 50388  75582  92378  92378 I   *
C * I 20 I 20 190 1140 4845 15504 38760 77520 125970 167960 184756 I   *
C * I----I---------------------------------------------------------I   *
C *                                                                    *
C   ********************************************************************
      DIMENSION NBYK(20,10),HEAD(20)
      DO 10 K=1,10
      NBYK(1,K) = K
   10 CONTINUE
      READ (5,1) HEAD
      WRITE (6,2) HEAD
      WRITE (6,3) (NBYK(1,K),K=1,10)
      DO 30 N=1,20
      DO 20 K=1,10
      NBYK(N,K) = KBINCO(N,K)
   20 CONTINUE
      WRITE (6,4) N,(NBYK(N,K),K=1,10)
   30 CONTINUE
      WRITE (6,5)
      STOP
    1 FORMAT (20A4)
    2 FORMAT ('1   FORTRAN G SAMPLE TEST CASE'///////1X,20A4/////)
    3 FORMAT (T7,'I',57('-'),'I'/T7,'I',T35,'K',T65,'I'/T2,'I----I',
     X        57('-'),'I'/T2,'I  N I',I2,I4,2I5,3I6,3I7,'  I'/T2,
     X        'I----I',57('-'),'I')
    4 FORMAT (' I',I3,' I',I3,I4,2I5,3I6,3I7,' I')
    5 FORMAT (' I----I',57('-'),'I')
      END
C
C   ************************************************
C   * KBINCO COMPUTES THE BINOMIAL COEFFICIENT,    *
C   * C(N,K) = (N*(N-1)***(N-K+1))/(K*(K-1)***1),  *
C   * WHERE N AND K ARE THE INTEGER ARGUEMENTS TO  *
C   * THE FUNCTION.  INTERMEDIATE CALCULATIONS ARE *
C   * PERFORMED IN REAL ARITHMETIC.  IN THE CASE   *
C   * WHERE K .GT. N, A VALUE OF ZERO IS RETURNED. *
C   * THE VALUES OF N AND K ARE LEFT UNCHANGED.    *
C   * THE FUNCTION HAS BEEN CHECKED FOR ALL COM-   *
C   * BINATIONS OF N=1,2,...,20 AND K=1,2,...,10.  *
C   ************************************************
C
      FUNCTION KBINCO (N,K)
CHECK FOR TRIVIAL CASES
      IF (K .GT. N) GO TO 50
      IF (K .EQ. 0  .OR.  N .EQ. K) GO TO 60
      IF (K .EQ. 1  .OR.  N-K .EQ. 1) GO TO 70
CONVERT TO REAL FOR INT. CALCULATIONS
      P = N
      Q = K
CHECK FOR LOWER 'DENOMINATOR'
      IF (P-Q .LT. Q) Q = P-Q
COMPUTE DENOMINATOR
      MAX = Q
      BOT = 1.0
      DO 30 I=2,MAX
      BOT = I*BOT
   30 CONTINUE
COMPUTE NUMERATOR
      MAX = P
      MIN = P - Q + 1.0
      TOP = 1.0
      DO 40 I=MIN,MAX
      TOP = I*TOP
   40 CONTINUE
CALCULATE AND ROUND BIN. COEFF.
      KBINCO = TOP/BOT + 0.5
      RETURN
   50 KBINCO = 0
      RETURN
   60 KBINCO = 1
      RETURN
   70 KBINCO = N
      RETURN
      END
/*
//GO.FT03F001  DD   SYSOUT=A                                              015260
//GO.SYSIN DD *
          BINOMIAL COEFFICIENTS
/*
//TSTFORTH     JOB  (5930,5,,,208),'AFTER SYSGEN',CLASS=T                 015300
//FTNGTEST EXEC  FORTHCLG,PARM.FORT='EBCDIC,LIST,MAP'                     015310
//FORT.SYSIN  DD  *
C   ********************************************************************
C   *                                                                  *
C   * THIS PROGRAM IS A TEST CASE DESIGNED TO VERIFY THAT THE FORTRAN  *
C   * IV (G) COMPILER HAS BEEN PROPERLY INSTALLED IN YOUR SYSTEM. THE  *
C   * REQUIRED JOB CONTROL LANGUAGE STATEMENTS AND THE DATA CARD       *
C   * ARE INCLUDED AS PART OF THE DECK.                                *
C   *                                                                  *
C   * THE PROGRAM GENERATES A TABLE OF BINOMIAL COEFFICIENTS WHICH IS  *
C   * THEN PRINTED ON THE SYSOUT DEVICE.  ALL DATA EXCEPT THE FIRST    *
C   * LINE OF OUTPUT IS PROGRAM GENERATED.                             *
C   *                                                                  *
C *                                                                    *
C *   THE OUTPUT SHOULD BE ---                                         *
C *                                                                    *
C *      I---------------------------------------------------------I   *
C *      I                           K                             I   *
C * I----I---------------------------------------------------------I   *
C * I  N I 1    2    3    4     5     6     7      8      9     10 I   *
C * I----I---------------------------------------------------------I   *
C * I  1 I  1    0    0    0     0     0     0      0      0     0 I   *
C * I  2 I  2    1    0    0     0     0     0      0      0     0 I   *
C * I  3 I  3    3    1    0     0     0     0      0      0     0 I   *
C * I  4 I  4    6    4    1     0     0     0      0      0     0 I   *
C * I  5 I  5   10   10    5     1     0     0      0      0     0 I   *
C * I  6 I  6   15   20   15     6     1     0      0      0     0 I   *
C * I  7 I  7   21   35   35    21     7     1      0      0     0 I   *
C * I  8 I  8   28   56   70    56    28     8      1      0     0 I   *
C * I  9 I  9   36   84  126   126    84    36      9      1     0 I   *
C * I 10 I 10   45  120  210   252   210   120     45     10     1 I   *
C * I 11 I 11   55  165  330   462   462   330    165     55    11 I   *
C * I 12 I 12   66  220  495   792   924   792    495    220    66 I   *
C * I 13 I 13   78  286  715  1287  1716  1716   1287    715   286 I   *
C * I 14 I 14   91  364 1001  2002  3003  3432   3003   2002  1001 I   *
C * I 15 I 15  105  455 1365  3003  5005  6435   6435   5005  3003 I   *
C * I 16 I 16 120  560 1820  4368  8008 11440  12870  11440   8008 I   *
C * I 17 I 17 136  680 2380  6188 12376 19448  24310  24310  19448 I   *
C * I 18 I 18 153  816 3060  8568 18564 31824  43758  48620  43758 I   *
C * I 19 I 19 171  969 3876 11624 27132 50388  75582  92378  92378 I   *
C * I 20 I 20 190 1140 4845 15504 38760 77520 125970 167960 184756 I   *
C * I----I---------------------------------------------------------I   *
C *                                                                    *
C   ********************************************************************
      DIMENSION NBYK(20,10),HEAD(20)
      DO 10 K=1,10
      NBYK(1,K) = K
   10 CONTINUE
      READ (5,1) HEAD
      WRITE (6,2) HEAD
      WRITE (6,3) (NBYK(1,K),K=1,10)
      DO 30 N=1,20
      DO 20 K=1,10
      NBYK(N,K) = KBINCO(N,K)
   20 CONTINUE
      WRITE (6,4) N,(NBYK(N,K),K=1,10)
   30 CONTINUE
      WRITE (6,5)
      STOP
    1 FORMAT (20A4)
    2 FORMAT ('1   FORTRAN G SAMPLE TEST CASE'///////1X,20A4/////)
    3 FORMAT (T7,'I',57('-'),'I'/T7,'I',T35,'K',T65,'I'/T2,'I----I',
     X        57('-'),'I'/T2,'I  N I',I2,I4,2I5,3I6,3I7,'  I'/T2,
     X        'I----I',57('-'),'I')
    4 FORMAT (' I',I3,' I',I3,I4,2I5,3I6,3I7,' I')
    5 FORMAT (' I----I',57('-'),'I')
      END
C
C   ************************************************
C   * KBINCO COMPUTES THE BINOMIAL COEFFICIENT,    *
C   * C(N,K) = (N*(N-1)***(N-K+1))/(K*(K-1)***1),  *
C   * WHERE N AND K ARE THE INTEGER ARGUEMENTS TO  *
C   * THE FUNCTION.  INTERMEDIATE CALCULATIONS ARE *
C   * PERFORMED IN REAL ARITHMETIC.  IN THE CASE   *
C   * WHERE K .GT. N, A VALUE OF ZERO IS RETURNED. *
C   * THE VALUES OF N AND K ARE LEFT UNCHANGED.    *
C   * THE FUNCTION HAS BEEN CHECKED FOR ALL COM-   *
C   * BINATIONS OF N=1,2,...,20 AND K=1,2,...,10.  *
C   ************************************************
C
      FUNCTION KBINCO (N,K)
CHECK FOR TRIVIAL CASES
      IF (K .GT. N) GO TO 50
      IF (K .EQ. 0  .OR.  N .EQ. K) GO TO 60
      IF (K .EQ. 1  .OR.  N-K .EQ. 1) GO TO 70
CONVERT TO REAL FOR INT. CALCULATIONS
      P = N
      Q = K
CHECK FOR LOWER 'DENOMINATOR'
      IF (P-Q .LT. Q) Q = P-Q
COMPUTE DENOMINATOR
      MAX = Q
      BOT = 1.0
      DO 30 I=2,MAX
      BOT = I*BOT
   30 CONTINUE
COMPUTE NUMERATOR
      MAX = P
      MIN = P - Q + 1.0
      TOP = 1.0
      DO 40 I=MIN,MAX
      TOP = I*TOP
   40 CONTINUE
CALCULATE AND ROUND BIN. COEFF.
      KBINCO = TOP/BOT + 0.5
      RETURN
   50 KBINCO = 0
      RETURN
   60 KBINCO = 1
      RETURN
   70 KBINCO = N
      RETURN
      END
/*
//GO.FT03F001  DD   SYSOUT=A                                              016450
//GO.SYSIN DD *
          BINOMIAL COEFFICIENTS
/*
//TSTASMLR     JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       016490
//STEP01       EXEC ASMFCLG                                               016500
//ASM.SYSIN    DD   *                                                     016510
EXAM     TITLE 'SAMPLE PROGRAM'
         PRINT DATA
*
*        THIS IS THE MACRO DEFINITION
*
         MACRO
         MOVE  &TO,&FROM
.*
.*       DEFINE SETC SYMBOL
.*
         LCLC  &TYPE
.*
.*       CHECK NUMBER OF OPERANDS
.*
         AIF   (N'&SYSLIST NE 2).ERROR1
.*
.*       CHECK TYPE ATTRIBUTES OF OPERANDS
.*
         AIF   (T'&TO NE T'&FROM).ERROR2
         AIF   (T'&TO EQ 'C' OR T'&TO EQ 'G' OR T'&TO EQ 'K').TYPECGK
         AIF   (T'&TO EQ 'D' OR T'&TO EQ 'E' OR T'&TO EQ 'H').TYPEDEH
         AIF   (T'&TO EQ 'F').MOVE
         AGO   .ERROR3
.TYPEDEH ANOP
.*
.*       ASSIGN TYPE ATTRIBUTE TO SETC SYMBOL
.*
&TYPE    SETC  T'&TO
.MOVE    ANOP
*        NEXT TWO STATEMENTS GENERATED FOR MOVE MACRO
         L&TYPE   2,&FROM
         ST&TYPE  2,&TO
         MEXIT
.*
.*       CHECK LENGTH ATTRIBUTES OF OPERANDS
.*
.TYPECGK AIF   (L'&TO NE L'&FROM OR L'&TO GT 256).ERROR4
*        NEXT STATEMENT GENERATED FOR MOVE MACRO
         MVC   &TO,&FROM
         MEXIT
.*
.*       ERROR MESSAGES FOR INVALID MOVE MACRO INSTRUCTIONS
.*
.ERROR1  MNOTE 1,'IMPROPER NUMBER OF OPERANDS, NO STATEMENTS GENERATED'
         MEXIT
.ERROR2  MNOTE 1,'OPERAND TYPES DIFFERENT, NO STATEMENTS GENERATED'
         MEXIT
.ERROR3  MNOTE 1,'IMPROPER OPERAND TYPES, NO STATEMENTS GENERATED'
         MEXIT
.ERROR4  MNOTE 1,'IMPROPER OPERAND LENGTHS, NO STATEMENTS GENERATED'
         MEND
*
*        MAIN ROUTINE
*
SAMPLR   CSECT
BEGIN    SAVE  (14,12),,*
         BALR  R12,0         ESTABLISH ADDRESSABILITY OF PROGRAM
         USING *,R12         AND TELL THE ASSEMBLER WHAT BASE TO USE
         ST    13,SAVE13
         LM    R5,R7,=A(LISTAREA,16,LISTEND)  LOAD LIST AREA PARAMETERS
         USING LIST,R5      REGISTER 5 POINTS TO THE LIST
MORE     BAL   R14,SEARCH   FIND LIST ENTRY IN TABLE
         TM    SWITCH,NONE  CHECK TO SEE IF NAME WAS FOUND
         BO    NOTTHERE     BRANCH IF NOT
         USING TABLE,R1     REGISTER 1 NOW POINTS TO TABLE ENTRY
         MOVE  TSWITCH,LSWITCH          MOVE FUNCTIONS
         MOVE  TNUMBER,LNUMBER               FROM LIST ENTRY
         MOVE  TADDRESS,LADDRESS                  TO TABLE ENTRY
LISTLOOP BXLE  R5,R6,MORE   LOOP THROUGH THE LIST
         CLC   TESTTABL(240),TABLAREA
         BNE   NOTRIGHT
         CLC   TESTLIST(96),LISTAREA
         BNE   NOTRIGHT
         WTO   'ASSEMBLER SAMPLE PROGRAM SUCCESSFUL'
EXIT     L     R13,SAVE13
         RETURN (14,12),RC=0
*
NOTRIGHT WTO   'ASSEMBLER SAMPLE PROGRAM UNSUCCESSFUL'
         B     EXIT
NOTTHERE OI    LSWITCH,NONE TURN ON SWITCH IN LIST ENTRY
         B     LISTLOOP     GO BACK AND LOOP
SAVE13   DC    F'0'
SWITCH   DC    X'00'
NONE     EQU   X'80'
*
*        BINARY SEARCH ROUTINE
*
SEARCH   NI    SWITCH,255-NONE TURN OFF NOT FOUND SWITCH
         LM    R1,R3,=F'128,4,128' LOAD TABLE PARAMETERS
         LA    R1,TABLAREA-16(R1)  GET ADDRESS OF MIDDLE ENTRY
LOOP     SRL   R3,1                DIVIDE INCREMENT BY 2
         CLC   LNAME,TNAME         COMPARE LIST ENTRY WITH TABLE ENTRY
         BH    HIGHER              BRANCH IF SHOULD BE HIGHER IN TABLE
         BCR   8,R14               EXIT IF FOUND
         SR    R1,R3               OTHERWISE IT IS LOWER IN THE TABLE  X
                                     SO SUBTRACT INCREMENT
         BCT   R2,LOOP             LOOP 4 TIMES
         B     NOTFOUND            ARGUMENT IS NOT IN THE TABLE
HIGHER   AR    R1,R3               ADD INCREMENT
         BCT   R2,LOOP             LOOP 4 TIMES
NOTFOUND OI    SWITCH,NONE         TURN ON NOT FOUND SWITCH
         BR    R14                 EXIT
*
*        THIS IS THE TABLE
*
         DS    0D
TABLAREA DC    XL8'0',CL8'ALPHA'
         DC    XL8'0',CL8'BETA'
         DC    XL8'0',CL8'DELTA'
         DC    XL8'0',CL8'EPSILON'
         DC    XL8'0',CL8'ETA'
         DC    XL8'0',CL8'GAMMA'
         DC    XL8'0',CL8'IOTA'
         DC    XL8'0',CL8'KAPPA'
         DC    XL8'0',CL8'LAMBDA'
         DC    XL8'0',CL8'MU'
         DC    XL8'0',CL8'NU'
         DC    XL8'0',CL8'OMICRON'
         DC    XL8'0',CL8'PHI'
         DC    XL8'0',CL8'SIGMA'
         DC    XL8'0',CL8'ZETA'
*
*        THIS IS THE LIST
*
LISTAREA DC    CL8'LAMBDA',X'0A',FL3'29',A(BEGIN)
         DC    CL8'ZETA',X'05',FL3'5',A(LOOP)
         DC    CL8'THETA',X'02',FL3'45',A(BEGIN)
         DC    CL8'TAU',X'00',FL3'0',A(1)
         DC    CL8'LIST',X'1F',FL3'465',A(0)
LISTEND  DC    CL8'ALPHA',X'00',FL3'1',A(123)
*
*        THIS IS THE CONTROL TABLE
*
         DS    0D
TESTTABL DC    FL3'1',X'00',A(123),CL8'ALPHA'
         DC    XL8'0',CL8'BETA'
         DC    XL8'0',CL8'DELTA'
         DC    XL8'0',CL8'EPSILON'
         DC    XL8'0',CL8'ETA'
         DC    XL8'0',CL8'GAMMA'
         DC    XL8'0',CL8'IOTA'
         DC    XL8'0',CL8'KAPPA'
         DC    FL3'29',X'0A',A(BEGIN),CL8'LAMBDA'
         DC    XL8'0',CL8'MU'
         DC    XL8'0',CL8'NU'
         DC    XL8'0',CL8'OMICRON'
         DC    XL8'0',CL8'PHI'
         DC    XL8'0',CL8'SIGMA'
         DC    FL3'5',X'05',A(LOOP),CL8'ZETA'
*
*        THIS IS THE CONTROL LIST
*
TESTLIST DC    CL8'LAMBDA',X'0A',FL3'29',A(BEGIN)
         DC    CL8'ZETA',X'05',FL3'5',A(LOOP)
         DC    CL8'THETA',X'82',FL3'45',A(BEGIN)
         DC    CL8'TAU',X'80',FL3'0',A(1)
         DC    CL8'LIST',X'9F',FL3'465',A(0)
         DC    CL8'ALPHA',X'00',FL3'1',A(123)
*
*        THESE ARE THE SYMBOLIC REGISTERS
*
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R5       EQU   5
R6       EQU   6
R7       EQU   7
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
*
*        THIS IS THE FORMAT DEFINITION OF LIST ENTRYS
*
LIST     DSECT
LNAME    DS    CL8
LSWITCH  DS    C
LNUMBER  DS    FL3
LADDRESS DS    F
*
*        THIS IS THE FORMAT DEFINITION OF TABLE ENTRYS
*
TABLE    DSECT
TNUMBER  DS    FL3
TSWITCH  DS    C
TADDRESS DS    F
TNAME    DS    CL8
         END   BEGIN
/*                                                                        018410
//TSTIEBDG     JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       018420
//   EXEC   PGM=IEBDG
//SYSPRINT DD SYSOUT=A
//EMMA DD SYSOUT=A,DCB=(RECFM=FA,LRECL=121,BLKSIZE=121,EROPT=ACC)
//SYSIN DD *
 DSD OUTPUT=(EMMA)
 FD NAME=A,LENGTH=10,ACTION=TR,FORMAT=AL
 FD NAME=B,LENGTH=10,ACTION=RP,FORMAT=AN,CHARACTER=2
 FD NAME=C,LENGTH=11,ACTION=SR,FORMAT=AL
 FD NAME=D,LENGTH=10,ACTION=FX,FORMAT=CO,CHARACTER=@
 FD NAME=E,LENGTH=20,PICTURE=20,'        WAVE        ',ACTION=WV
 FD NAME=F,LENGTH=11,ACTION=TL,FORMAT=AL
 FD NAME=G,LENGTH=10,ACTION=SL,FORMAT=AL
 FD NAME=H,LENGTH=20,PICTURE=20,'        ROLL        ',ACTION=RO
 FD NAME=I,LENGTH=10,ACTION=FX,FORMAT=ZD
 FD NAME=Z,LENGTH=1,PICTURE=1,' ',ACTION=FX
 CREATE QUANTITY=45,NAME=(Z,A,B,C,D,E,F,G,H,I)                         X
               THIS SAMPLE PROGRAM ILLUSTRATES SEVERAL USES OF THE     X
               DATA GENERATOR.                                         X
                                                                       X
               1. THE SYSPRINT DD CARD IS REQUIRED AND DEFINES THE     X
                  DATA GENERATOR OUTPUT DATA SET FOR CONTROL CARDS AND X
                  MESSAGES.                                            X
                                                                       X
               2. THE OUTPUT DD CARD IS REQUIRED AND IT DEFINES ASA    X
                  CHARACTERS USED TO PREVENT CONFLICT WITH THE DATA    X
                  GENERATOR SYSPRINT DATA SET.                         X
                                                                       X
               3. THE SYSIN DD CARD DEFINES THE CONTROL DATA SET WHICH X
                  CONTAINS THE UTILITY CONTROL STATEMENTS.             X
                                                                       X
               4. THE DSD (DATA SET DEFINITION) CARD IS REQUIRED,      X
                  MARKS THE BEGINNING OF A SET OF UTILITY CONTROL      X
                  STATEMENTS AND SPECIFIES THE DD NAME DEFINING THE    X
                     OUTPUT DATA SET.                                  X
                                                                       X
               5. THE FD (FIELD DEFINITION) CARDS DEFINE THE CONTENTS  X
                  AND LENGTH OF EACH FIELD USED TO FORM THE OUTPUT     X
                  RECORD.                                              X
                                                                       X
                  A. NAME=A DEFINES A FIELD 10 BYTES LONG CONSISTING   X
                     OF ALPHABETIC CHARACTERS BEING TRUNCATED TO THE   X
                     RIGHT.                                            X
                  B. NAME=B DEFINES A FIELD 10 BYTES LONG CONSISTING   X
                     OF AN ALPHANUMERIC PATTERN, BEGINNING WITH THE    X
                     CHARACTER '2', ILLUSTRATING THE RIPPLE ACTION.    X
                  C. NAME=C DEFINES A FIELD 11 BYTES LONG, CONSISTING  X
                     OF ALPHABETIC CHARACTERS BEING SHIFTED TO THE     X
                     RIGHT.                                            X
                  D. NAME=D DEFINES A FIELD 10 BYTES LONG, CONSISTING  X
                     OF A COLLATING SEQUENCE BEGINNING WITH THE '@'.   X
                  E. NAME=E DEFINES A FIELD 20 BYTES LONG, CONSISTING  X
                     OF THE PICTURE '    WAVE    ' WHICH ILLUSTRATES   X
                     THE WAVE ACTION.                                  X
                  F. NAME=F DEFINES A FIELD THAT IS 11 BYTES LONG,     X
                     CONSISTING OF AN ALPHABETIC PATTERN BEING         X
                     TRUNCATED TO THE LEFT.                            X
                  G. NAME=G DEFINES A FIELD THAT IS 10 BYTES LONG,     X
                     CONSISTING OF ALPHABETIC CHARACTERS BEING SHIFTED X
                     TO THE LEFT.                                      X
                  H. NAME=H DEFINES A FIELD THAT IS 20 BYTES LONG,     X
                     CONSISTING OF THE PICTURE '    ROLL    ' WHICH    X
                                                                       X
                     IS 20 BYTES LONG AND ILLUSTRATES THE ROLL ACTION. X
                  I. NAME=I DEFINES A FIELD 20 BYTES LONG CONSISTING   X
                     OF ZONED DECIMAL DIGITS.                          X
                  J. NAME=Z PLACES A BLANK IN STARTLOC 1 OF THE OUTPUT X
                     RECORD TO PREVENT LINE SKIPPING AND SPACING.      X
                                                                       X
               6. THE CREATE CARD DEFINES THE CONTENTS OF AN OUTPUT    X
                  RECORD.                                              X
                                                                       X
               7. THE END STATEMENT IS REQUIRED AND MARKS THE END OF A X
                  SET OF UTILITY CONTROL STATEMENTS.
 END
/*
//TESTCOBU     JOB  (5930,5,,,104),'AFTER SYSGEN',CLASS=T                 019180
// EXEC COBUCLG,PARM.COB='QUOTE'
//COB.SYSPUNCH DD   DUMMY                                                 019200
//COB.SYSLIB   DD   UNIT=SYSDA,SPACE=(TRK,(0,0,1)),DISP=(,PASS)           019210
//COB.SYSIN DD *
100010 IDENTIFICATION DIVISION.
100020 PROGRAM-ID.  TESTRUN.
100030   AUTHOR. PROGRAMMER NAME.
100040   INSTALLATION. NEW YORK PROGRAMMING CENTER.
100050   DATE-WRITTEN. JULY 12, 1968.
100060   DATE-COMPILED.
100070   REMARKS. THIS PROGRAM HAS BEEN WRITTEN AS A SAMPLE PROGRAM FOR
100080     COBOL USERS. IT CREATES AN OUTPUT FILE AND READS IT BACK AS
100090     INPUT.
100100 ENVIRONMENT DIVISION.
100110 CONFIGURATION SECTION.
100120   SOURCE-COMPUTER. IBM-360-H50.
100130   OBJECT-COMPUTER. IBM-360-H50.
100140 INPUT-OUTPUT SECTION.
100150 FILE-CONTROL.
100160     SELECT FILE-1 ASSIGN TO UT-2400-S-SAMPLE.
100170     SELECT FILE-2 ASSIGN TO UT-2400-S-SAMPLE.
100180 DATA DIVISION.
100190 FILE SECTION.
100200 FD  FILE-1
100210     LABEL RECORDS ARE OMITTED
100220     BLOCK CONTAINS 100 CHARACTERS
100230     RECORDING MODE IS F
100240     DATA RECORD IS RECORD-1.
100250   01 RECORD-1.
100260     02 FIELD-A PICTURE IS X(20).
100270 FD  FILE-2
100280     LABEL RECORDS ARE OMITTED
100290     BLOCK CONTAINS 5 RECORDS
100300     RECORD CONTAINS 20 CHARACTERS
100310     RECORDING MODE IS F
100320     DATA RECORD IS RECORD-2.
100330   01 RECORD-2.
100340     02 FIELD-A PICTURE IS X(20).
100350 WORKING-STORAGE SECTION.
100360     77 COUNT PICTURE S99 COMP SYNC.
100370     77 NOMBER  PICTURE S99 COMP SYNC.
100375   01 FILLER.
 00380     02 ALPHABET PICTURE X(26) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
100395     02 ALPHA REDEFINES ALPHABET PICTURE X OCCURS 26 TIMES.
100405     02 DEPENDENTS PICTURE X(26)  VALUE "0123401234012340123401234
100410-    "0".
100420     02 DEPEND REDEFINES DEPENDENTS PICTURE X OCCURS 26 TIMES.
100440   01 WORK-RECORD.
100450     02 NAME-FIELD  PICTURE X.
100460     02 FILLER PICTURE X VALUE SPACE.
100470     02 RECORD-NO PICTURE 9999.
100480     02 FILLER PICTURE X VALUE SPACE.
100490     02 LOCATION PICTURE AAA VALUE "NYC".
100500     02 FILLER PICTURE X VALUE SPACE.
100510     02 NO-OF-DEPENDENTS PICTURE XX.
100520     02 FILLER PICTURE X(7) VALUE SPACES.
100530 PROCEDURE DIVISION.
100540 BEGIN. READY TRACE.
100550     NOTE THAT THE FOLLOWING OPENS THE OUTPUT FILE TO BE CREATED
100560     AND INITIALIZES COUNTERS.
100570 STEP-1. OPEN OUTPUT FILE-1. MOVE ZERO TO COUNT NOMBER.
100580     NOTE THAT THE FOLLOWING CREATES INTERNALLY THE RECORDS TO BE
100590     CONTAINED IN THE FILE, WRITES THEM ON TAPE, AND DISPLAYS
100600     THEM ON THE CONSOLE.
100610 STEP-2. ADD 1 TO COUNT, ADD 1 TO NOMBER, MOVE ALPHA (COUNT) TO
100620     NAME-FIELD.
100630     MOVE DEPEND (COUNT) TO NO-OF-DEPENDENTS.
100640     MOVE NOMBER TO RECORD-NO.
100650 STEP-3. DISPLAY WORK-RECORD UPON CONSOLE. WRITE RECORD-1 FROM
100660     WORK-RECORD.
100670 STEP-4. PERFORM STEP-2 THRU STEP-3 UNTIL COUNT IS EQUAL TO 26.
100680     NOTE THAT THE FOLLOWING CLOSES OUTPUT AND REOPENS IT AS
100690     INPUT.
100700 STEP-5. CLOSE FILE-1. OPEN INPUT FILE-2.
100710     NOTE THAT THE FOLLOWING READS BACK THE FILE AND SINGLES OUT
100720     EMPLOYEES WITH NO DEPENDENTS.
100730 STEP-6. READ FILE-2 RECORD INTO WORK-RECORD AT END GO TO STEP-8.
100740 STEP-7. IF NO-OF-DEPENDENTS IS EQUAL TO "0" MOVE "Z" TO
100750     NO-OF-DEPENDENTS. EXHIBIT NAMED WORK-RECORD. GO TO
100760     STEP-6.
100770 STEP-8. CLOSE FILE-2.
100780     STOP RUN.
/*
//GO.SAMPLE DD    UNIT=2400,LABEL=(,NL)
//GO.SYSOUT DD   SYSOUT=A
//TESTRPG      JOB  (5930,5),'AFTER SYSGEN',CLASS=T                       020040
//SL   EXEC   RPGECG                                                      020050
//RPG.SYSIN DD *                                                          020060
00000H                                                                    020070
01010FINPUT   IPE F  80  80            READ40                             020080
01020FOUTPUT  O   V 132 132     OF     PRINTER                            020090
01010IINPUT   AA  01   1 Z-                                               020100
01020I                                        8  29 NAME                  020110
01030I                                       30  310MONTH                 020120
01040I                                       32  330DAY                   020130
01050I                                       34  380INVNO                 020140
01060I                                       39  430CUSTNOL1              020150
01070I                                       44  450STATE                 020160
01080I                                       46  480CITY                  020170
01090I                                       74  802INVAMT                020180
01010C   01      INVAMT    ADD  TOTAL     TOTAL   72                      020190
01020C   01      INVAMT    ADD  GRPTOT    GRPTOT  72                      020200
01010OOUTPUT  H  201   1P                                                 020210
01020O       OR        OF                                                 020220
01030O                                   53 '      A C C O U N T S  R'    020230
01040O                                   77 ' E C E I V A B L E  R E '    020240
01050O                                   88 'G I S T E R'                 020250
01060O        H  1     1P                                                 020260
01070O       OR        OF                                                 020270
01080O                                   25 'CUSTOMER'                    020280
01090O                                   80 'LOCATION       INVOICE'      020290
01100O                                  109 'INVOICE DATE    INVOICE'     020300
01110O        H  2     1P                                                 020310
01120O       OR        OF                                                 020320
01130O                                   42 'NUMBER         CUSTOMER '    020330
01140O                                   46 'NAME'                        020340
01150O                                   79 ' STATE   CITY     NUMBER'    020350
01160O                                  108 ' MO    DAY     AMOUNT'       020360
02010O        D  2     01                                                 020370
02020O                         CUSTNOZ   23                               020380
02030O                         NAME      53                               020390
02040O                         STATE Z   59                               020400
02050O                         CITY  Z   67                               020410
02060O                         INVNO Z   79                               020420
02070O                         MONTH Z   90                               020430
02080O                         DAY   Z   96                               020440
02090O                         INVAMT   109 '$  ,  0.  '                  020450
02100O        T  2     L1                                                 020460
02110O                         GRPTOT B 109 '$  ,  0.  '                  020470
02120O                                  110 '*'                           020480
02130O        T  2     LR                                                 020490
02140O                         TOTAL    109 '$  ,  0.  '                  020500
02150O                                  111 '**'                          020510
//GO.SYSPRINT DD SYSOUT=A                                                 020520
//GO.OUTPUT DD SYSOUT=A                                                   020530
//GO.INPUT DD *                                                           020540
K      AMALGAMATED CORP      1110116031071233 61                          020550
K      BROWN WHOLESALE       1228123241131530231                          020560
K      BROWN WHOLESALE       1214995881131530231                          020570
K      FARM IMPLEMENTS       1018109011189747 77                          020580
K      BLACK OIL             11 8115091853016 67                          020590
K      BLACK OIL             1223122921853016 67                          020600
K      LEATHER BELT CO       11 8115112071636471                          020610
K      LEATHER BELT CO       1217122632071636471                          020620
K      GENERAL MFG CO        11141161529017 6 63                          020630
K      GENERAL MFG CO        11231167629017 6 63                          020640
K      A-B-C DIST CO          911 96892905425 39                          020650
K      A-B-C DIST CO         1111116052905425 39                          020660
/*                                                                        020670
