SPFAIRCR INITIAL
         L    2,0(1)
         CH    2,=H'4'
         BNH   NH16
ABEND254 ABEND 254,DUMP
*
NH16      SLL   2,2
         L    15,MODTBL(2)
         LA    1,4(1)
         CALL  (15)
         OSEOJ RC=(15)
MODTBL   DC    V(MASTOPN,MASTMOD)
         DC    V(MASTRCD,MASTHST)
         DC    V(MASTCLS)
LTORG    LTORG
PATCH    DS    10H
         END
