SPPGLS   INITIAL
         OPEN (PRINTER,(OUTPUT))
         CLRM  ARGS
         LOAD  EP=SPFAIRCR
         ST    0,ADFAIR
         L     15,ADFAIR
         CALL  (15),(0,ARG1,ARG2),VL
         CLI   ARG2,C'0'
         BE    CALLSORT
         ABEND 111,DUMP
CALLSORT LA    1,SORTPARM
         LINK  EP=SORT
         CLOSE PRINTER
         OSEOJ
         LTORG
SORTPARM DC    X'80',AL3(SORTCNT+2)
SORTCNT  DC    A(ENDPARM-BEGPARM)
BEGPARM  DC    A(BEGSORT,BEGRECD)
         DC    A(BEGRECD,ENDRECD)
         DC    A(EXIT15)
         DC    A(EXIT35)
         DC    X'FF00',C'AP'
ENDPARM  EQU   *
BEGSORT DC    C' SORT FIELDS=(1,8,CH,A),SIZE=E2000'
BEGRECD  DC    C' RECORD TYPE=F,LENGTH=108'
ENDRECD  DC    C' '
         DROP  3
EXIT15   SAVE  (14,12),,EXIT.15
     USING EXIT15,4
         LR    4,15
         LA    14,SAVE15
         ST    14,8(13)
         ST    13,4(14)
         LR    13,14
         L     15,ADFAIR
         CLRM ARGS
         CALL  (15),(1,ARG1,ARG2,SRG3),VL
         CLI   ARG2,C'1'
         BE    MODEND
         BL    MODOK
         ABEND 222,DUMP
MODEND   L     15,ADFAIR
         CALL  (15),(4)
         DELETE EP=SPFAIRCR
         L     13,4(13)
         RETURN (14,12),RC=8
*
MODOK    LA    1,ARG1
         L     13,4(13)
         SAVE  (1)
         RETURN (14,12),RC=12
         LTORG
         DROP  4
EXIT35   SAVE  (14,12),,EXIT.35
     USING  EXIT35,5
         LR    5,15
         LA    14,SAVE15
         ST    14,8(13)
         ST    13,4(14)
         LR    13,14
         LM    6,7,0(1)
         L    11,SAVE11
         LTR   6,6
         BZ    END35
         USING RECD,6
BHDG     NOP   MVCMOD
         OI    BHDG+1,240
         BAL   12,HDG
MVCMOD   MVC   PWK(8),MOD
         MVC   PWK+9(9),PGMR
         MVC   PWK+20(112),HDR2
         BAL   12,PUTPR
         MVC   PWK+20(112),HDR2
         BAL   12,PUTPR
RETURN   L     13,4(13)
         ST    11,SAVE11
         RETURN (14,12),RC=4
PUTPR    MVI   PWKC,9
PUTPRA   PUT   PRINTER,PWKC
         CLRM  PWK
         BCTR  11,12
HDG      MVI   PWKC,X'8B'
         PUT   PRINTER,PWKC
         LA    11,56
         MVC   PWK,HDR1
         ST    12,SAVE12
         BAL   12,PUTPR
         MVC   PWK+20(112),HDR2
         L     12,SAVE12
         B     PUTPR
*
END35    L     13,4(13)
         RETURN (14,12),RC=8
         DROP  5,6
PWKC     DS    C
PWK      DS    CL132
HDR1     DC    CL17'MODULE     PGMR'
         DC    20CL6'E'
HDR2     DC    4CL30'I     I     I     I     H'
SAVE11   DC    F'0'
SAVE12   DC    F'0'
SAVE15   DS    18F
ADFAIR   DS   F
ARGS     DC    0CL109' '
ARG2     DC    C' '
ARG1     DC    CL8' '
ARG3     DC    CL100' '
PRINTER DCB DDNAME=SYSPRINT,RECFM=FBM,LRECL=133,                       .
               MACRF=PM,DSORG=PS
         LTORG
RECD     DSECT
MOD      DS    CL8
PSWD     DS    CL4
DTADD    DS    CL6
DTUPDT   DS    CL10
NOCRD    DS    PL3
PGMR     DS    CL15
PROC     DS    CL8
DESC     DS    CL30
         DS    CL24
         END
