//PSGSSTS2     JOB  (1140,5),'TEST SYNCSORT',CLASS=N                        0010
/*MESSAGE      UPDATES SYS1.LINLIB. PSG. 04/5/76.                           0020
//STEP01   EXEC     PGM=IEFBR14                                             0030
//ALLOC        DD   DSN=ALLOC.SPACE.ONLY.NO.DATA,DISP=(,PASS),              0040
//             UNIT=SYSDA,SPACE=(TRK,(1,1)),                                0050
//             DCB=(RECFM=FB,LRECL=127,BLKSIZE=254)                         0060
//ZAP1         EXEC SUPERZAP,LIB1='SYS2.SYNCSORT',COND=EVEN                 0070
//SYSIN        DD   *                                                       0080
 NAME SYNCSORT MMROOT    CANCEL EF11  'USER ABEND 999 ON I/O ERROR'         0090
  VER  72  01            CANCEL EF11  'USER ABEND 999 ON I/O ERROR'         0100
 REP   72  00            CANCEL EF11  'USER ABEND 999 ON I/O ERROR'         0110
/*                                                                          0120
//STEP02   EXEC   PGM=SORT,COND=EVEN                                        0130
//STEPLIB      DD   DSN=SYS2.SYNCSORT,DISP=SHR                              0140
//SYSOUT       DD   SYSOUT=A                                                0150
//SORTIN       DD   DSN=ALLOC.SPACE.ONLY.NO.DATA,DISP=(OLD,PASS),           0160
//             DCB=(RECFM=FB,LRECL=127,BLKSIZE=254)                         0170
//SORTOUT      DD   SYSOUT=A,DCB=(RECFM=FB,LRECL=127,BLKSIZE=127)           0180
//SYSIN        DD   *                                                       0190
     SORT  FIELDS=(1,4,CH,A,5,5,CH,A)                                       0200
/*                                                                          0210
//ZAP2         EXEC SUPERZAP,LIB1='SYS2.SYNCSORT',COND=EVEN                 0220
//SYSIN        DD   *                                                       0230
 NAME SYNCSORT MMROOT    REINSTATE EF11  'USER ABEND 999 ON I/O ERROR'      0240
 VER 72 00               REINSTATE EF11  'USER ABEND 999 ON I/O ERROR'      0250
 REP 72 01               REINSTATE EF11  'USER ABEND 999 ON I/O ERROR'      0260
/*                                                                          0270
//STEP03   EXEC   PGM=SORT,COND=EVEN                                        0280
//STEPLIB      DD   DSN=SYS2.SYNCSORT,DISP=SHR                              0290
//SYSOUT       DD   SYSOUT=A                                                0300
//SORTIN       DD   DSN=ALLOC.SPACE.ONLY.NO.DATA,DISP=(OLD,PASS),           0310
//             DCB=(RECFM=FB,LRECL=127,BLKSIZE=254)                         0320
//SORTOUT      DD   SYSOUT=A,DCB=(RECFM=FB,LRECL=127,BLKSIZE=127)           0330
//SYSIN        DD   *                                                       0340
     SORT  FIELDS=(1,4,CH,A,5,5,CH,A)                                       0350
/*                                                                          0360
