//STEP17  JOB (1306,5,,,104,,,,30),'OF STAGE2 R21.7',                    0015130
//             TYPRUN=HOLD,COND=(4,LT)                                   0015140
/*ROUTE  PRINT LOCAL                                                     0015150
//SG17 EXEC PGM=IEWL,COND=(4,LT),                                        0015160
//  PARM='NCAL,DC,SIZE=(98K,12K),SCTR,LET,LIST,XREF'                     0015170
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=R217.UT3                    0015180
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X 0015190
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X 0015200
//             SYSOUT=A                                                  0015210
//SYSLMOD DD DISP=(OLD,PASS),UNIT=3330,                            XXXXX 0015220
//             VOLUME=SER=DSK401,                                    XXX 0015230
//             DSNAME=SYS1.NUCLEUS(IEANUC01)                             0015240
//CI505 DD DISP=SHR,DSNAME=R217.CI505,VOLUME=(,RETAIN,REF=DSK312)        0015250
//DM508 DD DISP=SHR,DSNAME=R217.DM508,VOLUME=(,RETAIN,REF=DSK312)        0015260
//CQ513 DD DISP=SHR,DSNAME=R217.CQ513,VOLUME=(,RETAIN,REF=DSK312)        0015270
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=R217.OBJ1$2               0015280
//LINKLIB DD DSN=SYS1.LINKLIB,DISP=SHR
//SYSLIN DD *                                                            0015290
         INSERT IEAANIP0                                                 0015300
 INSERT IEAAIH00                                                         0015310
 INSERT IGFCCH                                                           0015320
     INSERT IGC037
    INSERT IEWSYOVR
         INCLUDE SYSPUNCH(IEASVC00)                                      0015330
         INCLUDE SYSPUNCH(IEAASU00)                                      0015340
         INCLUDE SYSPUNCH(IEAANIP0)                                      0015350
 INCLUDE SYSPUNCH(IGFCCH)                                                0015360
     INCLUDE SYSPUNCH(IGC254)
    INCLUDE LINKLIB(IEWSZOVR)
         INCLUDE CI505(IEAGENQ1)                                         0015370
         INCLUDE CI505(IHLMCIHF)                                         0015380
         INCLUDE CI505(IEAASPRG)                                         0015390
          CHANGE IECTRDIL(IGXERROR)                                      0015400
          CHANGE IECTATRL(IGXERROR)                                      0015410
          CHANGE IECTCHSL(IGXERROR)                                      0015420
          CHANGE IECTCHAL(IGXERROR)                                      0015430
          CHANGE IECTRSTL(IGXERROR)                                      0015440
          INCLUDE  CI505(IGC116)                                         0015450
   INCLUDE SYSPUNCH(IEC23XXF)                                            0015460
      INCLUDE  CI505(IECTATTN)                                           0015470
 INCLUDE  SYSPUNCH(IGC018)                                               0015480
 CHANGE IEECVTCB(IEACMTCB)                                               0015490
 INCLUDE SYSPUNCH(IEECUCB)                                               0015500
 INCLUDE SYSPUNCH(IFBCTA00)                                              0015510
 INCLUDE SYSLMOD(IEANUC01)                                               0015520
 NAME IEANUC01(R)                                                        0015530
/*                                                                       0015540
//NEXTSTEP EXEC     RELEASE,JOB=STEP18                                   0015550
