//STEP16     JOB   (1306,5,,,52),'OF STAGE2 R21.7',
//         TYPRUN=HOLD,COND=(4,LT)
//STEP02   EXEC     PGM=IEHDASDR
//SYSPRINT      DD   SYSOUT=A
//SYSRES        DD   UNIT=3330,VOL=SER=SYSRES,DISP=OLD
//DSK401        DD   UNIT=3330,VOL=SER=DSK401,DISP=OLD
//SYSIN         DD   *
     DUMP FROMDD=SYSRES,TODD=DSK401,CPYVOLID=NO,PURGE=YES
/*
//NEXT   EXEC     RELEASE,JOB=STEP17
