//ZAPTCH0 JOB (1580,5),'AT I/O COMPLETION',CLASS=N
//STEP01       EXEC SUPERZAP,LIB1='SYS1.NUCLEUS'
     NAME      IEANUC01 IEAAIH00
     VER       0610 45200748
     REP       0610 47000748
     IDRDATA   I/O-TCH0
