//COMETP65     PROC FORM=1,STEP=1
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P21 - BELGIUM, BY COST CENTRE.                   *
//*              T375P22 - INTERNATIONAL, BY COST CENTRE.             *
//*                                                                   *
//*            INPUT = ACR RECORDS OF PRECEDING MONTH.                *
//*                                                                   *
//*            RESTART INSTRUCTIONS                                   *
//*           ----------------------                                  *
//*                                                                   *
//*             IF JOB FAILED TO STEP00R --> GO TO (1).               *
//*                              STEP01R --> GO TO (1).               *
//*                              STEP03  --> GO TO (1).               *
//*                              STEP05  --> GO TO (1).               *
//*                              STEP07  --> GO TO (1).               *
//*                              STEP09R --> GO TO (2).               *
//*                              STEP11R --> GO TO (3).               *
//*                                                                   *
//*      (1) RE-SUBMIT THE JOB.                                       *
//*      (2) RUN THE FOLLOWING JOB :                                  *
//*          //COMET65R JOB (3750,9),'YOUR NAME',CLASS=A              *
//*          //         EXEC COMETP65,STEP=9                          *
//*      (3) RUN THE FOLLOWING JOB :                                  *
//*          //COMET65R JOB (3750,9),'YOUR NAME',CLASS=A              *
//*          //         EXEC COMETP65,STEP=11                         *
//*                                                                   *
//*********************************************************************
//STEP00R      EXEC PGM=UTLCODE,PARM=&STEP
//*********************************************************************
//STEP01R      EXEC PGM=IERRCO00,
//             COND=(1,LT,STEP00R),REGION=0130K
//*********************************************************************
//*      SORT ACR RECORDS FROM MONTH-TO-DATE TAPE ON                  *
//*        COST CENTRE, PERSONNEL CODE, EXTENSION NO, PSN             *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=COMET.T375DMTD(0),DISP=OLD
//SORTOUT      DD   DSN=&&T375DMTD,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(CYL,(45,5),RLSE),DCB=(RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP65),DISP=SHR
//STEP03       EXEC PGM=UT434,PARM='REMOVE DSN=COMET.BELGIUM',
//             COND=(3,LT,STEP00R),REGION=0080K
//*********************************************************************
//*      REMOVE 'COMET.BELGIUM'  ENTRY FROM CATALOG.                  *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//STEP05       EXEC PGM=UT434,PARM='REMOVE DSN=COMET.INTERNAT',
//             COND=(5,LT,STEP00R),REGION=0080K
//*********************************************************************
//*      REMOVE 'COMET.INTERNAT' ENTRY FROM CATALOG.                  *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//STEP07       EXEC PGM=B1801,
//             COND=(7,LT,STEP00R),REGION=0120K
//*********************************************************************
//*      READ ACR RECORDS SORTED, AND WRITE ACR RECORDS OF BELGIUM    *
//*       CALLS TO SYSUT3 DATA SET, INTERNATIONAL CALLS TO SYSUT4 D/S.*
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&T375DMTD,DISP=(OLD,DELETE)
//SYSUT3       DD   DSN=COMET.BELGIUM,DISP=(NEW,CATLG,DELETE),
//             UNIT=3400,VOL=SER=001534,DCB=(RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//SYSUT4       DD   DSN=COMET.INTERNAT,DISP=(NEW,CATLG,DELETE),
//             UNIT=3400,VOL=SER=001535,DCB=(RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(B1801P65),DISP=SHR
//STEP09R      EXEC PGM=PARROTL,
//             COND=(9,LT,STEP00R),REGION=0192K
//*********************************************************************
//*      PRODUCE T375P21 REPORT 'BELGIUM, BY COST CENTRE'             *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   DUMMY
//PRINT        DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=COMET.BELGIUM,DISP=OLD
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=COMET.CONTRLIB(T375P21),DISP=SHR
//STEP11R      EXEC PGM=PARROTL,
//             COND=(11,LT,STEP00R),REGION=0192K
//*********************************************************************
//*      PRODUCE T375P22 REPORT 'INTERNATIONAL, BY COST CENTRE'       *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   DUMMY
//PRINT        DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=COMET.INTERNAT,DISP=SHR
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=COMET.CONTRLIB(T375P22),DISP=SHR
