//COMETP19     PROC FORM=1
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P19 - CLASS OF SERVICE REPORT,                   *
//*       THE INPUT DATA SET IS THE COMET ISAM TABLES  FILE.          *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*            FORM=N  : N IS ONE NUMERIC DIGIT SPECIFYING THE        *
//*                       NUMBER OF COPIES TO BE PRINTED (1 TO 4).    *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*      ------------------                                           *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*********************************************************************
//STEP01R      EXEC PGM=T375P82
//*********************************************************************
//*      UNLOAD COMET TABLES (ISAM FILE) TO SEQ. FILE.                *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//COMETABS     DD   DSN=COMET.T375F000,DISP=OLD,DCB=DSORG=IS
//T375F001     DD   DSN=&&STEP01R,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(38,19),RLSE)
//STEP03       EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*      SELECT TC09 TABLE                                            *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP01R,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP03,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(TRK,(38,19),RLSE)
//SYSIN        DD   DSN=COMET.CONTRLIB(B180119A),DISP=SHR
//STEP05       EXEC PGM=IEBGENER
//*********************************************************************
//*      FORMAT TS10 RECORDS                                          *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP03,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP05,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(TRK,(38,19),RLSE)
//SYSIN        DD   DSN=COMET.CONTRLIB(GENER19A),DISP=SHR
//STEP07       EXEC PGM=BUDGIE3,PARM=NOBC,REGION=0190K
//*********************************************************************
//*      ADD IN TS10 RECORDS,  INFORMATION FROM TC10 TABLE            *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//PRINT        DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP05,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP07,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(TRK,(38,19),RLSE)
//COMETABS     DD   DSN=COMET.T375F000,DISP=OLD,DCB=DSORG=IS
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSIN        DD   DSN=COMET.CONTRLIB(COMETB19),DISP=SHR
//STEP09       EXEC PGM=PARROTL,REGION=0192K
//*********************************************************************
//*      PRODUCE 'CLASS OF SERVICE' REPORT                            *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   DUMMY
//PRINT        DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=&&STEP07,DISP=(OLD,DELETE)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=COMET.CONTRLIB(T375P19),DISP=SHR
