//COMETP66     PROC FORM=1,INPUT=,SORT=
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P23 - ACR                                        *
//*                                                                   *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*      FORM=N - N IS ONE NUMERIC DIGIT SPECIFYING THE NUMBER        *
//*                OF COPIES TO BE PRINTED (1 TO 4).                  *
//*                                                                   *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*      RE-SUBMIT THE JOB.                                           *
//*                                                                   *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*      ------------------                                           *
//*      RE-SUBMIT THE JOB.                                           *
//*                                                                   *
//*********************************************************************
//STEP01R      EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*      SELECT ACR RECORDS                                           *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.&INPUT,DISP=OLD
//SYSUT2       DD   DSN=&&INPUTACR,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(CYL,(20,1),RLSE),DCB=(RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//STEP03       EXEC PGM=UT494,PARM='&SORT'
//TABLE        DD   DSN=COMET.CONTRLIB(UT494ACR),DISP=SHR
//SORTSTAT     DD   DSN=&&SORTSTAT,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,1)
//STEP05       EXEC PGM=IERRCO00,REGION=0130K
//*********************************************************************
//*      SORT INPUT ACR RECORDS                                       *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=&&INPUTACR,DISP=(OLD,DELETE)
//SORTOUT      DD   DSN=&&ACRSORTD,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(CYL,(20,1),RLSE),DCB=(RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//SYSIN        DD   DSN=&&SORTSTAT,DISP=(OLD,DELETE)
//STEP07       EXEC PGM=PARROTL,REGION=0192K
//*********************************************************************
//*      PRODUCE T375P23 REPORT                                       *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   DUMMY
//PRINT        DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=&&ACRSORTD,DISP=(OLD,DELETE)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=COMET.CONTRLIB(T375P23),DISP=SHR
