//COMETBUD     PROC AP='''''',PYEAR=19PP,BYEAR=19BB,PERC1=1000,
//             PERC2='10.00'
//*********************************************************************
//*                                                                   *
//*      PRODUCE 'T375PBD' REPORT.                                    *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*                                                                   *
//*      THIS REPORT SHOWS 'PROSPECT' OF CURRENT YEAR, AND            *
//*       'BUDGET' FOR NEXT YEAR REGARDING TELEPHONE CHARGES          *
//*       BY COST CENTRE. THE INPUT DATA ARE THE TELEPHONE            *
//*       CHARGES OF THE SIX FIRST MONTHS OF CURRENT YEAR             *
//*       (ACTUAL).                                                   *
//*                                                                   *
//*        PROSPECT = ACTUAL X 2                                      *
//*        BUDGET   = ( ACTUAL X 2 ) + NN,NN %                        *
//*                                                                   *
//*                                                                   *
//*       PYEAR = YEAR NUMBER FOR 'PROSPECT'                          *
//*       BYEAR = YEAR NUMBER FOR 'BUDGET'                            *
//*       PERC1 = PERCENTAGE TO OBTAIN 'BUDGET',                      *
//*               FORMAT NNNN ( IF 10% NNNN = 1000 ).                 *
//*       PERC2 = PERCENTAGE TO OBTAIN 'BUDGET',                      *
//*               FORMAT NN.NN ( IF 10% NN.NN  = 10.00 ).             *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*        RE-SUBMIT THE JOB.                                         *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*        RE-SUBMIT THE JOB.                                         *
//*                                                                   *
//*                                                                   *
//*********************************************************************
//STEP01R      EXEC PGM=B1801
//*********************************************************************
//*      SELECT SU  RECORDS OF THE FIRST SIX MONTHS OF THIS YEAR.     *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375SYTD(0),DISP=SHR
//SYSUT2       DD   DSN=&&SIXMONTH,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(10,1),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(B1801BD1),DISP=SHR
//STEP02       EXEC PGM=IERRCO00
//*********************************************************************
//*      SORT 'SU' RECORDS ON COST CENTRE.                            *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=&&SIXMONTH,DISP=(OLD,DELETE)
//SORTOUT      DD   DSN=&&COMETBUD,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(10,1),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP62),DISP=SHR
//STEP03       EXEC PGM=UT502,
// PARM='MODIFY,E,46,C&AP.19PP&AP:INSERT,46,C&AP&PYEAR&AP'
//*********************************************************************
//*      CREATE 'B1801' CONTROL CARDS FOR STEP07.                     *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT2       DD   DSN=&&STEP03,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,1),
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//STEP04       EXEC PGM=UT502,
// PARM='MODIFY,E,23,C&AP.19BB&AP:INSERT,23,C&AP&BYEAR&AP'
//*********************************************************************
//*      CREATE 'B1801' CONTROL CARDS FOR STEP07.                     *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT2       DD   DSN=&&STEP04,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,1),
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//STEP05       EXEC PGM=UT502,
// PARM='MODIFY,E,15,C&AP%%%%&AP:INSERT,15,C&AP&PERC1&AP'
//*********************************************************************
//*      CREATE 'B1801' CONTROL CARDS FOR STEP07.                     *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT2       DD   DSN=&&STEP05,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,1),
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//STEP06       EXEC PGM=UT502,
// PARM='MODIFY,E,21,C&AP%%.%%&AP:INSERT,21,C&AP&PERC2&AP'
//*********************************************************************
//*      CREATE 'B1801' CONTROL CARDS FOR STEP07.                     *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT2       DD   DSN=&&STEP06,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,1),
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//STEP07       EXEC PGM=B1801
//*********************************************************************
//*      SET-UP PARROT CONTROL CARDS FOR NEXT STEP.                   *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.CONTRLIB(COMETBD2),DISP=SHR
//SYSUT2       DD   DSN=&&PARROTCC,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1600)
//SYSIN        DD   DSN=&&STEP03,DISP=(OLD,DELETE)
//             DD   DSN=&&STEP04,DISP=(OLD,DELETE)
//             DD   DSN=&&STEP05,DISP=(OLD,DELETE)
//             DD   DSN=&&STEP06,DISP=(OLD,DELETE)
//STEP08       EXEC PGM=PARROTP
//*********************************************************************
//*      PRODUCE THE 'T375PBD' REPORT.                                *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//PRINT        DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=&&COMETBUD,DISP=(OLD,DELETE)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=&&PARROTCC,DISP=(OLD,DELETE)
