//COMETP31     PROC FORM=1,FILE='DMTD(0)'
//*********************************************************************
//*                                                                   *
//*      PRODUCE:  T375P31 - ACTIVITY ON INCOMING LINES               *
//*                T375P32 - ACTIVITY ON BOTHWAY & OUTGOING LINES     *
//*                T375P33 - ACTIVITY ON LEASED LINES                 *
//*                                                                   *
//*            INPUT = ACR RECORDS.                                   *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*            FORM=N  : N IS ONE NUMERIC DIGIT SPECIFYING THE        *
//*                       NUMBER OF COPIES TO BE PRINTED (1 TO 4).    *
//*            FILE=   : DEFINES THE INPUT DATA SET TO BE CONSIDERED, *
//*                       NORMALLY FILE='DMTD(0)' (ACR RECORDS OF     *
//*                       PRECEDING MONTH).                           *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*      ------------------                                           *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*********************************************************************
//STEP01       EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*                                                                   *
//*      SEPARATE DATA INTO : INCOMING                                *
//*                           LEASED                                  *
//*                           BOTHWAY                                 *
//*                           OUTGOING                                *
//*      OUTPUT RECORDS ARE TRUNCATED TO REDUCE DISK SPACE REQUIRED   *
//*                                                                   *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375&FILE,DISP=SHR
//INPUT        DD   DSN=&&INPUT,DISP=(,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=62,BLKSIZE=1488)
//INOUT        DD   DSN=&&INOUT,DISP=(,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=62,BLKSIZE=1488)
//OUT          DD   DSN=&&OUT,DISP=(,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=62,BLKSIZE=1488)
//LEASED       DD   DSN=&&LEASED,DISP=(,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=62,BLKSIZE=1488)
//SYSIN        DD   DSN=COMET.CONTRLIB(B1801P31),DISP=SHR
//STEP02       EXEC PGM=TWENTY80,REGION=0090K
//*********************************************************************
//*                                                                   *
//*      PROCUCE T375P31 - ACTIVITY ON INCOMING LINES                 *
//*                                                                   *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//PL1DUMP      DD   SYSOUT=A
//PRINT        DD   DSN=&&PRINT,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(2,2),RLSE),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=2660)
//DFILE        DD   DSN=&&INPUT,DISP=(OLD,DELETE)
//CARDS        DD   DSN=COMET.CONTRLIB(T375P31),DISP=SHR
//STEP03       EXEC PGM=TWENTY80,REGION=0090K
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P32 - ACTIVITY ON BOTHWAY AND OUTGOING LINES     *
//*                                                                   *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//PL1DUMP      DD   SYSOUT=A
//PRINT        DD   DSN=&&PRINT,DISP=(MOD,PASS),
//             SPACE=(TRK,(2,2),RLSE),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=2660)
//DFILE        DD   DSN=&&INOUT,DISP=(OLD,DELETE)
//             DD   DSN=&&OUT,DISP=(OLD,DELETE)
//CARDS        DD   DSN=COMET.CONTRLIB(T375P32),DISP=SHR
//STEP04       EXEC PGM=TWENTY80,REGION=0090K
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P33 - ACTIVITY ON LEASED LINES                   *
//*                                                                   *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//PL1DUMP      DD   SYSOUT=A
//PRINT        DD   DSN=&&PRINT,DISP=(MOD,PASS),
//             SPACE=(TRK,(2,2),RLSE),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=2660)
//DFILE        DD   DSN=&&LEASED,DISP=(OLD,DELETE)
//CARDS        DD   DSN=COMET.CONTRLIB(T375P33),DISP=SHR
//STEP05       EXEC PGM=BUDGIE3,PARM='COM=*,NOSEQ,CB=5220',
//             REGION=0190K
//*********************************************************************
//*                                                                   *
//*      REFORMAT THE REPORTS                                         *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//PRINT        DD   SYSOUT=A
//SYSUT2       DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=&&PRINT,DISP=(OLD,DELETE)
//SYSIN        DD   DSN=COMET.CONTRLIB(COMETB31),DISP=SHR
