//COMETP68     PROC STEP=1,GEN='+1'
//*********************************************************************
//*********************************************************************
//**                                                                 **
//**                                                                 **
//**     THIS PROCEDURE CREATES THE 'SZ' SUMMARY RECORDS.            **
//**                                                                 **
//**                                                                 **
//**     SYMBOLIC PARAMETERS :                                       **
//**     -------------------                                         **
//**                                                                 **
//**           STEP= - USED FOR RESTART                              **
//**           GEN= -   ALSO USED FOR RESTART.                       **
//**                                                                 **
//**                                                                 **
//**     RESTART INSTRUCTIONS :                                      **
//**     --------------------                                        **
//**                                                                 **
//**                 IF JOB FAILED TO STEP00R --> GO TO (1).         **
//**                                  STEP01R --> GO TO (1).         **
//**                                  STEP03  --> GO TO (1).         **
//**                                  STEP05R --> GO TO (2).         **
//**        SEE NOTE STEP07R <<<<<<<< STEP07R --> GO TO (3).         **
//**                                                                 **
//**                                                                 **
//**      (1) JUST RE-SUBMIT THE JOB.                                **
//**                                                                 **
//**      (2) RE-SUBMIT THE JOB, WITH THE FOLLOWING SYMBOLIC PARM.:  **
//**           STEP=5,GEN=0                                          **
//**                                                                 **
//**      (3) RE-SUBMIT THE JOB, WITH THE FOLLOWING SYMBOLIC PARM.:  **
//**           STEP=7                                                **
//**                                                                 **
//**                                                                 **
//**                                                                 **
//**                                                                 **
//*********************************************************************
//*********************************************************************
//STEP00R      EXEC PGM=UTLCODE,PARM=&STEP
//*********************************************************************
//*      SET CONDITION CODE                                           *
//*********************************************************************
//STEP01R      EXEC PGM=IERRCO00,
//             COND=(1,LT,STEP00R),REGION=0130K
//*********************************************************************
//*      SORT ACR RECORDS OF PRECEDING MONTH, ON DATE,HOUR AND CXTU   *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=COMET.T375DMTD(0),DISP=OLD
//             DD   DSN=COMET.T375FINC(0),DISP=OLD,UNIT=AFF=SORTIN
//SORTOUT      DD   DSN=&&STEP01R,DISP=(NEW,PASS,DELETE),UNIT=TAPE,
//             VOL=(,RETAIN),DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP68),DISP=SHR
//STEP03       EXEC PGM=BUDGIE3,COND=(3,LT,STEP00R),
//             PARM='KEYBREAK,COM=*,NOSEQ',REGION=0190K
//*********************************************************************
//*      CREATE SUMMARY RECORDS 'SZ'.                                 *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP01R,DISP=(OLD,DELETE)
//REFBACK      DD   DSN=COMET.T375ZMTD(-2),DISP=OLD
//SYSUT2       DD   DSN=COMET.T375ZMTD(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=(,RETAIN,REF=*.REFBACK),
//             DCB=(DSCB,RECFM=FB,LRECL=100,BLKSIZE=8000)
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN        DD   DSN=COMET.CONTRLIB(COMETB68),DISP=SHR
//STEP05R      EXEC PGM=COPY,COND=(5,LT,STEP00R)
//*********************************************************************
//*      CREATE THE NEW YEAR-TO-DATE D/S.                             *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375ZMTD(&GEN),DISP=OLD
//             DD   DSN=COMET.T375ZYTD(0),DISP=OLD,UNIT=AFF=SYSUT1
//REFBACK      DD   DSN=COMET.T375ZYTD(-2),DISP=OLD
//SYSUT2       DD   DSN=COMET.T375ZYTD(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=*.REFBACK,DCB=(DSCB,RECFM=FB,LRECL=100,
//             BLKSIZE=8000)
//*********************************************************************
//*****                     ***************                       *****
//**************************   ATTENTION   ****************************
//*****                     ***************                       *****
//********  SINCE JANUARY 1979 THIS JOB IS ONLY SUBMITTED  ************
//********   ON REQUEST. STEP07R HAS BEEN TRANSFERRED IN   ************
//********   COMETME PROCEDURE.                            ************
//*********************************************************************
//*STEP07R      EXEC PGM=UT423,COND=(7,LT,STEP00R)
//*********************************************************************
//*      PREPARE 'FINC' FOR NEXT MONTH.                               *
//*********************************************************************
//*REFBACK      DD   DSN=COMET.T375FINC(-2),DISP=OLD
//*EOFILE       DD   DSN=COMET.T375FINC(+1),DISP=(NEW,CATLG,DELETE),
//*             VOL=REF=*.REFBACK,DCB=(DSCB,RECFM=FB,LRECL=160,
//*             BLKSIZE=8000)
