//COMETMOD     PROC
//STEP01       EXEC PGM=B1801,REGION=0120K
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375F010(0),DISP=SHR
//SYSUT2       DD   DSN=COMET.T375F010(+1),DISP=(,CATLG,DELETE),
//             VOL=REF=COMET.POINTER1,SPACE=(TRK,(30,1),RLSE),
//             DCB=(DSCB,LRECL=300,BLKSIZE=1500),LABEL=EXPDT=11111
