//COMETP71     PROC
//*********************************************************************
//*                                                                   *
//*      + PRODUCE T375P81 - COMET TABLES LIST                        *
//*                                                                   *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*                                                                   *
//*                                                                   *
//*********************************************************************
//STEP01R      EXEC PGM=UT434,PARM='REMOVE DSN=COMET.T375F001',
//             REGION=0080K
//*********************************************************************
//*      REMOVE DSNAME = COMET.T375F001                               *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//COMET        DD   VOL=REF=COMET.POINTER1,DISP=OLD
//STEP03       EXEC PGM=T375P82
//*********************************************************************
//*      UNLOAD COMET TABLES (ISAM FILE) TO SEQ. FILE.                *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//COMETABS     DD   DSN=COMET.T375F000,DISP=OLD,DCB=DSORG=IS
//T375F001     DD   DSN=&&STEP03,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(38,19),RLSE)
//STEP05       EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*      DELETE COMET TABLES (TC10,11,12,13,14,15,16 AND 17)          *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP03,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP05,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(19,5),RLSE),DCB=(RECFM=FB,LRECL=100,
//             BLKSIZE=800)
//SYSIN        DD   DSN=COMET.CONTRLIB(B1801P71),DISP=SHR
//STEP07       EXEC PGM=IEBGENER
//*********************************************************************
//*      FORMAT NEW COMET TABLES (TC10,11,12,13,14,15,16 AND 17)      *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DDNAME=TCCARDS
//SYSUT2       DD   DSN=&&STEP07,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(19,5),RLSE),DCB=(RECFM=FB,LRECL=100,
//             BLKSIZE=800)
//SYSIN        DD   DSN=COMET.CONTRLIB(GENERP71),DISP=SHR
//STEP09       EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*      WRITE ON SYSUT3 THE TC12 WITHOUT THTU (SRQP'S NOT USED)      *
//*      WRITE ON SYSUT4 THE OTHERS TC                                *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP07,DISP=(OLD,DELETE)
//SYSUT3       DD   DSN=&&STEP09A,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(19,5),RLSE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//SYSUT4       DD   DSN=&&STEP09B,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(19,5),RLSE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//SYSIN        DD   DSN=COMET.CONTRLIB(B180171B),DISP=SHR
//STEP10       EXEC PGM=B1801,REGION=0120K
//*********************************************************************
//*      MODIFY - TC11, ONLY THE ABBREVIATED NUMBERS NOT USED         *
//*               TC17, ONLY FOR 2ND, 3RD AND 4TH REROUTING           *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP09B,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP10,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(19,5),RLSE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//SYSIN        DD   DSN=COMET.CONTRLIB(B180171C),DISP=SHR
//STEP11       EXEC PGM=IEBGENER
//*********************************************************************
//*      FORMAT TC12 RECORDS FOR WHICH NO THTU HAS BEEN ASSIGNED      *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP09A,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&STEP11,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(19,5),RLSE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//SYSIN        DD   DSN=COMET.CONTRLIB(GENER71B),DISP=SHR
//STEP13       EXEC PGM=UT467,PARM='RKP=1,KEYLEN=30',REGION=0190K
//*********************************************************************
//*      DELETE DUPLICATE                                             *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT       DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SORTLIST     DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,2)
//SORTWORK     DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT1       DD   DSN=&&STEP05,DISP=(OLD,DELETE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//             DD   DSN=&&STEP10,DISP=(OLD,DELETE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//             DD   DSN=&&STEP11,DISP=(OLD,DELETE),
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//SYSUT4       DD   DSN=COMET.T375F001,DISP=(NEW,CATLG,DELETE),
//             VOL=REF=COMET.POINTER1,SPACE=(TRK,(38,19),RLSE),
//             LABEL=RETPD=25,DCB=(RECFM=FB,LRECL=100,BLKSIZE=800)
//STEP15R      EXEC PGM=UT434,PARM='REMOVE DSN=COMET.T375F000',
//             REGION=0080K
//*********************************************************************
//*      REMOVE DSNAME = COMET.T375F000                               *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//COMET        DD   VOL=REF=COMET.POINTER1,DISP=OLD
//STEP17       EXEC PGM=T375P83
//*********************************************************************
//*      CREATE COMET.T375F000 (ISAM FILE), WITH  INFORMATION IN      *
//*       COMET.T375F001 D/S. COMET.T375F001 IS NORMALLY THE SECURITY *
//*       D/S OF COMET.T375F000.                                      *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//T375F001     DD   DSN=COMET.T375F001,DISP=SHR
//COMETABS     DD   DSN=COMET.T375F000(INDEX),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=COMET.POINTER1,LABEL=EXPDT=11111,
//             DCB=(DSORG=IS,RKP=1,KEYLEN=30,OPTCD=RILY,CYLOFL=2,
//             RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(CYL,(1),,CONTIG)
//             DD   DSN=COMET.T375F000(PRIME),DISP=(NEW,KEEP,DELETE),
//             VOL=REF=COMET.POINTER1,LABEL=EXPDT=11111,
//             DCB=(DSORG=IS,RKP=1,KEYLEN=30,OPTCD=RILY,CYLOFL=2,
//             RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(CYL,(4),,CONTIG)
//             DD   DSN=COMET.T375F000(OVFLOW),DISP=(NEW,KEEP,DELETE),
//             VOL=REF=COMET.POINTER1,LABEL=EXPDT=11111,
//             DCB=(DSORG=IS,RKP=1,KEYLEN=30,OPTCD=RILY,CYLOFL=2,
//             RECFM=FB,LRECL=100,BLKSIZE=800),
//             SPACE=(CYL,(1),,CONTIG)
//STEP19       EXEC PGM=T375P81
//*********************************************************************
//*      LIST OF COMET TABLES                                         *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//COMETABS     DD   DSN=COMET.T375F000,DISP=OLD,DCB=DSORG=IS
//LIMIT        DD   DSN=COMET.CONTRLIB(LIMITALL),DISP=SHR
//PRINT        DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
