//COMETP61     PROC DGEN='+1',SGEN='+1',STEP=1,SYTD='+1'
//*********************************************************************
//*                                                                   *
//*      CREATE 'SU' RECORDS.                                         *
//*                                                                   *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*      STEP= - USED FOR RESTART.                                    *
//*                                                                   *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*                                                                   *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*      ------------------                                           *
//*      RE-SUBMIT THE JOB.                                           *
//*                                                                   *
//*                                                                   *
//*********************************************************************
//STEP00R      EXEC PGM=UTLCODE,PARM=&STEP
//*********************************************************************
//STEP01R      EXEC PGM=IERRCO00,
//             COND=(1,LT,STEP00R),REGION=0130K
//*********************************************************************
//*      SORT ACR RECORDS FROM MONTH-TO-DATE TAPE ON                  *
//*        YEAR, MONTH, COST CENTRE, PERSONNEL CODE AND THTU          *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=COMET.T375DMTH(0),DISP=OLD
//REFBACK      DD   DSN=COMET.T375DMTD(-2),DISP=OLD
//SORTOUT      DD   DSN=COMET.T375DMTD(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=*.REFBACK,
//             DCB=(DSCB,RECFM=FB,LRECL=160,BLKSIZE=8000)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP61),DISP=SHR
//STEP02R      EXEC PGM=B1801,PARM=UNLIKE,
//             COND=(2,LT,STEP00R),REGION=0120K
//*********************************************************************
//*      SEPARATE THE ACR-LONG-DISTANCE-CALL-NON-AUTOMATIC AND THE    *
//*       ACR-COST-CENTRE-79999.                                      *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375F799(0),DISP=OLD
//             DD   DSN=COMET.NOMATACR(0),DISP=SHR
//SYSUT3       DD   DSN=COMET.NOMATACR(+1),DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(38,19),RLSE),LABEL=EXPDT=11111,
//             VOL=REF=COMET.POINTER2,
//             DCB=(DSCB,RECFM=FB,BLKSIZE=1600,LRECL=160)
//SYSUT4       DD   DSN=&&T375F799,DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(20,1),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(B1801P61),DISP=SHR
//STEP02A      EXEC PGM=IEBGENER
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DSN=EAGLE.MTHREC,DISP=SHR
//SYSUT2       DD   DSN=&&STEP02,DISP=(NEW,PASS,DELETE),
//             UNIT=TAPE,VOL=(,RETAIN),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=8000)
//SYSIN        DD   DSN=COMET.CONTRLIB(GENERP61),DISP=SHR
//STEP02B      EXEC PGM=IERRCO00,
//             COND=(2,LT,STEP00R),REGION=0130K
//*********************************************************************
//*      SORT ACR RECORDS COST CENTRE 79999 ON                        *
//*        YEAR, MONTH, COST CENTRE, PERSONNEL CODE AND THTU          *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,20)
//SORTIN       DD   DSN=&&T375F799,DISP=(OLD,DELETE)
//SORTOUT      DD   DSN=&&STEP02,DISP=(MOD,PASS,DELETE),
//             UNIT=TAPE,VOL=(,RETAIN),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=8000)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP61),DISP=SHR
//STEP03       EXEC PGM=BUDGIE3,PARM='KEYBREAK,PPL+,UNLIKE,NOSEQ',
//             COND=(3,LT,STEP00R),REGION=0190K
//*********************************************************************
//*      CREATE SUMMARY RECORDS 'SU'.                                 *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP02,DISP=(OLD,DELETE)
//             DD   DSN=COMET.T375DMTD(&DGEN),DISP=OLD
//SYSUT2       DD   DSN=COMET.T375SMTD(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=COMET.POINTER2,SPACE=(TRK,(38,19),RLSE),
//             LABEL=EXPDT=11111,DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN        DD   DSN=COMET.CONTRLIB(COMETB61),DISP=SHR
//STEP05R      EXEC PGM=COPY,
//             COND=(5,LT,STEP00R)
//*********************************************************************
//*      COPY MTD(+1) + YTD(0) TO YTD(+1)                             *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375SMTD(&SGEN),DISP=SHR
//             DD   DSN=COMET.T375SYTD(0),DISP=SHR
//SYSUT2       DD   DSN=COMET.T375SYTD(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=COMET.POINTER2,LABEL=EXPDT=11111,
//             SPACE=(TRK,(95,19),RLSE),DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=1600)
//STEP07R      EXEC PGM=UT423,
//             COND=(7,LT,STEP00R)
//*********************************************************************
//*      PREPARE DMTH FILE FOR NEXT MONTH                             *
//*********************************************************************
//REFBACK      DD   DSN=COMET.T375DMTH(-2),DISP=OLD
//EOFILE       DD   DSN=COMET.T375DMTH(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=*.REFBACK,DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=8000)
//STEP09R      EXEC PGM=UT423,
//             COND=(9,LT,STEP00R)
//*********************************************************************
//*      PREPARE F799 FILE FOR NEXT MONTH                             *
//*********************************************************************
//REFBACK      DD   DSN=COMET.T375F799(-2),DISP=OLD
//EOFILE       DD   DSN=COMET.T375F799(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=*.REFBACK,DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=8000)
//STEP11R      EXEC PGM=UT434,PARM='REMOVE DSN=COMET.T375USE1',
//             COND=(11,LT,STEP00R)
//*********************************************************************
//*      REMOVE USER REPORT DATA SET                                  *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//DISK         DD   VOL=REF=COMET.POINTER1,DISP=SHR
//STEP13R      EXEC PGM=BUDGIE3,PARM=NOBC,REGION=0190K,
//             COND=(13,LT,STEP00R)
//*********************************************************************
//*      INCREASE LRECL OF 'SU'  RECORDS OF 80 BYTES, AND WITH        *
//*       BUDGIE3 ADD IN THESE BYTES : 1. COST CENTRE NAME.           *
//*                                    2. DISTRIBUTION (WITH DROP BOX *
//*                                       NO).                        *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375SYTD(&SYTD),DISP=SHR
//SYSUT2       DD   DSN=&&STEP13,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(95,95),RLSE),LABEL=RETPD=30,
//             DCB=(RECFM=FB,LRECL=240,BLKSIZE=2400)
//BBTABLES     DD   DSN=BXLTAB.T599F051,DISP=SHR,DCB=DSORG=IS
//GENLEDGR     DD   DSN=BXLTAB.T599F010,DISP=SHR,DCB=DSORG=IS
//WORK         DD   UNIT=SYSDA,SPACE=(TRK,38,RLSE)
//SYSIN        DD   DSN=COMET.CONTRLIB(COMETB63),DISP=SHR
//STEP15       EXEC PGM=IERRCO00,REGION=0130K,
//             COND=(15,LT,STEP00R)
//*********************************************************************
//*      SORT 'SU' RECORDS ON ;                                       *
//*       COST CENTRE AND PERSONNEL CODE.                             *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,(95,95))
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,(95,95))
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,(95,95))
//SORTWK04     DD   UNIT=SYSDA,SPACE=(TRK,(95,95))
//SORTIN       DD   DSN=&&STEP13,DISP=(SHR,DELETE)
//SORTOUT      DD   DSN=&&STEP15,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(95,19),RLSE)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTST1),DISP=SHR
//STEP17       EXEC PGM=T375P101,
//             COND=(17,LT,STEP00R)
//*********************************************************************
//*        CREATE COMET USER REPORTS DATA SET                         *
//*********************************************************************
//STEPLIB      DD   DSN=COMET.PROGLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP15,DISP=(SHR,DELETE)
//SYSUT2       DD   DSN=COMET.T375USE1,DISP=(NEW,CATLG,DELETE),
//             VOL=REF=COMET.POINTER1,SPACE=(TRK,(95,95),RLSE),
//             LABEL=RETPD=30
