//COMETP64     PROC FORM=1
//*********************************************************************
//*                                                                   *
//*      PRODUCE T375P64 - TOP 50 REPORT.                             *
//*                                                                   *
//*            INPUT = SU RECORDS OF PRECEDING MONTH.                 *
//*                                                                   *
//*      SYMBOLIC PARAMETERS :                                        *
//*      -------------------                                          *
//*            FORM=N  : N IS ONE NUMERIC DIGIT SPECIFYING THE        *
//*                       NUMBER OF COPIES TO BE PRINTED (1 TO 4).    *
//*                                                                   *
//*      RESTART INSTRUCTIONS :                                       *
//*      --------------------                                         *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*      RERUN INSTRUCTIONS :                                         *
//*      ------------------                                           *
//*            RE-SUBMIT THE JOB.                                     *
//*                                                                   *
//*********************************************************************
//STEP01R      EXEC PGM=IERRCO00,REGION=0130K
//*********************************************************************
//*      SORT 'SU' RECORDS ON ;                                       *
//*       TOTAL COST (D).                                             *
//*********************************************************************
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,10)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,10)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,10)
//SORTWK04     DD   UNIT=SYSDA,SPACE=(CYL,10)
//SORTIN       DD   DSN=COMET.T375SMTD(0),DISP=SHR
//SORTOUT      DD   DSN=&&STEP01R,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(38,19),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//SYSIN        DD   DSN=COMET.CONTRLIB(SORTP64),DISP=SHR
//STEP03       EXEC PGM=UT402,PARM=(1,50,1)
//*********************************************************************
//*      SELECT THE 50 FIRST RECORDS FROM 'SYSUT1' D/S                *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&STEP01R,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&T375SMTD,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(TRK,(38,19),RLSE),
//             DCB=(RECFM=FB,LRECL=160,BLKSIZE=1600)
//STEP05       EXEC PGM=PARROTP,REGION=0192K
//*********************************************************************
//*      PRODUCE T375P64 REPORT                                       *
//*********************************************************************
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   DUMMY
//PRINT        DD   SYSOUT=(&FORM,,161&FORM),
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//TW80         DD   SYSOUT=A,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=133)
//SYSUT1       DD   DSN=&&T375SMTD,DISP=(OLD,DELETE)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(TRK,1)
//SYSLIN       DD   DSN=PARROT.PICTURE,DISP=SHR
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,1),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=COMET.CONTRLIB(T375P64),DISP=SHR
