//COMETME      PROC
//STEP01       EXEC PGM=UT418
//*********************************************************************
//*      RE-CYCLE TAPE GENERATION DATA SETS                           *
//*********************************************************************
//SYSUT1       DD   DSN=COMET.T375DYTD(-2),DISP=OLD
//SYSUT2       DD   DSN=COMET.T375DYTD(+1),DISP=(NEW,CATLG,DELETE),
//             UNIT=AFF=SYSUT1,DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=8000),VOL=(,RETAIN)
//STEP03       EXEC PGM=COPY
//*********************************************************************
//*      CREATE NEW YEAR-TO-DATE TAPES                                *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=COMET.T375DMTD(0),DISP=OLD
//             DD   DSN=COMET.T375DYTD(0),DISP=OLD,
//             UNIT=AFF=SYSUT1
//             DD   DSN=COMET.T375FINC(0),DISP=OLD,
//             UNIT=AFF=SYSUT1
//SYSUT2       DD   DSN=COMET.T375DYTD(+1),DISP=OLD
//STEP05R      EXEC PGM=UT423
//*********************************************************************
//*      PREPARE 'FINC' FOR NEXT MONTH.                               *
//*********************************************************************
//REFBACK      DD   DSN=COMET.T375FINC(-2),DISP=OLD
//EOFILE       DD   DSN=COMET.T375FINC(+1),DISP=(NEW,CATLG,DELETE),
//             VOL=REF=*.REFBACK,DCB=(DSCB,RECFM=FB,LRECL=160,
//             BLKSIZE=8000)
