//STEP99       EXEC RELEASE,JOB=DAMBDG01
//DAMBDG01 JOB (6000,5),'STANDARD TEST',CLASS=N,TYPRUN=HOLD
///*ROUTE  PRINT REMOTE14
-INC BUDGID01                                                                  %
//STEP07       EXEC BUDGIE3,PARM.STEP01='CB=4200,WA=3800,MB=2298,X=WYZ'
//STEP08       EXEC BUDGIE3,N=,
//             PARM.STEP01='CB=4200,WA=3800,MB=2298,X=WYZ'
