//STEP99       EXEC RELEASE,JOB=DAMBDGCO
//DAMBDGCO JOB (6000,5),'CONTROL RECORDS',CLASS=N,TYPRUN=HOLD
//*ROUTE  PRINT REMOTE14
//STEP01       EXEC COST02,PARM='COSTCNTR,CHARGE,CATEGORY,JOBNAME'
//SYSOUT       DD   DUMMY
//SYSUT1       DD   DSN=COST.T580F010(0)
//SYSUT2       DD   DSN=&&T580F010,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=110,BLKSIZE=1100)
//STEP02       EXEC PGM=B1801
//*
//*      ADD CONSTANT FILE ID FOR BUDGIE TO RECOGNISE 'CARD' TYPE
//*
//SYSPRINT     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&T580F010,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&T580F011,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=110,BLKSIZE=1100)
 MODIFY,L,29,C'9'
 INSERT,1,C'NNN'
//STEP03       EXEC PGM=BUDGIE31,PARM='KEYBREAK,MS11=PPPL'
//STEPLIB      DD   DSN=SYS2.TESTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//PRINT        DD   SYSOUT=A
//SYSUT2       DD   SYSOUT=A
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT1       DD   DSN=&&T580F011,DISP=(OLD,DELETE)
MS01  BUDGIE3: CREATE CONTROL RECORDS TO SUMMARISE HASP ACCOUNTING DATA
MS02                   D     0802        315194252      118
MS0300103C/R                                                                  1
MS04RC01105
MS04  05111  BNO
MS04  07108  111
MS04A102110
MS04A203110
MS04A304110 2
MS11013NNN          05930  A1P06530  A2P07242  A3P
MS13                                     C3  JN
MS13                                     ER2      DELETE REDUNDANT DETAIL RECORD
MS33JN00408MV11108

FORMAT OF OUTPUT CONTROL RECORDS :-
C/R       RECNT     LINES....*CARDS....*EXEC TIME*CCNTRCHRGCT         JOB NAME
