//BUDGIE3      PROC Y=Y,MAN=DAM
//STEP01       EXEC PGM=BUDG&Y&MAN,PARM='SF=IN'
//STEPLIB      DD   DSN=TESTLIB,DISP=SHR
//SYSUDUMP     DD   SYSOUT=A
//SYSUT1       DD   DSN=&&BATCHIN,DISP=(OLD,PASS)
//SYSUT2       DD   DSN=&&BATCHOUT,DISP=(OLD,PASS),
//             SPACE=(TRK,(20,10),RLSE)
//SUSPIN       DD   DSN=&&SUSPIN,DISP=(OLD,PASS)
//SUSPOUT      DD   DSN=&&SUSPOUT,DISP=(OLD,PASS),
//             SPACE=(TRK,(20,10),RLSE)
//WORK         DD   UNIT=SYSDA,SPACE=(CYL,(5,5))
//PRINT        DD   SYSOUT=A
//SYSPRINT     DD   SYSOUT=A
//LOGLIST      DD   SYSOUT=A
//DUPLICAT     DD   SYSOUT=A
//LOGIN        DD   DSN=&&LOGIN,DISP=(OLD,PASS)
//LOGOUT       DD   DSN=&&LOGOUT,DISP=(OLD,PASS),
//             SPACE=(TRK,(20,10),RLSE)
//SYSIN        DD   DSN=&&CONTROL,DISP=(OLD,PASS)
//DELETED      DD   DSN=&&DELETED,DISP=(OLD,PASS),
//             SPACE=(TRK,(20,10),RLSE)
//STEP02       EXEC PGM=UTL001,COND=EVEN
//SYSPRINT     DD   SYSOUT=A
//LISTDATA     DD   DISP=(OLD,PASS),DSN=&&BATCHOUT
//STEP03       EXEC PGM=UTL001,COND=EVEN
//SYSPRINT     DD   SYSOUT=A
//LISTDATA     DD   DISP=(OLD,PASS),DSN=&&SUSPOUT
//STEP04       EXEC PGM=UTL001,COND=EVEN
//SYSPRINT     DD   SYSOUT=A
//LISTDATA     DD   DISP=(OLD,PASS),DSN=&&LOGOUT
//STEP05       EXEC PGM=UTL001,COND=EVEN
//SYSPRINT     DD   SYSOUT=A
//LISTDATA     DD   DISP=(OLD,PASS),DSN=&&DELETED
//             PEND
//BUILD        PROC
//STEP01       EXEC PGM=COPY
//SYSPRINT     DD   DUMMY
//SYSUT2       DD   DSN=&DSN,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//             PEND
//STEP01       EXEC BUILD,DSN='&&CONTROL'
//*
//*      CONSTRUCT CONTROL CARD FILE
//*
//SYSUT1       DD   *
MS00  **-      BUDGIE  SYSTEM  TEST  DATA - SUSPENSE  FILE  UPDATE           -**
MS01  **-      BUDGIE  SYSTEM  TEST  DATA - BATCH  BALANCING  REPORT         -**
MS02025BSB01   CSB01   D  783 801        074125
MS1300740125    EQAA4623456         07110L4
MS05RC2103            COUNT         OF RECS
MS05NZ56050                                 1613NEG
MS05A12605            FIELD             A1
MS05A231050           FIELD             A2
MS05A336051           FIELD             A3
MS05A441052           FIELD             A4
MS05A546053           FIELD             A5
MS05A651054           FIELD             A6 1
MS05A75605            FIELD             A7 11613NEG
MS11025BSD01        26050A1   31050A2
MS11025BSD01                            36051A3
MS13                                04110L1
MS13                                05110L2
MS13                                06110L3
MS11025BSD04   IGN
MS11025BSD02        26052A4   31053A5
MS11025BSD03        26054A6   31053A7
MS11025BSD05
MS13                                01110L1
MS13                                02110L2
MS13                                03110L3
MS13                                04110L4
MS13                                05105L5
MS13                                05605NN1
MS13                                05605NS2
MS13                                05605NZ
MS13                                05605NB
MS12025BSD06        26062A4   251+
MS12015BSD06        26062A4   251+
MS02015BSB02   CSB02      783 801        064115
MS05A131101           ONLY           FIELD
MS11017BSD0201      26051A1
MS11017BSD0202      31051A1
MS11017BSD0203      36051A1
MS02015BSB03   CSB03      783 801        064115
MS05RC2105                                  1
MS05AA31051           FIELD            AA  1 365MINUS
MS12017BSD0301      31051AA   363NEG
MS12017BSD0302      41051AA      NONZERO
MS02015BSB04   CSB04      783 801        064124191
MS05RC2203
MS11017BSD04L1
MS13                                02110L1       DESCRIPTION NOT ALPHABETIC
MS11017BSD04L2
MS13                                02110L2       DESCRIPTION NOT ANY GOOD
MS11017BSD04L3
MS13                                02110L3
MS11017BSD04L4
MS13                                02110L4       THIS FIELD MAY NOT BE BLANK
MS130091        EQ*                 02110L41
MS130091        EQ*                 02110L42
MS11017BSD04L5
MS13                                02110L51      NAUGHTY, NAUGHTY - BLANK MAND.
MS11017BSD04L7
MS13                                03105L7
MS11017BSD04L8
MS13                                03105L8
MS130087        EQNUMERIC           03105US1
MS11017BSD04NN
MS13                                03105NN       COST CENTRE MUST BE NUMERIC
MS11017BSD04NS
MS13                                03105NS
MS11017BSD04NZ
MS13                                03105NZ
MS11017BSD04NB
MS13                                03105NB1
MS11017BSD04US
MS13                                03105US1
MS11017BSD04UZ
MS13                                03105UZ
MS11017BSD04UB
MS13                                03105UB
//STEP02       EXEC BUILD,DSN='&&INBATCH'
//*
//*      CONSTRUCT INPUT TO BUDGIE1
//*
//SYSUT1       DD   *
 BSB01AA46 23456     15      5   1}   15    8   10   18   2JNEG
 BSD04 CARD TYPE BSD06 APPLIES TO A4 & HAS EXTRRNAL NEGATIVE
 BSD04 A4 SHOULD BE +79 OUT OF BALANCE
 BSD04 B/C FIDLS A6 & A7 ARE BALANVING
 BSD04 B/C FIELD A7 HAS EXTERNAL NEGATIVE
 BSD04 BATCH SHOULD BE REJECTED OUT OF BALANCE
 BSD99 THIS UNKNOWN RECORD TYPE SHOULD BE DROPPED BUT IF NOT I ANTICIPATE AN 0C7
 BSD99 THIS UNKNOWN RECORD TYPE SHOULD BE DROPPED BUT IF NOT I ANTICIPATE AN 0C7
 BSD04 THIS   KNOWN RECORD TYPE SHOULD BE IGNORED BUT IF NOT I ANTICIPATE AN 0C7
 BSD04 THIS   KNOWN RECORD TYPE SHOULD BE IGNORED BUT IF NOT I ANTICIPATE AN 0C7
 BSD01                       1    K    3ALPHABETICALPHAMERICALPHAMERIC
 BSD01                       1    K    3ABCDE FGHIABCDE 1234ABCDEF 123
 BSD01                       1    K    3ABCDE1FGHIABCDEFGHIJABCDEFGHIJ
 BSD01                       1    K    31ABCDEFGHIABC 123 //AB1234/@%A
 BSD01                       1    K    3ABCDEFGHI1ABCD1234  AB1204/@%A
 BSD02                       4    5     /         /
 BSD02                       4    5     /         /
 BSD03                       6    P     /         /
 BSD03                       6    P     /         /
 BSD03                       6    P     /         /
 BSD05    ALPHABETICALPHAMERICALPHAMERIC NON-BLANKBLANK  NN   NS   NZ   NB
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    //        //                            *   * 122A 1 2A 1 2A 1 2A
 BSD05    ABCD EFGHIABC 12345DABC/%$1234ANYTHING        1234   1A   1A
 BSD06                  +123456
 BSD06                   123456
 BSD06                  +    79
BSD06                        20
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    01
BSD06                   +    02
BSD06                   +    03
BSD06                   +    04
BSD06                   +    05
BSD06                   +    06
BSD06                   +    07
BSD06                   +    08
BSD06                   +    09
BSD06                   +    10
BSD06                   +    11
BSD06                   +    12
BSD06                   +    13
BSD06                   +    14
BSD06                   +    15
BSD06                   +    16
BSD06                   +    17
BSD06                   +    18
BSD06                   +    19
BSD06                   +    20
BSD06                   +    21
BSD06                   +    22
BSD06                   +    23
BSD06                   +    24
BSD06                   +    25
BSD06                   +    26
BSD06                   +    27
BSD06                   +    28
BSD06                   +    29
BSD06                   +    30
BSD06                   +    31
BSD06                   +    32
BSD06                   +    33
BSD06                   +    34
BSD06                   +    35
BSD06                   +    36
BSD06                   +    37
BSD06                   +    38
BSD06                   +    39
BSD06                   +    40
BSD06                   +    41
BSD06                   +    42
BSD06                   +    43
BSD06                   +    44
BSD06                   +    45
BSD06                   +    46
BSD06                   +    47
BSD06                   +    48
BSD06                   +    49
BSD06                   +    50
BSD06                        01
BSD06                        02
BSD06                        03
BSD06                        04
BSD06                        05
BSD06                        06
BSD06                        07
BSD06                        08
BSD06                        09
BSD06                        10
BSD06                        11
BSD06                        12
BSD06                        13
BSD06                        14
BSD06                        15
BSD06                        16
BSD06                        17
BSD06                        18
BSD06                        19
BSD06                        20
BSD06                        21
BSD06                        22
BSD06                        23
BSD06                        24
BSD06                        25
BSD06                        26
BSD06                        27
BSD06                        28
BSD06                        29
BSD06                        30
BSD06                        31
BSD06                        32
BSD06                        33
BSD06                        34
BSD06                        35
BSD06                        36
BSD06                        37
BSD06                        38
BSD06                        39
BSD06                        40
BSD06                        41
BSD06                        42
BSD06                        43
BSD06                        44
BSD06                        45
BSD06                        46
BSD06                        47
BSD06                        48
BSD06                        49
BSD06                        50
 BSB01AA47 23456      3      2    4    0    0    0    0    0          IN BALANCE
 BSD04 THIS R-KNOWN RECORD TYPE SHOULD BE IGNORED BUT IF NOT I ANTICIPATE AN 0C7
 BSD01                       1    2    L
 BSD01                       1    2    3
 BSB01AA45 23467      2      0    0    0   12    N    0    0          BAD RECCNT
 BSD04 RECORD COUNT OUT OF BALANCE - REJECT TO SUSPENSE
 BSD02                       4    5
 BSD02                       4    5
 BSD02                       4    5
 BSD02                       4    N
 BSD02                       M    N
 BSD02                       M    N
 BSD02                       4    N
 BSB01AA45 23468      4                    12    5
 BSD04 FIELD A5 OUT OF BALANCE - REJECT TO SUSPENSE
 BSD02                       4    5
 BSD02                       4    5
 BSD02                       4    5
 BSB01AA46 23468      1      1    K    3
 BSD01                       1    K    3
 BSB01AA45 76543      5                           33019    7
 BSD04 B/C FIELDS A6 & A7 ARE BALANCING
 BSD04 FIELDS A6 & A7 ARE OUT OF BALANCE - REJECT TO SUSPEBSE
 BSD03                   11006    P
 BSD03                   11006    7
 BSD03                   11006    7
 BSB01AA46 01265      4                           11007    7NEG
 BSD04 FIELDS A6 & A7 ARE BALANCING
 BSD04 B/C FIELDS A7 HAS AN EXTERNAL NEGATIBE
 BSD04 BATCH SHOULD BE BALANCED & ACCEPTED
 BSD03                   1100P    7
BSB02BB38 12345               0000000033
BSD0201                     1J   12   13
BSD0201                     11   12   13
BSD0202                     13   1J   12
BSD0202                     13   11   12
BSD0202                     13   11   12
BSD0203                     12   13   1J
BSD0203                     12   13   11
BSD0203                     12   13   11
BSD0203                     12   13   11
BSB03BB32 13579         6       246MINUS                        TOTAL BALANCING
BSD0301                         123
BSD0301                         123
BSD0301                         123
BSD0301                         123NEG
BSD0301                         246
BSD0302                                   246
BSB02BC34 56789                      4A
BSD0201                     4A
BSB025678 ABCDE                       4J
BSD0201                    4J1
BSD0201                    4 J
BSD0201                     41
BSD0201                    41
BSB04AB41  2345   6   41
BSD04L1             ABCDE FGHI
BSD04L1             ABCDE 1234
BSD04L2             ABCDEF12 3
BSD04L2             AB/CD1 234
BSD04L3             AB/CD1 234
BSD04L3             AB 12 /  *
BSD04L3             /,._:;^%@$
BSD04L3             +-*
BSD04L4              A     B
BSD04L4 *            A     B
BSD04L4
BSD04L4 *
BSD04L5              AAA
BSD04L5
BSD04L7                      *  1 2*
BSD04L7                      *1   2*
BSD04L8                      *  1 2*
BSD04L8                      *1 2  *
BSD04L8NUMERIC               *123  *
BSD04L8NUMERIC               *1 3  *
BSD04NN                       12345
BSD04NN                       1234A
BSD04NN                        1234
BSD04NS                       12 34
BSD04NS                       12345
BSD04NS                       1234A
BSD04NS                        1234
BSD04NS                        123A
BSD04NS
BSD04NS                        1 23
BSD04NS                        1 2A
BSD04NS                        12A3
BSD04NZ                        1234
BSD04NZ                        123A
BSD04NZ
BSD04NB                         123
BSD04NB                         12A
BSD04NB
BSD04US                        1234
BSD04US                        123A
BSD04US
BSD04UZ                         123
BSD04UZ                         12A
BSD04UZ
BSD04UB                         123
BSD04UB                         12A
BSD04UB
 BSB01A C5 62351     28                  3321 8667
  BSD04 BATCH SHOULD BE BALANCED & ACCEPTED
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
 BSD02                     123  321
BSB03CD F 37 2P         6       246
BSD0301                         123NEG
BSB03CD F 37 2P         6       246
BSD0301                         123NEG
BSD0301                         123NEG
BSD0301                         123NEG
BSB03CD F 37 2Q         6       246MINUS
BSD0301                         123NEG
BSD0301                         123NEG
//STEP03       EXEC BUILD,DSN='&&SUSPIN'
//*
//*      CONSTRUCT INPUT SUSPENSE FILE
//*
//SYSUT1       DD   *
 BSB01A B6 78910                       ON SUSPENSE FILE ALREDY
 BSD01                                 ON SUSPENSE FILE ALREDY
 BSD01                                 ON SUSPENSE FILE ALREDY
 BSD01                                 ON SUSPENSE FILE ALREDY
BSB02AA46 01264                        ON SUSPENSE FILE ALREDY
BSD0201                                ON SUSPENSE FILE ALREDY
BSD0201                                ON SUSPENSE FILE ALREDY
BSD0201                                ON SUSPENSE FILE ALREDY
BSD0201                                ON SUSPENSE FILE ALREDY
BSB03AA46 01266                        ON SUSPENSE FILE ALREDY
BSD0301                                ON SUSPENSE FILE ALREDY
BSD0301                                ON SUSPENSE FILE ALREDY
BSD0301                                ON SUSPENSE FILE ALREDY
BSD0301                                ON SUSPENSE FILE ALREDY
BSD0301                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
BSD0302                                ON SUSPENSE FILE ALREDY
//STEP04       EXEC BUILD,DSN='&&LOGIN'
//*
//*      CONSTRUCT INPUT BATCH LOG
//*
//SYSUT1       DD   *
AA A512345
SA B678910
AAA4576543
SAA4601264
PAA4601265       75117     27 APR 75
SAA4601266
AAA46234567
A5678ABCDEF
//STEP05       EXEC PGM=COPY
//*
//*      CREATE EMPTY OUTPUT DATA SETS
//*
//SYSPRINT     DD   DUMMY
//SYSUT2       DD   DSN=&&BATCHOUT,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSUT3       DD   DSN=&&SUSPOUT,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSUT4       DD   DSN=&&DELETED,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSUT5       DD   DSN=&&LOGOUT,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//STEP06       EXEC PGM=BUDGIE1
//*
//*      SORT INPUT BATCHES
//*
//STEPLIB      DD   DSN=TESTLIB,DISP=SHR
//SYSPRINT     DD   SYSOUT=A
//SYSUDUMP     DD   SYSOUT=A
//SYSLIST      DD   SYSOUT=A
//SYSUT1       DD   DSN=&&INBATCH,DISP=(OLD,DELETE)
//SYSUT2       DD   DSN=&&BATCHIN,DISP=(,PASS),UNIT=SYSDA,
//             SPACE=(TRK,(20,10),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1680)
//SYSIN        DD   DSN=&&CONTROL,DISP=(OLD,PASS)
//SORTLIB      DD   DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01     DD   UNIT=SYSDA,SPACE=(CYL,5,,CONTIG)
//SORTWK02     DD   UNIT=SYSDA,SPACE=(CYL,5,,CONTIG)
//SORTWK03     DD   UNIT=SYSDA,SPACE=(CYL,5,,CONTIG)
