//STEP99       EXEC RELEASE,JOB=DAMBDG03
//DAMBDG03 JOB (6000,5),'ALTER NUMERIC TEST',CLASS=N,
//             TYPRUN=HOLD
//*ROUTE  PRINT REMOTE14
-INC BUDGID01                                                                  %
//STEP07       EXEC BUDGIE3,PARM.STEP01='UL= ,NT=NB',
//             COND.STEP02=(0,LE),
//             COND.STEP03=(0,LE),
//             COND.STEP04=(0,LE),
//             COND.STEP05=(0,LE)
