//SBGOLOBA  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//TSOBATCH EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
  RECEIVE INDS('MON.BUDGIE.MACLIB.XMI')
           DSN('MON.BUDGIE.MACLIB'                    VOL(WORK93)
  RECEIVE INDS('MON.COMET.CONTRLIB.XMI')
           DSN('MON.COMET.CONTRLIB'                   VOL(WORK93)
  RECEIVE INDS('MON.COMET.PROCS.XMI')
           DSN('MON.COMET.PROCS'                      VOL(WORK93)
  RECEIVE INDS('MON.JEA.LIBRARYN.XMI')
           DSN('MON.JEA.LIBRARYN'                     VOL(WORK93)
  RECEIVE INDS('MON.JEA.MACLIB.XMI')
           DSN('MON.JEA.MACLIB'                       VOL(WORK93)
  RECEIVE INDS('MON.LIB.BIRDCAGE.XMI')
           DSN('MON.LIB.BIRDCAGE'                     VOL(WORK93)
  RECEIVE INDS('MON.LIB.DOCUMENT.XMI')
           DSN('MON.LIB.DOCUMENT'                     VOL(WORK93)
  RECEIVE INDS('MON.LIB.MVS.XMI')
           DSN('MON.LIB.MVS'                          VOL(WORK93)
  RECEIVE INDS('MON.LIB.MVSDOC.XMI')
           DSN('MON.LIB.MVSDOC'                       VOL(WORK93)
  RECEIVE INDS('MON.LIB.SYSGEN.XMI')
           DSN('MON.LIB.SYSGEN'                       VOL(WORK93)
  RECEIVE INDS('MON.LIB.UTILITYS.XMI')
           DSN('MON.LIB.UTILITYS'                     VOL(WORK93)
  RECEIVE INDS('MON.PARROT.MACLIB.XMI')
           DSN('MON.PARROT.MACLIB'                    VOL(WORK93)
  RECEIVE INDS('MON.SPF.MSGS.XMI')
           DSN('MON.SPF.MSGS'                         VOL(WORK93)
  RECEIVE INDS('MON.SPF2.MENUS.XMI')
           DSN('MON.SPF2.MENUS'                       VOL(WORK93)
  RECEIVE INDS('MON.SYS2.MACLIB.XMI')
           DSN('MON.SYS2.MACLIB'                      VOL(WORK93)
