         MACRO -- $AMVT -- AUXILIARY MONSANTO VECTOR TABLE
         $AMVT  &DOC=NO
         AIF   ('&DOC' NE 'YES').NODOC
         SPACE 1
*        THE PURPOSE OF THIS MACRO IS TO GENERATE THE DSECTS FOR
*         THE AUXILIARY MONSANTO VECTOR TABLE AND ITS PREFIX.
         SPACE 1
*        THE ADDRESS OF THIS CONTROL BLOCK MAY BE FOUND IN THE FIELD
*         MVTAMVT ( IN THE MVT PREFIX ).
         SPACE 1
*        PHYSICALLY, IT IS THE SECOND OF THE CONTIGUOUS CONTROL BLOCKS
*         CREATED BY IEAVNPMC, IMMEDIATELY PRECEDING THE COMMON AREA.
*         IN COMMON WITH THE OTHER ACCOUNTING CONTROL BLOCKS, THE LENGT
*         OF THE AMVT + PREFIX MUST BE A DOUBLEWORD MULTIPLE.
         SPACE 1
*        THIS CONTROL BLOCK IS CREATED AND INITIALISED BY IEAVNPMC,
*         THE EXTENSION TO NIP PROCESSING THAT BUILDS THE ACCOUNTING
*         CONTROL BLOCKS.
         SPACE 1
*        THIS CONTROL BLOCK IS NOT AN ACCOUNTING ROUTINE CONTROL BLOCK,
*         BUT IS A GENERAL PURPOSE VECTOR TABLE FOR OUR VARIOUS MVS
*         MODIFICATIONS AND ENHANCEMENTS.
         SPACE 1
.NODOC   ANOP
AMVTPREF DSECT
         DS    F                   UNUSED
AMVTPRID DS    CL4'AMVT'           AUXILIARY VECTOR TABLE IDENTIFIER
AMVTPEND DS    0D                  ENSURE ALIGNMENT
AMVTPLEN EQU   *-AMVTPREF          LENGTH OF MVT PREFIX
         SPACE 1
AMVTDSCT DSECT
*
*        THIS CONTROL BLOCK IS POINTED TO BY 'MVTAMVT' ( WHICH IS IN
*         THE MVT PREFIX ).
*
AMVTFLG1 DS    CL1                 FLAG BYTE
AMVTFLG2 DS    CL1                 SECOND FLAG BYTE
         DS    H                   UNUSED
         DS    10F                 RESERVED FOR FUTURE USE
AMVTEND  DS    0D                  ENSURE ALIGNMENT
AMVTLGTH EQU   *-AMVTDSCT          LENGTH OF AUXILIARY VECTOR TABLE
         MEND
