         MACRO -- $MASA -- ADDRESS SPACE ACCOUNTING SERVICE AREA
         $MASA  &DOC=NO
         AIF   ('&DOC' NE 'YES').NODOC
         SPACE 1
*        THIS MACRO MAPS THE ACCOUNTING SERVICE AREA.  ROUTINE IEAVNPMC
*         CREATES ONE ASA FOR EVERY POSSIBLE ADDRESS SPACE, AND PLACES
*         THEIR ADDRESSES IN THE MONSANTO VECTOR TABLE.  THE ASA'S ARE
*         USED BY THE VARIOUS COMPONENTS OF THE ACCOUNTING ROUTINE TO
*         PRESERVE AND ACCUMULATE DATA PERTAINING TO THE STEP AND JOB.
         SPACE 1
*        NOTE THAT, IN COMMON WITH THE OTHER CONTROL BLOCKS USED BY
*         THE ACCOUNTING ROUTINES, THE LENGTH OF THE ASA + PREFIX MUST
*         BE A DOUBLEWORD MULTIPLE.
         SPACE 1
.NODOC   ANOP
ASAPREF  DSECT
         DS    F                   UNUSED
ASAPRID  DS    CL4'ASA'            IDENTIFIER FOR SERVICE AREA
ASAPREND DS    0D                  ENSURE ALIGNMENT
ASAPLGTH EQU   *-ASAPREF           LENGTH OF ASA PREFIX
         SPACE 1
ASADSECT DSECT
*
*        THE ADDRESS OF AN ASA MAY BE DERIVED BY MULTIPLYING THE
*         APPROPRIATE ADDRESS SPACE ID BY 4 AND USING THE RESULT TO
*         INDEX INTO THE MVT.  THE RETRIEVED FIELD WILL BE THE ADDRESS
*         OF THE REQUIRED ASA.
*
ASAJNAME DS    CL8                 JOB NAME                           +
ASACLASS DS    C                   JOB CLASS
ASAPRTY  DS    C                   PRIORITY
ASADATE  DS    CL5                 DATE (YYDDD)
ASATIME  DS    CL6                 TIME (HHMMSS)
ASAJOBNO DS    CL3                 JOB NUMBER
ASAFLAGS DS    C                   JOB FLAGS
ASAJCAP  EQU   X'80'               *    JOB CARD PARAMETERS IN ERROR
ASAECAP  EQU   X'40'               *    EXEC CARD PARAMETERS IN ERROR
ASAACREC EQU   X'20'               *    A STEP RECORD HAS BEEN WRITTEN
ASASRATE EQU   X'10'               *    JOB GETS THE SECONDARY RATE
ASACTIVE EQU   X'08'               *    IF ON, THIS ASA IS ACTIVE     +
*        EQU   X'04'               *    UNASSIGNED
*        EQU   X'02'               *    UNASSIGNED
ASAABEND EQU   X'01'               *    ONE OR MORE STEPS HAVE ABENDED
ASASRCPU DS    CL3                 STEP REAL CPU TIME (.01 SECONDS)
         SPACE 2
*                    ACCUMULATED CALCULATED I/O TIME
         SPACE 1
*SAIOBET DS    F                   BETWEEN CHECKS BY TSLIH FOR TIMEOUT+
*SAIOCHG DS    D                   IN THIS STEP (IN TOD CLOCK FORMAT) +
ASASTPIO DS    F                   TOTAL FOR THIS STEP (IN .01 SECONDS)
         EJECT
***********************************************************************
*        DSECT FOR ACCOUNTING SERVICE AREA ( ASA ) - CONT'D           *
***********************************************************************
         SPACE 1
*                        ACCUMULATIVE JOB TOTALS
         SPACE 1
ASACPUTM DS    PL4                 FACTORED CPU TIME (.01 MINUTES)
ASAIOTM  DS    PL4                 FACTORED I/O TIME (.01 MINUTES)
ASACOST  DS    PL4                 COST INCLUDING SURCHARGES (CENTS)
ASASCOST DS    PL4                 SURCHARGES (CENTS)
ASAOCPNY DS    PL4                 OCCUPANCY UNITS (.001 UNITS)
ASAIO    DS    PL4                 I/O UNITS (.001 UNITS)
ASARCPUT DS    PL4                 REAL CPU TIME (.01 MINUTES)
ASAMAXRG DS    PL4                 MAXIMUM CORE USED IN JOB
ASAPDEND EQU   *                   END OF PACKED DECIMAL FIELDS
ASAWORKS EQU   *                   ASA WORK AREA START POINT          +
ASAPINER DS    CL1                 CODE INDICATING ACCTG PARM IN ERROR
ASAPERRF DS    CL1                 FLAG BYTE INDICATING TYPE OF ERROR
         DS    H                   UNUSED
ASADWORD DS    D                   DOUBLEWORD WORK AREA.
ASAWORKE EQU   *                   END OF ASA WORK AREA               +
ASADDTAB EQU   *                   SMF14/15 DDNAME/UCB TABLE          +
ASADDNEU DS    C                   COUNTER OF NO OF TABLE ENTRIES USED+
ASADDNTA DS    CL3                 NEXT TABLE ADDRESS (CHAIN)         +
ASADDENT DS    10CL15         THIS RESERVE 10 TABLE ENTRIES. FORMAT :-+
ASADDNAM EQU   0   LENGTH IS 8     DDNAME (1ST PART OF THE KEY)       +
ASADDJFC EQU   8   LENGTH IS 3     TTR OF JFCB (2ND PART OF THE KEY). +
ASADDEXP EQU   11  LENGTH IS 4     EXCP COUNT OF PRECEDING SMF14/15 - +
*                                   TO BE SUBTRACTED FROM EXCP-COUNT  +
*                                   OF NEXT SMF14/15 WITH SAME DDNAME,+
*                                   AND JFCB ADDRESS OF CURRENT JOB/ST+
ASADDEND EQU   *                   END OF DDNAME/UCB TABLE            +
ASADDTBL EQU   *-ASADDTAB          LENGTH OF DDNAME/UCB TABLE         +
ASAEND   DS    0D                  END OF ACCOUNTING SERVICE AREA
ASALGTH  EQU   *-ASADSECT          LENGTH OF ASA DSECT
         EJECT
***********************************************************************
*        DSECT FOR ACCOUNTING SERVICE AREA ( ASA ) - CONT'D           *
***********************************************************************
         SPACE 1
*        EQUATES FOR ASAPINER ( IDENTIFYING ACCTG PARM IN ERROR )
         SPACE 1
ASACHRGC EQU   1                   ( 1ST PARAMETER ): CHARGE CODE
ASACATCD EQU   2                   ( 2ND PARAMETER ): CATEGORY CODE
ASAMAJCC EQU   3                   ( 3RD PARAMETER ): MAJOR COST CENTRE
ASAMINCC EQU   4                   ( 4TH PARAMETER ): MINOR COST CENTRE
ASAENTCD EQU   5                   ( 5TH PARAMETER ): ENTITY CODE
ASAFORMS EQU   6                   ( 6TH PARAMETER ): FORMS TYPE
ASACOPYS EQU   7                   ( 7TH PARAMETER ): NUMBER OF COPIES
ASAECPU  EQU   8                   ( 8TH PARAMETER ): ESTIMATED CPU TIM
ASALINES EQU   9                   ( 9TH PARAMETER ): ESTIMATED LINES
ASACARDS EQU   10                  (10TH PARAMETER ): ESTIMATED CARDS
ASALOG   EQU   11                  (11TH PARAMETER ): JOB LOG REQUEST
ASALNCNT EQU   12                  (12TH PARAMETER ): LINECOUNT/PAGE
         SPACE 1
*        NOTE:-
*         1. THESE EQUATES DO NOT REPRESENT BIT FLAGS, BUT ARE INSTEAD
*            INDICES INTO A TABLE OF FIELD NAMES IN IEFACTRT.
*         2. MODIFICATION OF THESE EQUATES IMPLIES A CHANGE TO IEFUJI
*            TO EXAMINE THE RELEVANT ACCOUNTING FIELD, AND A CHANGE
*            TO THE TABLE IN IEFACTRT TO REPORT UPON ANY ERRORS THEREIN
         SPACE 5
*        EQUATES FOR ASAPERRF ( FLAG INDICATING TYPE OF ACCTG ERROR )
         SPACE 1
ASAINVCC EQU   1                   CHARGE CODE NOT ON TABLE
ASAINVLN EQU   2                   PARAMETER HAS ILLEGAL LENGTH
ASAMMAND EQU   3                   MANDATORY PARAMETER OMITTED
ASANNUM  EQU   4                   PARAMETER NOT NUMERIC
ASA2MANY EQU   5                   TOO MANY PARAMETERS SUPPLIED
ASACLASP EQU   6                   UNAUTHORISED USE OF CLASS=P
         SPACE 1
*        NOTE:
*         1. THESE EQUATES DO NOT REPRESENT BIT FLAGS, BUT ARE INSTEAD
*            INDICES INTO A TABLE OF ERROR REASONS IN IEFACTRT.
*         2. MODIFICATION OF THESE EQUATES IMPLIES A CHANGE TO IEFUJI
*            TO PERFORM THE REQUISITE VALIDATION, AND TO THE TABLE IN
*            IEFACTRT TO REPORT THE FAULT IF IT IS ENCOUNTERED.
         SPACE 1
         MEND
