         MACRO -- $MVT -- MONSANTO VECTOR TABLE
         $MVT  &DOC=NO
         AIF   ('&DOC' NE 'YES').NODOC
         SPACE 1
*        THE PURPOSE OF THIS MACRO IS TO GENERATE THE DSECTS FOR
*         THE MONSANTO VECTOR TABLE AND ITS PREFIX.  THIS VECTOR TABLE
*         CONTAINS THE ADDRESSES OF THE COMMON AREA AND ALL THE ASA'S,
*         AND IS PURELY AN ACCOUNTING ROUTINE CONTROL BLOCK.  IN
*         COMMON WITH THE OTHER MONSANTO CONTROL BLOCKS, THE MVT IS
*         IMMEDIATELY PRECEDED BY A PREFIX, AND THIS PREFIX CONTAINS
*         THE ADDRESSES OF OTHER FUNDAMENTAL CONTROL BLOCKS.
*        THIS CONTROL BLOCK IS CREATED AND INITIALISED BY IEAVNPMC,
*         THE EXTENSION TO NIP PROCESSING THAT BUILDS THE ACCOUNTING
*         CONTROL BLOCKS.
         SPACE 1
*        PHYSICALLY, IT IS THE FIRST OF THE CONTIGUOUS CONTROL BLOCKS
*         CREATED BY IEAVNPMC, IMMEDIATELY PRECEDING THE AUXILIARY
*         MONSANTO VECTOR TABLE ( WHICH IS NOT AN ACCOUNTING ROUTINE
*         CONTROL BLOCK, BUT A GENERAL PURPOSE VECTOR TABLE ).
*        IN COMMON WITH THE OTHER ACCOUNTING CONTROL BLOCKS, THE LENGT
*         OF THE MVT + PREFIX MUST BE A DOUBLEWORD MULTIPLE.
         SPACE 1
.NODOC   ANOP
MVTPREF  DSECT
         DS    3F                  UNUSED
MVTMMVT  DS    F                   ADDRESS OF MONITOR VECTOR TABLE
MVTAMVT  DS    F                   ADDRESS OF AUXILIARY VECTOR TABLE
MVTAHCT  DS    F                   ADDRESS OF AHCT ( HASP EXTENSION )
         DS    F                   UNUSED
MVTPRID  DS    CL4'MVT'            VECTOR TABLE IDENTIFIER
MVTEND   DS    0D                  ENSURE ALIGNMENT
MVTPLGTH EQU   *-MVTPREF           LENGTH OF MVT PREFIX
         SPACE 1
MVTDSECT DSECT
*
*        THIS CONTROL BLOCK IS POINTED TO BY 'CVTUSER'
*
MVTFLAG1 DS    0CL1                FLAG BYTE
MVTMCA   DS    F                   ADDRESS OF COMMON AREA
MVTFLAG2 DS    0CL1                FLAG BYTE OF ERROR FLAGS
MVTASAS  DS    0F                  VARIABLE LENGTH SEGMENT CONTAINING
*                                   THE ADDRESSES OF ALL THE ASA'S
*                                   ( ONE FOR EVERY POSSIBLE ADDRESS
*                                   SPACE ).
MVT1ASA  DS    F                   ADDRESS OF 1ST ACCOUNTING SERVICE AR
         SPACE 1
*        NOTE THAT THE FORMAT OF THIS CONTROL BLOCK MAY NOT BE ALTERED
*         WITHOUT RE-WRITING MOST OF THE ACCOUNTING ROUTINES, BECAUSE
*         THE ADDRESS SPACE ID IS USED TO INDEX INTO THE MVT TO RETRIEV
*         THE ADDRESS OF THE APPROPRIATE ASA.  THUS, MVTMCA MUST BE THE
*         FIRST WORD IN THE MVT, AND IT MUST BE FOLLOWED BY THE STRING
*         OF ASA ADDRESSES.  IT IS BECAUSE OF THE INFLEXIBILITY OF THIS
*         CONTROL BLOCK THAT THE MVT PREFIX AND THE AMVT EXIST.
         EJECT
***********************************************************************
*        DSECT FOR MONSANTO VECTOR TABLE ( MVT ) - CONT'D             *
***********************************************************************
         SPACE 1
*        EQUATES FOR MVTFLAG1
         SPACE 1
MVTFDUMP EQU   1                   IF ON AND ANY ACCT RTN FINDS AN
*                                   ERROR, DUMP ( LIKE ST.LOUIS DO). IF
*                                   NOT ON, ISSUE MESSAGE AND CONTINUE.
*                                   THIS FLAG IS SET BY IEAVNPMC.
MVTFTEXT EQU   2                   RUN-TIME CONCEPT IS TO BE USED.
MVTFCOST EQU   4                   STEP/JOB COSTS TO BE PRINTED IN
*                                  ACCOUNTING BOXES.
MVTFVCC  EQU   8                   VALIDATE CHARGE CODES VIA 'CHRGCTAB'
MVTFOLDA EQU   16                  IF ON, USE OLD ALGORITHMS IN IEFACTR
         SPACE 5
*        EQUATES FOR MVTFLAG2
         SPACE 1
MVTFSVCE EQU   16                  SVC 254 ENCOUNTERED ERROR
MVTFUJIE EQU   32                  IEFUJI/IEFUSI ENCOUNTERED ERROR
MVTFVM   EQU   64                  SYSTEM IS RUNNING UNDER VM/370
MVTIPLDT EQU   128                 'ON' IF IPL DATE HAS BEEN VERIFIED +
         MEND
