         MACRO
&LABEL   INVOKE &NAME
.*
.*             THIS MACRO PASSES CONTROL TO A LOWER LEVEL SEGMENT
.*             OF CODE REPRESENTED BY &NAME. A VCON IS CREATED
.*             FOR &NAME AND IF IT IS NOT RESOLVED THEN THE
.*             BRANCH TO THE NAME IS NOT TAKEN. THE VCON CAN BE
.*             RESOLVED AT A LATER STAGE USING  TSPIPT10.
.*
         AIF   ('&NAME' NE '').CONTINU
         MNOTE 8,'AN OPERAND MUST BE SPECIFIED WITH THIS MACRO'
         MEXIT
.CONTINU ANOP
         CNOP  0,4
&LABEL   ST    11,*+8
         B     *+12
IHB&SYSNDX DC    A(0)
         DC    V(&NAME)
         L     14,*-4
         XR    15,15
         BALR  11,14
         L     11,IHB&SYSNDX
         MEND
