         MACRO
         ORDERDS
ORDERDS  DSECT
ORDERREC DS    0CL80
ORDERCTL DS    CL1
ORDERNO  DS    CL5
ORDERDES DS    CL40
ORDERREO DS    CL4
ORDERVAL DS    CL10
         DS    CL20
         MEND
