         MACRO
&NAME    SSAVE &REG,&AREA,&NAM
         LCLA  &A
         LCLA  &B
         LCLA  &C
         LCLA  &D
         LCLA  &E
         AIF   ('&NAM' EQ '').NONAM
&A       SETA  K'&NAM
         AIF   (&A GT 8).EXIT
&B       SETA  &A/2
&C       SETA  &B+&B
&D       SETA  &A+5
&E       SETA  &A+6
         AIF   (&A EQ &C).EVEN
         DS    0H
         USING *,15
&NAME    B     &D.(0,15)
         DC    CL&A'&NAM'
         STM   14,&REG,12(13)
         AGO   .NNAM
.EXIT    MNOTE 12,'THIRD PARAM GREATER THAN EIGHT CHARACTERS'
         MEXIT
.EVEN    ANOP
         DS    0H
         USING *,15
&NAME    B     &E.(0,15)
         DC    AL1(&A)
         DC    CL&A'&NAM'
         DC    X'00'
         STM   14,&REG,12(13)
         AGO   .NNAM
.NONAM   ANOP
         DS    0H
         USING *,15
&NAME    STM   14,&REG,12(13)
.NNAM    ANOP
         ST    13,&AREA+4
         LA    14,&AREA
         ST    14,8(0,13)
         LR    13,14
         DROP  15
         MEND
