         MACRO
         STAFF &COLS=76,&WIDTH=5
         GBLA  &STFSPC,&STFWDTH
         GBLC  &STAFF(20)
         LCLA  &INDX,&WORK
&STFSPC  SETA  &COLS
&STFWDTH SETA  &WIDTH
.LOOP    ANOP
&INDX    SETA  &INDX+1
&STAFF(&INDX) SETC '&SYSLIST(&INDX)'
         DC    CL&WIDTH'&STAFF(&INDX)'
         AIF   (&INDX LT N'&SYSLIST).LOOP
&WORK    SETA  &COLS-&INDX*&WIDTH
         DC    CL&WORK' '
         DC    C' '
         DC    132C'-'
         MEND
