         MACRO                                                          MACA0130
        $ADCT &DOC=NO                                                   MACA0140
         TITLE 'AUXILIARY DEVICE CONTROL TABLE ( ADCT ) DSECT'          MACA0150
*********************************************************************** MACA0160
*        AUXILIARY DEVICE CONTROL TABLE ( ADCT ) DSECT                * MACA0170
*********************************************************************** MACA0180
         SPACE 1                                                        MACA0190
         AIF   ('&DOC' NE 'YES').NODOC                                  MACA0200
*        THE PURPOSE OF THIS MACRO IS TO GENERATE THE ADCT DSECT        MACA0210
         SPACE 1                                                        MACA0220
*        THE CORRECT FORM IS :-                                         MACA0230
*        $ADCT <DOC=NO | YES>      PRODUCE DOCUMENTATION ( DEFAULT NO ) MACA0240
         SPACE 1                                                        MACA0250
*        THE ADCT CONTAINS ADDIIONAL DATA PERTAINING TO EACH REMOTE     MACA0260
*         DEFINED AT INITIALISATION TIME.  THE AUXILIARY INITIALISATION MACA0270
*         PROCESSOR DETERMINES THE LARGEST REMOTE NUMBER DEFINED TO     MACA0280
*         THE SYSTEM, AND GETMAINS A CONTIGUOUS AREA OF CORE SUFFICIENT MACA0290
*         TO HOLD (N+1) ADCTS.  THUS, A TABLE OF ADCTS IS CREATED,      MACA0300
*         AND AN ENTRY MAY BE ACCESSED DIRECTLY BY USING THE REMOTE     MACA0310
*         NUMBER AS AN INDEX.                                           MACA0320
         SPACE 1                                                        MACA0330
*        THE AUXILIARY INITIALISATION PROCESSOR ALSO EXTRACTS FROM THE  MACA0340
*         REMOTES DCTS THE INITIALISATION OPTIONS AND STORES THEM IN    MACA0350
*         THE CORRESPONDING DCT.  THESE OPTIONS ARE THEN REFRESHED      MACA0360
*         PRIOR TO EACH SIGN-ON.                                        MACA0370
         EJECT                                                          MACA0380
*********************************************************************** MACA0390
*        DOCUMENTED AUXILIARY DEVICE CONTROL TABLE ( ADCT ) DSECT     * MACA0400
*********************************************************************** MACA0410
         SPACE 1                                                        MACA0420
.NODOC   ANOP                                                           MACA0430
ADCTDSCT DSECT                     AUXILIARY DEVICE CONTROL TABLE       MACA0440
ADCTRID  DS    CL4                 REMOTE IDENTIFIER ( RNNN )           MACA0450
ADCTRERC DS    F                   LINE LIMIT BEFORE JOB REROUTED       MACA0460
ADCTRERD DS    CL1                 ROUTING CODE FOR REROUTED JOBS       MACA0470
ADCTFLG1 DS    CL1                 FLAG BYTE                            MACA0480
ADCTFLG2 DS    CL1                 SECOND FLAG BYTE                     MACA0490
ADCTINIT DS    CL1                 INITIALISATION OPTIONS FROM RMTS DCT MACA0500
ADCTCLSS DS    36XL1               JOB CLASS EXCEPTION LIST             MACA0510
ADCTLGTH EQU   *-ADCTDSCT          LENGTH OF DSCET                      MACA0520
&SYSECT  CSECT                                                          MACA0530
         SPACE 5                                                        MACA0540
*********************************************************************** MACA0550
*        JOB CLASS EXCEPTION FLAG VALUES                              * MACA0560
*********************************************************************** MACA0570
         SPACE 2                                                        MACA0580
ADCTJNIH EQU   X'01'               DO NOT HOLD JOB ON INPUT             MACA0590
ADCTJNOH EQU   X'02'               DO NOT HOLD JOB ON OUTPUT            MACA0600
ADCTJVNR EQU   X'04'               DO NOT MAKE JOB RUN V=R              MACA0610
         SPACE 5                                                        MACA0620
*        ADCTFLG1 FLAGS                                                 MACA0630
         SPACE 1                                                        MACA0640
ADC1RERO EQU   1                   REROUTE JOB IF OUTPUT EXCEEDS LIMIT  MACA0650
ADC1ALLC EQU   2                   REMOTE MAY SUBMIT ALL COMMANDS       MACA0660
ADC1NHLD EQU   4                   'NOHOLD' CLASS LIST WAS SUPPLIED     MACA0670
ADC1CLSO EQU   8                   REMOTE MAY SUBMIT CLASS O JOBS       MACA0680
ADC1PNHD EQU   16                  OUTPUT WILL NOT BE HELD              MACA0690
         SPACE 5                                                        MACA0700
*        ADCTFLG2 FLAGS                                                 MACA0710
         SPACE 1                                                        MACA0720
         SPACE 5                                                        MACA0730
*        ADCTINIT FLAGS                                                 MACA0740
         SPACE 1                                                        MACA0750
ADCIDPRT EQU   1                   DON'T DRAIN PRINTER ON SIGN-ON       MACA0760
ADCIHRDR EQU   2                   DON'T HOLD READER ON SIGN-ON         MACA0770
ADCDNMSG EQU   4                   $DN,Q=PPU IS NOT REQUIRED AT SIGN-ON MACA0780
ADCID100 EQU   8                   DON'T APPLY DATA/100 70 COMPRESSION  MACA0781
*                                   IF TERMINAL TYPE IS 2780            MACA0782
         MEND                                                           MACA0790
