         MACRO                                                          MADH0130
&NAME   $CTCHPCE  &ID,&DOC=NO                                           MADH0140
         GBLC  &SRVRTN                                                  MADH0150
         LCLC  &R,&T,&NAME1                                             MADH0160
         LCLA  &N                                                       MADH0170
         AIF   ('&DOC' NE 'YES').NODOC                                  MADH0180
         SPACE 1                                                        MADH0190
*        CORRECT FORM IS :-                                             MADH0200
*        $CTCHPCE <STACK | (REG)>  ADDRESS OF THE STACK TO 'CATCH'      MADH0210
*              <DOC=NO | YES>      REQUEST FOR DOCUMENTATION            MADH0220
         SPACE 1                                                        MADH0230
*        THE PURPOSE OF THIS MACRO IS TO 'CATCH' THE SECONDARY APCE'S   MADH0240
*         CHAINED TO THE SPECIFIED STACK ( IN THE AHCT ).  THE MACRO    MADH0250
*         INVOKES THE SERVICE ROUTINE 'CATCHPCE', WHICH REMOVES THE     MADH0260
*         APCE'S FROM THE SPECIFIED STACK, AND CHAINS THEM FROM         MADH0270
*         'APCESNXT' IN PUSHDOWN MODE.  UPON RETURN, R1 CONTAINS THE    MADH0280
*         NUMBER OF SECONDARY APCE'S 'CAUGHT'.                          MADH0290
         SPACE 1                                                        MADH0300
*        SEE THE MACRO $PASAPCE FOR MORE INFORMATION REGARDING THE      MADH0310
*         PURPOSE OF PASSING / CTCHCHING APCE'S.                        MADH0320
         SPACE 1                                                        MADH0330
.NODOC   ANOP                                                           MADH0340
&NAME1   SETC  '&NAME'                                                  MADH0350
&N       SETA  N'&ID                                                    MADH0360
         AIF   (&N EQ 1).NOK                                            MADH0370
         MNOTE 8,'INCORRECT PARAMETER LIST: TOO MANY OPERANDS'          MADH0380
         MEXIT                                                          MADH0390
.NOK     AIF   ('&ID'(1,1) EQ '(').REG                                  MADH0400
&NAME1   LA    R1,&ID              POINT R1 AT STACK TO CATCH           MADH0410
         AGO   .SERV                                                    MADH0420
.REG     ANOP                                                           MADH0430
&R       SETC  '&ID(1)'                                                 MADH0440
&NAME1   LA    R1,0(,&R)           POINT R1 AT STACK TO CATCH           MADH0450
.SERV    ANOP                                                           MADH0460
&NAME1   SETC  ' '                                                      MADH0470
         AIF   ('&SRVRTN' EQ 'YES').SRVYES                              MADH0480
      $SRVSAVE SAVE=LINK           PRESERVE LINK REGISTER               MADH0490
         AGO   .ASKALL                                                  MADH0500
.SRVYES $SRVSAVE SAVE=(LINK,BASE3) PRESERVE BASE3 AND LINK ADDRESS      MADH0510
.ASKALL  ANOP                                                           MADH0520
         L     R9,HCT$AHCT         GET AHCT ADDRESS                     MADH0530
         LA    R9,(CTCHPCE*MRCBSIZE)+MRCBSTRT(,R9) GET ROUTINE MRCB     MADH0540
         L     BASE3,MRCBRADR-MRCBDSCT(,R9) GET ROUTINE ENTRY POINT     MADH0550
         BALR  LINK,BASE3          PERFORM SERVICE ROUTINE 'CTCHPCE'    MADH0560
     $SRVREST ,                    RESTORE PRESERVED REGISTERS          MADH0570
         MEND                                                           MADH0580
