         MACRO                                                          MACU0130
&NAME    $DATE &DOC=NO                                                  MACU0140
         LCLC  &DATE                                                    MACU0150
         LCLC  &TIME                                                    MACU0160
         AIF   ('&DOC' NE 'YES').NODOC                                  MACU0170
         SPACE 1                                                        MACU0180
*        THE CORRECT FORM IS :-                                         MACU0190
* NAME   $DATE <DOC=YES>                                                MACU0200
*                                                                       MACU0210
*              WHERE               <DOC=YES/NO> SPECIFIES WHETHER       MACU0220
*                                  THIS EXPLANATORY TEXT IS REQUIRED.   MACU0230
*                                  DEFAULT IS NO.                       MACU0240
*                                                                       MACU0250
*        THE PURPOSE OF THIS MACRO IS TO ASSEMBLE TWO FIELDS            MACU0260
*        OF CONSTANTS CONTAINING THE DATE AND TIME OF ASSEMBLY          MACU0270
*        TO ASSIST IN DOCUMENTATION AND DEBUGGING.                      MACU0280
*        NOTE THAT THIS MACRO WILL ONLY WORK WITH ASSEMBLER 'G' OR 'H'  MACU0290
         SPACE 1                                                        MACU0300
.NODOC   ANOP                                                           MACU0310
&DATE    SETC  '&SYSDATE'                                               MACU0320
&TIME    SETC  '&SYSTIME'                                               MACU0330
         B     *+4+8+8             BRANCH ROUND ASSEMBLY DATE AND TIME  MACU0340
         DC    CL8'&DATE'          DATE OF ASSEMBLY                     MACU0350
         DC    CL8'&TIME'          TIME OF ASSEMBLY                     MACU0360
         MEND                                                           MACU0370
