//$MAEQU JOB (5806,5),'** FOR J. NOLS **',CLASS=N
//LIBRA EXEC LIBRARYN,FILE=MVS,BLKSIZE=12960
//OSJOB DD DSN=SYS2.MACLIB,DISP=SHR,SPACE=(TRK,(95,19,15))
//SYSIN DD *
-OPT
-SEL $MAEQU,MEQU,EXEC(R),LIST,VERS=1013 VERS=1013
-REP ALL
         MACRO -- $MAEQU -- EQUATES FOR SYSTEM CONTROL BLOCKS
         $MAEQU
         SPACE 1
***********************************************************************
*        EQUATES FOR SYSTEM CONTROL BLOCKS USED IN MONSANTO           *
*         ACCOUNTING MODULES.                                         *
***********************************************************************
         SPACE 1
*             ------ DISPLACEMENTS INTO THE ------
         SPACE 1
*                       -- CVT --
*        CVT   DSECT=YES           GENERATE CVT DSECT
         PRINT OFF
         CVT   DSECT=YES           GENERATE CVT DSECT
         PRINT ON
         SPACE 1
*                       -- ASVT --
*        IHAASVT ,                 GENERATE ASVT DSECT
         PRINT OFF
         IHAASVT ,                 GENERATE ASVT DSECT
         PRINT ON
         SPACE 1
*                       -- ASCB --
*        IHAASCB ,                 GENERATE ASCB DSECT
         PRINT OFF
         IHAASCB ,                 GENERATE ASCB DSECT
         PRINT ON
         SPACE 1
*                       -- JCT --
JCTETIME EQU   208                 ESTIMATED CPU TIME
*                       -- LCT --
LCTJCTAD EQU   16                  ADDRESS OF JCT ( OR ZERO )
LCTSCTAD EQU   20                  SCT ADDRESS
LCTERR   EQU   32                  LCT ERROR FLAGS
LCTPARM1 EQU   36                  MULTI-USE PARAMETER FIELD
LCTPARM2 EQU   40                  MULTI-USE PARAMETER FIELD
LCTTMWRK EQU   80                  TIMER WORK AREA START
LCTTSTL4 EQU   84                  STEP TIME LIMIT
LCTTSTR4 EQU   88                  STEP TIME REMAINING
LCTTSTU4 EQU   92                  STEP TIME USED
LCTTSTU3 EQU   93                  STEP TIME USED
LCTJFAIL EQU   128                 FLAG(LCTERR): JOB FAILED
         SPACE 1
*                       -- PSA --
FLC      EQU   0                   START OF PSA
FLCCVT   EQU   16                  ADDRESS OF CVT
PSATOLD  EQU   540                 TCB OLD POINTER
PSAAOLD  EQU   548                 ASCB OLD POINTER
PSALITA  EQU   764                 ADDRESS OF LOCK INTERFACE TABLE
         SPACE 1
*                       -- WSAVTG --
WSAG     EQU   0                   START OF WSAG
WSAGGMFM EQU   4                   ADDR. OF GETMAIN/FREEMAIN SAVE AREA
         SPACE 1
*                       -- APL -- ACCOUNTING PARAMETER LIST --
*                          JOB INITIATION
APLEPARM EQU   0                   EXIT PARAMETER AREA
APLPGMR4 EQU   4                   PROGRAMMER NAME
*              8                   JOB PRIORITY
APLACCTG EQU   12                  ACCOUNTING PARAMETERS - JOB CARD
*                          STEP INITIATION
*              0                   EXIT PARAMETER AREA
*              4                   STEP NAME
*              8                   PROGRAM NAME
*              12                  ACCOUNTING PARAMETERS - EXEC CARD
*                         FROM 'IEFACTRT'
APLSNAME EQU   4                   JOB STEP NAME
APLPGMR8 EQU   8                   PROGRAMMER NAME
APLJTMAP EQU   12                  JOB CPU TIME AND NO. OF ACCTG.PARMS
APLJAP   EQU   16                  JOB ACCOUNTING PARAMETERS
APLSTMAP EQU   20                  STEP CPU TIME AND NO. OF ACCTG PARMS
APLSAP   EQU   24                  STEP ACCOUNTING PARAMETERS
APLINDSN EQU   28                  AN INDICATOR AND THE STEP NUMBER
APLTERMS EQU   32                  TERMINATION STATUS
APLSMFR  EQU   36                  SMF TERMINATION RECORD
         SPACE 1
*                       -- EXIT PARAMETER AREA --
JMRJNAME EQU   0                   JOB NAME ( EBCDIC )
JMRSTEP  EQU   28                  STEP NUMBER
JMRINDC  EQU   29                  INDICATOR SWITCHES
JMRFIND  EQU   X'01'               *    FOREGROUND JOB/STEP
JMRJCLAS EQU   31                  JOB CLASS
         SPACE 1
*                       -- SCT --
SCTMSSZE EQU   88                  SIZE OF REGION REQUESTED
         SPACE 1
*                       -- PCCAVT --
PCCAT00P EQU   0                   ADDRESS OF PCCA FOR CPU 0
PCCAT01P EQU   4                   ADDRESS OF PCCA FOR CPU 1
         SPACE 1
*                       -- PCCA --
PCCACPID EQU   4                   CPU ID.
         SPACE 1
*                       -- NVT --
NVTWTO   EQU   X'FC'               ADDRESS OF WTO SERVICE ROUTINE
NVTFASVT EQU   504                 POINTER TO ASVT
*                       -- TCB --
TCBTIO   EQU   12                  TIOT ADDRESS
         MEND
-END
/*
