         MACRO -- $MCA -- COMMON AREA
         $MCA  &DOC=NO
         AIF   ('&DOC' NE 'YES').NODOC
         SPACE 1
*        THE PURPOSE OF THIS MACRO IS TO GENERATE THE DSECTS FOR
*         THE ACCOUNTING CONTROL BLOCK 'COMMON AREA', AND ITS
*         ASSOCIATED PREFIX.  THIS COMMON AREA CONTAINS MACHINE-
*         DEPENDENT CONSTANTS USED BY THE ACCOUNTING ROUTINES.
*         IT IS CREATED AND ININIALISED BY THE NIP ROUTINE 'IEAVNPMC'.
         SPACE 1
*        PHYSICALLY, IT IMMEDIATELY FOLLOWS THE AMVT ( AUXILIARY VECTOR
*         TABLE ), AND IMMEDIATELY PRECEDES THE FIRST ASA ( ACCOUNTING
*         SERVICE AREA ).  NOTE THAT, IN COMMON WITH THE OTHER ACCT'G
*         CONTROL BLOCKS, THE LENGHT OF THE COMMON AREA + ITS PREFIX
*         MUST BE A DOUBLEWORD MULTIPLE.
         SPACE 1
.NODOC   ANOP
CAPREFIX DSECT
         DS    F                   UNUSED
CAPRID   DS    CL4'CA'             ID OF COMMON AREA
CAPREND  DS    0D                  ENSURE ALIGNMENT
CAPRLGTH EQU   *-CAPREFIX          LENGTH OF COMMON AREA PREFIX
         SPACE 1
CADSECT  DSECT
*
*        THIS CONTROL BLOCK IS POINTED TO BY 'MVTMCA' ( IN THE MVT ).
*
AWBSTART DS    0C                  ACCOUNTING WORK BLOCKS
AWBJOBNO DS    H                   JOB NUMBER COUNTER
AWBCOSTC DS    CL3                 COST CENTER CODE
*                                  *    120 - 158 (EITHER ONE)
*                                  *    165 - 165
*                                  *    168 - 168
AWBMACH  DS    C                   MACHINE CODE
*                                  *    0 - 158A
*                                  *    1 - 158B
*                                  *    2 - 158MP
*                                  *    3 - 165
*                                  *    4 - 168
         DS    H                   UNUSED
AWBFACTR DS    F                   CPU SPEED FACTORING VALUE
AWBFACHA DS    F                   HALF OF THE ABOVE
AWBDECPT DS    F                   FOR DEALING WITH IMPLIED DECIMAL
*                                  POINTS IN THE FACTORING VALUES
AWBDPTHA DS    F                   HALF OF THE ABOVE
AWBTODC  DS    F                   TOD CLOCK CONVERSION VALUE
AWBEND   DS    0D                  END OF ACCOUNTING WORK BLOCKS
         EJECT
***********************************************************************
*        DSECT FOR MONSANTO COMMON AREA ( MCA ) - CONT'D              *
***********************************************************************
         SPACE 1
CARSIZE  DS    F                   REQUESTED REGION SIZE BELOW WHICH
*                                   CORE USED WILL BE USED TO CALCULATE
*                                   THE OCCUPANCY UNITS.
*                                  IF THE REQUESTED REGION SIZE EXCEEDS
*                                   THIS VALUE THE MAXIMUM OF CORE
*                                   USED | REQUESTED WILL BE USED.
         SPACE 1
AWBFLAG1 DS    CL1                 FLAG BYTE
         DS    CL3                 UNUSED
         DS    2F                  UNUSED
         SPACE 2
CAEND    DS    0D                  END OF COMMON AREA
CALGTH   EQU   *-CADSECT           LENGTH OF COMMON AREA
         SPACE 5
*        EQUATES FOR AWBFLAG1
         SPACE 1
AWB1VM   EQU   1                   MVS IS RUNNING UNDER VM
         MEND
