         MACRO -- $SMFUSER -- SMF USER RECORD DSECTS
&NAME $SMFUSER &RECID,&DSECT=YES,&SMFHDR=YES,&DOC=NO
         AIF   ('&DOC' NE 'YES').NODOC
         SPACE 1
*        THIS MACRO MAPS THE SMF USER RECORDS CREATED BY OUR
*         MODIFICATIONS TH THE MVS SYSTEM.  THE RECORDS MAPPED ARE :-
*              204 - STEP TERMINATION: CREATED BY IEFACTRT
*              205 - JOB  TERMINATION: CREATED BY IEFACTRT
*              234 - TSO STEP TERMINATION: CREATED BY IEFACTRT
*              235 - TSO JOB  TERMINATION: CREATED BY IEFACTRT
         SPACE 1
*        NOTE THAT RECORDS 204, 205. 234, AND 235 ARE IDENTICAL EXCEPT
*         FOR THE RECORD IDENTIFIER.  THESE SMF RECORDS ( I.E. 204,
*         205, 234, AND 235 ) ARE USED TO CREATE THE 'O.S.' ACCOUNTING
*         RECORDS, WHICH ARE IDENTICAL TO THE SMF RECORDS, BUT WITHOUT
*         THE SMF PREAMBLE.  THESE RECORDS MAY BE MAPPED BY SPECIFYING:
*              ACT - OS-ACCOUNTING RECORD
         SPACE 1
*        OPTIONALLY, THE DSECT STATEMENT MAY BE OMITTED, AS MAY
*         THE COMMON SMF PREAMBLE.
         SPACE 1
*        THE FORMAT OF THE MACRO IS :-
*NAME $SMFUSER REC-ID              USER RECORD TO BE MAPPED.
*                                  E.G. 204
*                                       (204,234)
*                                       (ACT,204)
*              DSECT=<YES | NO>    REQUEST FOR DSECT STATEMENT TO BE
*                                  GENERATED.  THE DEFAULT VALUE IS YES
*              SMFHDR=<YES | NO>   REQUEST FOR THE SMF PREAMBLE.
*                                  THE DEFAULT VALUE IS YES.
.NODOC   ANOP
         AIF   ('&DSECT' EQ 'NO').NODSECT
&NAME    DSECT
         AGO   .CONT1
.NODSECT ANOP
&NAME    DS    0CL1
.CONT1   ANOP
         AIF   ('&SMFHDR' EQ 'NO').NOHDR
SMFRECRD DS    0F
SMFLENTH DS    H
         DS    H
SMFPREAM DS    0CL38               SMF PREAMBLE
         DS    C
SMFRECTP DS    C                   RECORD TYPE, I.E. 204, 205, 234, 235
         DS    CL36
.NOHDR   ANOP
         AIF   ('&RECID' EQ 'ACT').ACTREC
         AIF   ('&RECID' EQ '204').ACTREC
         AIF   ('&RECID' EQ '205').ACTREC
         AIF   ('&RECID' EQ '234').ACTREC
         AIF   ('&RECID' EQ '235').ACTREC
         AGO   .UNKNOWN
.ACTREC  ANOP
ACTREC   EQU   *                   START OF ACCOUNTING RECORD
ACTIDD   DS    CL3                 MACHINE IDENTIFIER
ACTJDATE DS    CL5                 DATE THE JOB STARTED (YYDDD)
ACTCHGCD DS    CL4                 PROJECT CHARGE CODE
ACTCATCD DS    CL2                 JOB CATEGORY CODE
ACTMAJCC DS    CL3                 MAJOR COST CENTRE NUMBER
ACTMINCC DS    CL2                 MINOR COST CENTRE
ACTCOMPL DS    BL2                 COMPLETION CODE RETURNED BY STEP
ACTREGN  DS    CL4                 STEP:REGN REQUESTED / JOB:MAX USED
ACTFORMS DS    CL4                 FORMS QUEUE REQUEST FROM JOB CARD
ACTCOPYS DS    CL2                 COPIES REQUEST FROM JOB CARD
ACTJCLAS DS    CL1                 CLASS DURING EXECUTION
ACTENT   DS    CL3                 ENTITY CODE FROM JOB CARD ACCT'G
ACTDAGIN DS    CL5                 BELIEVE IT OR NOT, ACTJDATE AGAIN
         DS    CL6                 TIME THE JOB STARTED (HHMMSS)
         DS    CL3                 JOB NUMBER
ACTSNUM  DS    CL2                 STEP NUMBER
ACTJNAME DS    CL8                 JOB NAME
ACTSNAME DS    CL8                 STEP NAME
ACTJPRIO DS    CL2                 HASP JOB PRIORITY
ACTHJCLS DS    CL1                 HASP JOB CLASS
ACTID2   DS    X'FD'               RECORD IDENTIFIER
ACTPGMNM DS    CL8                 PROGRAM NAME
ACTUSERN DS    CL6                 USERS NAME
ACTDATE  DS    PL3                 DATE THE JOB/STEP STARTED (YYDDF)
ACTSTIME DS    PL4                 TIME THE JOB/STEP STARTED (.XX)
ACTETIME DS    PL4                 TIME THE JOB/STEP ENDED (.XX)
ACTREGNR DS    PL3                 REGION SIZE REQUESTED
ACTREGNU DS    PL3                 PORTION OF THE REGION SIZE USED
ACTRCPUT DS    PL3                 REAL CPU TIME USED (.XX)
ACTMCHUN DS    PL4                 MACHINE UNITS (.XXX)
ACTTCOST DS    PL4                 TOTAL COST INCLUDING SURCHARGES(.XX)
ACTTAPEU DS    PL2                 NUMBER OF TAPE ALLOCATIONS
ACTDISKU DS    PL2                 NUMBER OF DISK ALLOCATIONS
ACTCPUTM DS    PL4                 FACTORED CPU TIME (.XXX)
ACTOCPYU DS    PL4                 OCCUPANCY UNITS (.XXX)
ACTIOU   DS    PL4                 I/O UNITS (.XXX)
ACTFILLA DS    PL4                 UNUSED (USE TO BE CORE UTILIZATION)
*CTFILLB DS    PL4                 UNUSED (USE TO BE I/O UTILIZATION)
ACTRTIME DS    PL4                 TIME THE JOB WAS READ ( .NN MINS )
ACTIOTM  DS    PL3                 FACTORED I/O TIME (.XX)
ACTABEND DS    CL4                 SYSTEM ABEND CODE
ACTSURCH DS    PL4                 COST OF SURCHARGES IF ANY (.XX)
ACTTOTST DS    BL1                 NUMBER OF STEPS IN THE JOB
*CTFILLC DS    CL3                 UNUSED (USE TO BE ADDR. OF REGION)
ACTRDATE DS    PL3                 DATE THE JOB WAS READ ( YYDDDP )
ACTFLAG1 DS    CL1                 FLAG BYTE
*CTFILLD DS    CL7                 UNUSED
ACTFILLD DS    CL3                 UNUSED
ACTMUF1  DS    CL2                 VALUE OF MUFACTR1 ( N.NNN ) - BINARY
ACTMUF2  DS    CL2                 VALUE OF MUFACTR2 ( N.NNN ) - BINARY
ACTEND   DS    0C                  END OF ACCOUNTING RECORD
ACTLGTH  EQU   *-ACTREC            LENGTH OF REC (LESS SMF PREAMBLE)
         SPACE 5
***********************************************************************
*        EQUATES FOR 'ACTFLAG1' STATUS FLAGS                          *
***********************************************************************
         SPACE 1
ACTFJOBF EQU   1                   JOB FAILED: JCL ERROR/OPERATOR CNCL
ACTFVM   EQU   2                   MVS IS RUNNING UNDER VM
ACTFMSG0 EQU   4                   JOB CARD SPECIFIES 'MSGLEVEL=O'
ACTFMUF1 EQU   8                   MUFACTR1 CONVERSION FACTOR APPLIED
ACTFMUF2 EQU   16                  MUFACTR2 CONVERSION FACTOR APPLIED
ACTFJOBA EQU   32                  JOB FAILED: 1 OR MORE STEPS ABENDED
         MEXIT
.UNKNOWN MNOTE 4,'UNKNOWN USER RECORD SPECIFICATION'
         MEND
