         MACRO -- $SRVNTRY -- PROVIDE ENTRY TO MOD SERVICE ROUTINE      MACO0130
&SEG  $SRVNTRY &DOC=NO                                                  MACO0140
         GBLC  &VERSION,&SRVRTN                                         MACO0150
         LCLC  &REGS,&CODE                                              MACO0160
         LCLA  &N,&KSEG                                                 MACO0170
         AIF   ('&DOC' NE 'YES').NODOC                                  MACO0180
         SPACE 1                                                        MACO0190
*        THE CORRECT FORM IS :-                                         MACO0200
*NAME $SRVNTRY <DOC=NO | YES>      PRODUCE DOCUMENTATION ( DEFAULT NO ) MACO0210
         SPACE 1                                                        MACO0220
*        THE PURPOSE OF THIS MACRO IS TO PROVIDE AN ENTRY POINT TO A    MACO0230
*         MODIFICATION SERVICE ROUTINE.  APPROPRIATE USING              MACO0240
*         STATEMENTS ARE GENERATED TO ESTABLISH ADDRESSABILITY FOR THE  MACO0250
*         ROUTINE AND TO THE HCT, AHCT, PCE, AND APCE.  UPON ENTRY,     MACO0260
*         ALL NECESSARY REGISTERS WILL HAVE BEEN INITIALISED BY THE     MACO0270
*         CALLING MODIFICATION ROUTINE.                                 MACO0280
         SPACE 1                                                        MACO0290
*        NOTE THAT THE NAME FIELD IS MANDATORY, AND MUST BE OF THE FORM MACO0300
*              JES2BNNN OR JES2SNNN                                     MACO0310
         SPACE 1                                                        MACO0320
.NODOC   ANOP                                                           MACO0330
&SRVRTN  SETC  'YES'                                                    MACO0340
&N       SETA  16                                                       MACO0350
         AIF   ('&SEG' NE '').A                                         MACO0360
         MNOTE 8,'NAME FIELD MUST BE PROVIDED'                          MACO0370
         MEXIT                                                          MACO0380
.A       AIF   (K'&SEG LT 6 OR K'&SEG GT 8).SEGERR1                     MACO0390
         AIF   ('&SEG'(1,5) EQ 'JES2B').AA                              MACO0400
         AIF   ('&SEG'(1,5) EQ 'JES2S').AA                              MACO0410
         AGO   .SEGERR2                                                 MACO0420
.SEGERR1 MNOTE 8,'NAME FIELD OF INCORRECT LENGTH'                       MACO0430
         MEXIT                                                          MACO0440
.SEGERR2 MNOTE 8,'NAME FIELD MUST BE JES2BNNN OR JES2JNNN'              MACO0450
         MEXIT                                                          MACO0460
.AA      ANOP                                                           MACO0470
&KSEG    SETA  K'&SEG                                                   MACO0480
&KSEG    SETA  &KSEG-4                                                  MACO0490
&CODE    SETC  '&SEG'(5,&KSEG)                                          MACO0500
&SEG     CSECT                     CREATE SERVICE ROUTINE CSECT         MACO0510
         USING &SEG,BASE3          PROVIDE SERVICE ROUTINE ADDR'Y       MACO0520
         USING AHCTDSCT,R6         ESTABLISH AHCT ADDRESSABILITY        MACO0530
         USING APCEDSCT,R7         ESTABLISH APCE ADDRESSABILITY        MACO0540
         USING HCTDSECT,BASE1      ESTABLISH HCT ADDRESSABILITY         MACO0550
         B     *+32                BRANCH AROUND CONSTANTS              MACO0570
         DC    A($MOD&CODE)        GENERATE IDENTIFYING EQUATE          MACO0580
         DC    CL8'&SEG'           EBCDIC NAME OF ROUTINE               MACO0590
         DC    CL8'&SYSDATE'       IDENTIFY DATE OF ASSEMBLY            MACO0600
         DC    CL8'&SYSTIME'       IDENTIFY TIME OF ASSEMBLY            MACO0610
$MODCODE EQU   7                   DISPLACEMENT OF SRV IDENTIFIER       MACO0620
         SPACE 1                                                        MACO0630
         MEND                                                           MACO0640
