//$TSUSER  EXEC PGM=IKJEFT01,DYNAMNBR=25
//SYSPROC  DD DSN=TSG.TSO.CMDPROC,DISP=SHR
//SYSHELP  DD DSN=SYS1.HELP,DISP=SHR
//         DD DSN=TSG.TSO.HELP,DISP=SHR
//SYSPRINT DD TERM=TS,SYSOUT=*
//SYSTERM  DD TERM=TS,SYSOUT=*
//FT06F001 DD TERM=TS,SYSOUT=*
//FT05F001 DD TERM=TS
//SYSIN    DD TERM=TS
