         MACRO                                                          MACF0130
        $VERBDSC &DOC=NO                                                MACF0140
         TITLE 'VERB DESCRIPTOR CONTROL BLOCK DSCECT'                   MACF0150
*********************************************************************** MACF0160
*        VERB DESCRIPTOR CONTROL BLOCK                                * MACF0170
*********************************************************************** MACF0180
         SPACE 1                                                        MACF0190
         AIF   ('&DOC' NE 'YES').NODOC                                  MACF0200
*        THIS MACRO GENERATES THE VERB DESCRIPTOR CONTROL               MACF0210
*        BLOCK DSECT FOR USE IN JES2 INITIALISATION ROUTINES.           MACF0220
         SPACE 1                                                        MACF0230
*        THE CORRECT FORM IS :-                                         MACF0240
*        $VERBDSC <DOC=NO | YES>    PRODUCE DOCUMENTATION (DEFAULT NO)  MACF0250
         SPACE 1                                                        MACF0260
*        THE VERB DESCRIPTOR BLOCK CONTAINS FLAGS OF CO-REQUISITE,      MACF0270
*        AND MUTUALLY EXCLUSIVE VERBS FOR USE IN THE SYNTAX             MACF0280
*        CHECKING ROUTINES OF JES2B001.                                 MACF0290
         SPACE 2                                                        MACF0300
.NODOC   ANOP                                                           MACF0310
VERBDESC DSECT                                                          MACF0320
VERBVERB DS    CL8                 UP TO 1ST 8 CHARACTERS OF KEYWORD    MACF0330
VERBLEN  DS    0CL1                EXECUTABLE LENGTH OF VERB            MACF0340
VERBRTN  DS    F                   ADDRESS OF PROCESSING ROUTINE        MACF0350
VERBCTR  DS    F                   ADDRESS OF KEYWORD COUNTER           MACF0360
VERBFLAG DS    CL4                 FLAG REPRESENTING VERB               MACF0370
VERBEXCL DS    CL4                 FLAGS FOR MUTUALLY EXCLUSIVE VERBS   MACF0380
VERBINCL DS    CL4                 FLAGS FOR MANDATORY VERBS            MACF0390
VERBLGTH EQU   *-VERBDESC          LENGTH OF DSECT                      MACF0400
         EJECT                                                          MACF0410
*********************************************************************** MACF0420
*        VERB EQUATES                                                 * MACF0430
*********************************************************************** MACF0440
         SPACE 1                                                        MACF0450
*        THESE VERB EQUATES APPLY TO THE FLAG BYTES IN THE VERB         MACF0460
*         DESCRIPTOR TABLES ( CCTABLE, DCTTABLE, XITTABLE ), AND TO THE MACF0470
*         FLAG BYTES IN THE RECORD SAVE AREA.  THIS ALLOWS FOR 4        MACF0480
*         DIFFERENT TYPES OF CONTROL CARDS, AND FOR 28 KEYWORDS WITHIN  MACF0490
*         EACH RECORD TYPE.  IF THIS PROVES TO BE INADEQUATE, IT IS     MACF0500
*         MERELY NECESSARY TO ALTER THE LENGTH OF THE FLAG FIELDS IN    MACF0510
*         THE DSECTS RECAREA AND VERBDESC, TO MODIFY THE MACRO 'VERB'   MACF0520
*         TO GENERATE FLAGS IN THE ADDITIONAL BYTES, AND TO DEFINE THE  MACF0530
*         FLAGS HEREUNDER.  ( THE FLAG NAMES ARE OF THE FORM 'KEYNXXXX' MACF0540
*         WHERE N IS THE RELATIVE BYTE NUMBER, AND XXXX A MEANINGFUL    MACF0550
*         ABBREVIATION OF THE CORRESPONDING KEYWORD ).                  MACF0560
         SPACE 1                                                        MACF0570
*        NOTE THAT THE LAST FOUR BITS OF THE FIRST FLAG BYTE ARE COMMON MACF0580
*         TO BOTH DCT FLAGS AND TO EXIT FLAGS.  B'0010' REPRESENTS A    MACF0590
*         DCT CONTROL CARD, WHILE B'0001' REPRESENTS AN EXIT C/C.       MACF0600
         SPACE 1                                                        MACF0610
*                                  DCT CONTROL CARD EQUATES             MACF0620
         SPACE 1                                                        MACF0630
VRB0DCT  EQU   1                   (BYTE 0) DCT=                        MACF0640
*        EQU   2                   (BYTE 0) NOT USED - INDICATES EXIT   MACF0650
*        EQU   4                   (BYTE 0) NOT USED - FUTURE C/C       MACF0660
*        EQU   8                   (BYTE 0) NOT USED - FUTURE C/C       MACF0670
VRB0CLSO EQU   16                  (BYTE 0) CLASSO=YES                  MACF0680
VRB0ALLC EQU   32                  (BYTE 0) ALLCOMM                     MACF0690
VRB0NHLD EQU   64                  (BYTE 0) NOHOLD=(...)                MACF0700
VRB0RERO EQU   128                 (BYTE 0) REROUTE=                    MACF0710
         SPACE 1                                                        MACF0720
VRB1DMSG EQU   1                   (BYTE 1) LOGONQ                      MACF0730
VRB1PNHD EQU   2                   (BYTE 1) NOHOPC=(...)                MACF0740
VRB1NVR  EQU   4                   (BYTE 1) NOTVR=(...)                 MACF0742
VRB1NHRD EQU   8                   (BYTE 1) NOHOLDRD                    MACF0743
VRB1NDPR EQU   16                  (BYTE 1) NODRYNPR                    MACF0744
VRB1D100 EQU   32                  (BYTE 1) NOD100CP                    MACF0745
         SPACE 5                                                        MACF0750
*                                  EXIT CONTROL CARD EQUATES            MACF0760
         SPACE 1                                                        MACF0770
*        EQU   1                   (BYTE 0) NOT USED - INDICATES DCT    MACF0780
VRB0EXIT EQU   2                   (BYTE 0) EXIT=                       MACF0790
*        EQU   4                   (BYTE 0) NOT USED - FUTURE C/C       MACF0800
*        EQU   8                   (BYTE 0) NOT USED - FUTURE C/C       MACF0810
VRB0SLOT EQU   16                  (BYTE 0) SLOT=(..)                   MACF0820
VRB0PCE  EQU   32                  (BYTE 0) PCE(..)                     MACF0830
VRB0NOLD EQU   64                  (BYTE 0) NOLOAD                      MACF0840
VRB0INIT EQU   128                 (BYTE 0) INIT                        MACF0850
VRB1NOEX EQU   1                   (BYTE 1) NOEXEC                      MACF0860
VRB1PWRK EQU   2                   (BYTE 1) PCEWORK(..)                 MACF0870
VRB1FLGX EQU   4                   (BYTE 1) FLAG(X)                     MACF0880
VRB1VM   EQU   8                   (BYTE 1) VMONLY                      MACF0890
         SPACE 1                                                        MACF0900
&SYSECT  CSECT .                   END OF VERB DESCRIPTOR BLOCK         MACF0910
         MEND                                                           MACF0920
