//ABEND430 JOB (1140,5),'MVS SUPERZAP',CLASS=N
//*********************************************************************
//*                                                                   *
//*      THIS JOB WILL APPLY THE IBM SUPPLIED SUPERZAP TO             *
//*      OVERCOME AN ABEND S430 IN IEFIIC DURING INITIAL ALLOCATION   *
//*      FOR A JOB.                                                   *
//*        THE SYMPTOMS OF THIS PROBLEM ARE THAT A JOB WILL START     *
//*      NORMALLY AND IMMEDIATELY TERMINATE WITH A MESSAGE IN THE     *
//*      JCL SAYING THAT THE JOB WAS CANCELLED BY JES OR THE OPERATOR *
//*      PRIOR TO EXECUTION.                                          *
//*        APARENTLY THE PROBLEM IS CAUSED BY AN INPROPERLY           *
//*      INITIALISED DEQ PARAMETER LIST IN IEFW21SD. THE ZAP IS       *
//*      DESIGNED TO GET ROUND THIS.                                  *
//*                                                                   *
//*********************************************************************
//*
//*
//*
//*      FIRST MAKE A COPY OF IEFW21SD TO SYS1.MLPATEST
//*
//*
//COPY EXEC PGM=IEBCOPY,REGION=120K
//SYSPRINT DD SYSOUT=A
//SYSUT3 DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//SYSUT4 DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//IN DD DSN=SYS1.MLPALIB,DISP=SHR
//OUT DD DSN=SYS1.MLPATEST,DISP=OLD
 COPY O=OUT,I=((IN,R))
 SELECT MEMBER=IEFW21SD
/*
//*
//*
//*
//*      APPLY THE ZAP TO THE IEFW21SD IN SYS1.MLPALIB
//*      THE EXACT MEANING OF THE CHANGES IS UNKNOWN AND THE
//*      INFORMATION PROVIDED BY IBM THROWS NO FURTHER LIGHT ON IT
//*
//*
//*
//SZAP EXEC PGM=AMASPZAP,REGION=80K
//SYSPRINT DD SYSOUT=A
//SYSLIB DD DSN=SYS1.MLPALIB,DISP=SHR
//SYSIN DD *
 NAME IEFW21SD IEFAB421
 VER 0E02 4110,A130
 REP 0E02 4110,A13C,18E1,94F8,E002,0A30,47F0,BEA6
/*
