//ACTLNK06 JOB (5806,5),'** FOR J. NOLS **',CLASS=N
//*
//*      RELINK IEAVNPMC (STAND-ALONE MODULE)
//*
//STEP01       EXEC LKED,REGION=900K,
//        PARM='SYSLMOD,IEWL,NCAL,LIST,XREF,RENT,REUS,SIZE=(600K,64K)'
//SYSLMOD DD   DSN=SYS1.MLPALIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR30
//MLPALIB DD   DSN=SYS1.MLPALIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR30
 INCLUDE MLPALIB(IEAVNPMC)
 ENTRY  IEAVNPMC
 NAME   IEAVNPMC(R)
