//ACTLNK05 JOB (5806,5),'** FOR J. NOLS **',CLASS=N
//*
//*      RELINK IEFU29 INTO IEEMB829
//*
//STEP01       EXEC LKED,REGION=900K,
//        PARM='SYSLMOD,IEWL,NCAL,LIST,XREF,RENT,REUS,SIZE=(600K,64K)'
//SYSLMOD DD DSN=SYS1.MLPALIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR30
//LPALIB  DD DSN=SYS1.LPALIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR30
//MLPALIB DD DSN=SYS1.MLPALIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR30
 INCLUDE MLPALIB(IEFU29)
 INCLUDE LPALIB(IEEMB829)
         ORDER IEEMB829
         ORDER IEFU29
         ORDER IEEMB828
         ORDER IEEMB825
         ORDER IEEMB826
         ORDER IEEMB827
         ENTRY IEEMB829
         NAME IEEMB829(R)
