//ACTZAP05 JOB (5803,5),'0363 IEFSD263',CLASS=N
//STEP01 EXEC SUPERZAP,LIB1='SYS1.MLPALIB,UNIT=3330-1,VOL=SER=IPOR20'
 NAME IEFSD060 IEFSD263
*
*        DISABLE LOCAL LOCK IN IEFSD263 TO ALLOW SVC 254
*        NOTE THAT THIS IS A SHORT TERM FIX TO A PROBLEM
*        IN THE IPO 2 SYSTEM WHICH HAS CONTROL OF THE LOCAL
*        LOCK WHEN WE WANT TO ISSUE SVC 254,LEADING TO S0F8
*        ABENDS.TO CIRCUMVENT THIS WE ZAP OUT THE ENTRY TO THE
*        LOCK ROUTINES,THUS NEVER GETTING THE LOCK.
*        THIS IS A BAD PRACTICE WHICH WILL BE CORRECTED ASAP,
*        MEANWHILE WE FIGURE THAT IT WONT HURT TOO MUCH AS
*        THE IPO 1 SYSTEM RUNS WITHOUT GETTING THE LOCAL LOCK.
*
*
*        THE FOLLOWING ZAP APPLIES TO IPO/MVS RELEASE 2.0
*
 VER 03D4 58D0D248           L     R13,X'248'(R13) GET LOCKWORD
 VER 03D8 05ED               BALR  R14,R13  ENTER LOCK ROUTINE
 REP 03D8 05E0               BALR  R14,0    SKIP LOCK ROUTINE
 VER 0446 58D0D254           L     R13,X'254'(R13) GET LOCKWORD
 VER 044A 05ED               BALR  R14,R13  ENTER LOCK ROUTINE
 REP 044A 05E0               BALR  R14,0    SKIP LOCK ROUTINE
 IDRDATA ACTZAP05
