//PSGADDPW     JOB  (1582,5),'IPOJ01',CLASS=N,
//           RESTART=(*),MSGLEVEL=(2,0)
//PSWDREST     EXEC  PGM=IDCAMS,REGION=320K
//*********************************************************************
//*      RESTORE MASTER CATALOG UPDATE PASSWORD                       *
//*********************************************************************
//SYSPRINT  DD   SYSOUT=A
//IPOR01   DD   UNIT=3330-1,VOL=SER=IPOR01,DISP=OLD
//SYSIN   DD   *
   ALTER   CATALOG.IPOJ01/TSGOROPS UPDATEPW(TSGOROPS)
/*
