//PSGAMB       JOB  (1582,5),'FORMAT NUCLEUS',CLASS=T
/*JOBPARM         T=15,L=99
//NUC00 EXEC PGM=SHARDISK,PARM='SYSLIB,AMBLIST'
//SYSPRINT DD SYSOUT=A
//SYSLIB DD UNIT=DISK,DISP=SHR,VOL=REF=IPOVOL,DSN=SYS1.NUCLEUS
//SYSIN  DD *
  LISTLOAD  DDN=SYSLIB,MEMBER=IEANUC01
/*
