//AMODGEN          JOB  (1582,5),'RECREATE SYS2.AMODG',CLASS=N
//************************************************************
//*      RECREATE SYS2.AMODGEN FROM NEW RELEASE SYS1.AMODGEN
//*      AFTER THIS JOB, SYS2 AND SYS1.AMODGEN WILL BE IN PARALLEL
//*       UNTIL THE NEXT RELEASE OF MVS IPO IS RECEIVED FOR
//*      INSTALLATION.
//************************************************************
//STEP01           EXEC PGM=IEHPROGM
//*********************************************************
//*      SCRATCH CURRENT SYS2.AMODGEN.
//*********************************************************
//SYSPRINT         DD   SYSOUT=A
//DD1              DD   VOL=REF=SYS2.AMODGEN,DISP=OLD
//SYSIN            DD   *
     SCRATCH   DSNAME=SYS2.AMODGEN,VOL=3330-1=DLIB01,PURGE
/*
//STEP02           EXEC LIBCOPYS
//************************************************************
//*      RECREATE LIBRARY FROM NEW SYSTEM SYS1.AMODGEN
//************************************************************
//SYSUT1 DD   DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT2 DD   DSN=SYS2.AMODGEN,DISP=(,KEEP),
//       VOL=REF=DLIB01,SPACE=(CYL,(28,1,28)),
//       LABEL=EXPDT=99365,DCB=(RECFM=FB,LRECL=80,BLKSIZE=12960)
//SYSIN            DD   *
     COPY   INDD=SYSUT1,OUTDD=SYSUT2
/*
//STEP03           EXEC PGM=RDBLIST
//**********************************************************
//*      LIST THE RECREATED SYS2.AMODGEN LIBRARY
//**********************************************************
//SYSPRINT     DD   SYSOUT=A
//DD1              DD   DSN=SYS2.AMODGEN,DISP=SHR
