//C       EXEC PGM=IEV90,PARM=(OBJECT,NODECK)
//SYSPRINT DD  SYSOUT=A
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//SYSPUNCH DD  SYSOUT=B
//SYSLIN   DD  DSN=&OBJ,SPACE=(3040,(40,40),,,ROUND),UNIT=VIO,         X
//             DISP=(MOD,PASS),                                        X
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1)
//SYSUT1   DD  DSN=&SYSUT1,SPACE=(1024,(120,120),,,ROUND),UNIT=VIO,    X
//             DCB=BUFNO=1
