//AUXLKMOD JOB (1586,5),'** FOR J. NOLS **',CLASS=N
//STEP01   EXEC   GENLKMOD
//LKED.SYSIN   DD   *
 INCLUDE MLPALIB(AUXCOMMX)
 INCLUDE MLPALIB(AUXCMM00)
 INCLUDE MLPALIB(AUXCMM01)
 INCLUDE MLPALIB(AUXCMM02)
 INCLUDE LINKLIB2(TESTENQ)
 INCLUDE MLPALIB(AUXCMM03)
 INCLUDE MLPALIB(AUXCMM05)
 INCLUDE MLPALIB(AUXCMM0F)
 INCLUDE MLPALIB(AUXCMM07)
 INCLUDE MLPALIB(AUXCMM09)
 INCLUDE MLPALIB(AUXCMM0A)
 INCLUDE MLPALIB(AUXCMM11)
 ENTRY AUXCOMM
 ALIAS AUXCMM06
 ALIAS AUXCMM10
 SETCODE AC(1)
 NAME AUXCOMM(R)
/*
//LINKLIB2 DD DSN=SYS1.LINKLIB2,DISP=SHR
