//CATIPOV    JOB   (1582,5),'PSG',CLASS=T
//STEP01   EXEC   PGM=IEHPROGM
//SYSPRINT   DD   SYSOUT=A
   CATLG   DSNAME=IPOR20,VOL=3330-1=IPOR20
   CATLG   DSNAME=IPOVOL,VOL=3330-1=IPOR20
   CATLG   DSNAME=DISK.IPOR20,VOL=3330-1=IPOR20
/*
