//CATIPO2   JOB (1582,5),PSG,CLASS=N
//*********************************************************************
//*      CATALOG DATASETS UNIQUE TO NEW IPO RELEASE                   *
//*********************************************************************
//STEP01   EXEC   AMSPREP
//*********************************************************************
//*      SET UP NEW HIGH LEVEL INDEX IN MASTER CATALOG                *
//*********************************************************************
ADDINDEXIPO20   IPOR01
/*
//STEP02   EXEC   PGM=IEHPROGM
//*********************************************************************
//*      CATALOG THE DATASETS                                         *
//*********************************************************************
//SYSPRINT   DD   SYSOUT=A
//DISK   DD   UNIT=3330,VOL=SER=IPOR01,DISP=OLD
//SYSIN   DD   *
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.CMDPROC
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.GENLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.JCLLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.PARMLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.HELP
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.INSTLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.OPERLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.STAGE2
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.LINKLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.PROCLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.PPROCLIB
     CATLG   VOL=3330-1=IPOR20,DSNAME=IPO20.SAMPLIB
/*
