//CDGOC   PROC
//FORT    EXEC PGM=IGKFTN,PARM=(DECK,NOGO)
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//SYSLIN   DD  DSN=&OBJ,SPACE=(3040,(40,40),,,ROUND),UNIT=VIO,         X
//             DISP=(MOD,PASS),                                        X
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1)
