//FORT   EXEC PGM=IGKFTN,PARM=(NOGO,DECK)
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD DSNAME=&OBJ,UNIT=VIO,DISP=(MOD,PASS),                    X
//            DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1),           X
//            SPACE=(CYL,(1,1))
//GO  EXEC PGM=LOADER,PARM=(MAP,LET,PRINT),COND=(4,LT,FORT)
//SYSLOUT  DD SYSOUT=A
//SYSLIB   DD DSNAME=SYS1.FORTLIB,DISP=SHR
//SYSLIN   DD DSNAME=&OBJ,DISP=(OLD,DELETE)
//FT05F001 DD DDNAME=SYSIN
//FT06F001 DD SYSOUT=A
//FT07F001 DD SYSOUT=B
