//LKED    EXEC PGM=IEWL,PARM=(XREF,LET,LIST)
//SYSPRINT DD  SYSOUT=A
//SYSLIB   DD  DSNAME=SYS1.FORTLIB,DISP=SHR
//SYSLMOD  DD  SPACE=(CYL,(1,1,1),UNIT=VIO,DSN=&LOD(X),                X
//             DISP=(,PASS),DCB=BUFNO=1
//SYSUT1   DD  UNIT=VIO,SPACE=(1024,(120,120),,,ROUND),                X
//             DSNAME=&SYSUT1,DCB=(BLKSIZE=1024,BUFNO=1)
//SYSLIN   DD  DDNAME=SYSIN
//GO      EXEC PGM=*.LKED.SYSLMOD,COND=(4,LT,LKED)
//FT05F001 DD  DDNAME=SYSIN
//FT06F001 DD  SYSOUT=A
//FT07F001 DD  SYSOUT=B
