         TITLE 'TABLE OF VALID CHARGE CODES'
CHRGCTAB CSECT
         USING *,15
START    DC    A(TABSTART)         ADDRESS OF START OF TABLE
         DC    A(4)                LENGTH OF EACH ELEMENT
END      DC    A(TABEND)           ADDRESS OF END OF TABLE
TABNO    DC    A((TABEND-TABSTART)/4) NUMBER OF ELEMENTS IN TABLE
TABSTART EQU   *                   START OF TABLE
         DC    CL4'1140'
         DC    CL4'1580'
         DC    CL4'6000'
TABEND   EQU   *-4                 END OF TABLE
         END
