//PSGCLDMP     JOB  (1582,5),'FORMAT SYS1.DUMPXX',CLASS=T,
// RESTART=*  RESTART=(STEP02.CLEAR)
//CLRDMP PROC CLASS=A,DUMP=DUMP00
//CLEAR EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=&CLASS
//SYSUT1 DD DUMMY,DCB=(RECFM=F,LRECL=4104,BLKSIZE=4104)
//SYSUT2 DD DSN=SYS1.&DUMP,DISP=OLD
//SYSIN DD DUMMY
//       PEND
//STEP01       EXEC PRDMP
//TAPE         DD   DSN=SYS1.DUMP02,DISP=SHR,VOL=REF=IPOVOL
     FORMAT
     CPUDATA
     GO
     END
/*
//STEP02   EXEC   CLRDMP,DUMP='DUMP02,VOL=REF=IPOVOL'
/*
