//JEACOBOL JOB (1140,5),'J ABBEY',CLASS=T
//*
//* RELEASE 2, MODIFICATION LEVEL 2, OF 5740-CB1
//*
//* THE FORMAT OF THIS RELEASE IS AS FOLLOWS:
//*
//*  FILE 1 - BLKSIZE=3200  - THE JCL FOR APPLICATION
//*  FILE 2 - BLKSIZE=3200  - CMS INSTALLATION EXEC
//*  FILE 3 - BLKSIZE=3200  - THE VSCBL1 MACRO
//*  FILE 4 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                           EDITOR CONTROL CARDS NECESSARY
//*                           FOR APPLICATION OF COMPILER
//*                           LIBRARY MODULES
//*  FILE 5 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                           EDITOR CONTROL CARDS NECESSARY
//*                           FOR APPLICATION OF SOME SUBROUTINE
//*                           LIBRARY REUSABLE MODULES
//*  FILE 6 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                           EDITOR CONTROL CARDS NECESSARY
//*                           FOR APPLICATION OF SOME SUBROUTINE
//*                           LIBRARY REENTRANT MODULES
//*  FILE 7 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                           EDITOR CONTROL CARDS NECESSARY
//*                           FOR APPLICATION OF SOME SUBROUTINE
//*                           LIBRARY MODULES THAT ARE NOT REENTRANT
//*  FILE 8 - BLKSIZE=3200  - CMS FILE. CONTAINS DMSCBD,DMSCOB,DMSILB,
//*                           TESTRUN AND ERRMSG. ALL ARE ASSEMBLE
//*                           FILES.
//*
//* COMMENTS ON APPLICATION:
//*   THE FIRST FILE OF THIS RELEASE TAPE IS THE JCL TO APPLY THE
//*   RELEASE.
//*   IF THE TARGET LIBRARIES FOR THE COMPILER AND SUBROUTINE
//*   MODULES ARE NOT SYS1.LINKLIB AND SYS1.COBLIB RESPECTIVELY,
//*   THEN YOU MUST MAKE THE APPROPRIATE JCL CHANGES NECESSARY
//*   FOR YOUR INSTALLATION.
//*   THE SUCCESSIVE FILES ON THIS TAPE ARE USED AS INPUT TO
//*   RELEASE APPLICATION.
//*
//*
//*
//PRESCRCH EXEC PGM=IEHPROGM,REGION=80K
//SYSPRINT DD   SYSOUT=A
//DLIB01   DD UNIT=SYSDA,VOL=SER=DLIB01,DISP=SHR
 SCRATCH DSNAME=SYS1.COBVS22,VOL=3330=DLIB01,PURGE
/*
//MAKEMACS EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=A
//SYSUT2   DD DSN=&VCBLMAC,DISP=(NEW,PASS),UNIT=SYSDA,
//            DCB=SYS1.MACLIB,SPACE=(80,(200,20,1))
//SYSIN    DD UNIT=2400,VOL=SER=VSCOB2,DSN=MACROS,DISP=(OLD,PASS),
//            LABEL=(3,NL),DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB)
//*
//DEFAULTS EXEC PGM=ASMBLR,PARM='DECK,NOLOAD',COND=(8,LE),REGION=80K
//SYSLIB   DD DSN=&VCBLMAC,DISP=(OLD,DELETE)
//         DD DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD SYSOUT=A
//SYSUT1   DD DSN=&CBC4UT1,SPACE=(1700,(200,100)),UNIT=SYSDA
//SYSUT2   DD DSN=&CBC4UT2,SPACE=(1700,(200,100)),UNIT=SYSDA
//SYSUT3   DD DSN=&CBC4UT3,SPACE=(1700,(200,100)),UNIT=SYSDA,
//            DISP=(,PASS)
//SYSPUNCH DD DSN=&VCBLOBJ(ASM1),SPACE=(80,(300,20,1)),UNIT=SYSDA,
//            DISP=(NEW,PASS)
//SYSIN    DD *
***********************************************************************
*
*
*        COBOL VS RELEASE 2 LEVEL 2 INSTALLATION.
*
*        NOVEMBER 1978 - JEA.
*
*        HAVING TRIED A STRAIGHT INSTALLATION OF THE SOURCE MATERIAL,
*        IT SEEMS THAT THE NEW DEFAULT PARAMETERS ARE NOT ACCEPTABLE
*        IN OUR CURRENT ENVIRONMENT SO I HAVE RESET THEM BY CODING
*        THE OLD VALUES ON THE VSCBL1 MACRO BELOW.
*        VALUES AFFECTED ARE:
*
*        QUOTE       ----> APOST      (USE APOSTROPHE FOR LITERALS)
*        ADV         ----> NOADV      (NO AUTO-ALLOC OF C.C. BYTES)
*        LANGLVL(2)  ----> LANGLVL(1) (USE OLD LANGUAGE SYNTAX RULES)
*
*
*
*
***********************************************************************
         SPACE 2
           VSCBL1 LITCHAR=APOST,STD=LANGLVL(1),NEWADV=NOADV
           END
//*
//COMPLKED EXEC PGM=HEWL,REGION=128K,COND=(8,LE),
//            PARM='LIST,XREF,NCAL,SIZE=(128K,20K)'
//SYSPRINT DD SYSOUT=A
//* ****************************************************************
//* CHANGE TARGET LIBRARY FOR COBOL COMPILER IF NOT SYS1.LINKLIB
//* ****************************************************************
//SYSLMOD  DD DSN=SYS1.COBVS22,UNIT=SYSDA,VOL=SER=DLIB01,
//            SPACE=(CYL,(5,1,100)),DCB=(RECFM=U,BLKSIZE=13030),
//            DISP=(,CATLG),LABEL=EXPDT=11111
//SYSUT1   DD DSN=&CBC4UT3,DISP=(OLD,PASS)
//DD1      DD DSN=&VCBLOBJ,DISP=(OLD,DELETE)
//SYSLIN   DD UNIT=2400,VOL=SER=VSCOB2,DSN=VSCOB,DISP=(OLD,PASS),
//            LABEL=(4,NL),DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB)
//         DD DDNAME=SYSIN
//SYSIN    DD *
        INCLUDE DD1(ASM1)
        SETSSI E2220000
        NAME IKFCBL01(R)
//*
//LIBREUS EXEC PGM=HEWL,REGION=128K,COND=(8,LE),
//            PARM='LIST,XREF,NCAL,REUS,SIZE=(128K,20K)'
//SYSPRINT DD SYSOUT=A
//* *****************************************************************
//* CHANGE TARGET LIBE FOR REUSABLE COBOL SUBRTNES IF NOT SYS1.COBLIB
//* *****************************************************************
//SYSLMOD  DD DSN=SYS1.COBVS22,DISP=SHR
//SYSUT1   DD DSN=&CBC4UT3,DISP=(OLD,PASS)
//SYSLIN   DD UNIT=2400,VOL=SER=VSCOB2,DSN=VSLIB1,DISP=(OLD,PASS),
//            LABEL=(5,NL),DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB)
//*
//LIBREENT EXEC PGM=HEWL,REGION=128K,COND=(8,LE),
//            PARM='LIST,XREF,NCAL,RENT,SIZE=(128K,20K)'
//SYSPRINT DD SYSOUT=A
//* ******************************************************************
//* CHANGE TARGET LIBE FOR REENTRANT COBOL SUBRTNES IF NOT SYS1.COBLIB
//* ******************************************************************
//SYSLMOD  DD DSN=SYS1.COBVS22,DISP=SHR
//SYSUT1   DD DSN=&CBC4UT3,DISP=(OLD,PASS)
//SYSLIN   DD UNIT=2400,VOL=SER=VSCOB2,DSN=VSLIB2,DISP=(OLD,PASS),
//            LABEL=(6,NL),DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB)
//*
//LIBREGLR EXEC PGM=HEWL,REGION=128K,COND=(8,LE),
//            PARM='LIST,XREF,NCAL,SIZE=(128K,20K)'
//SYSPRINT DD SYSOUT=A
//* ******************************************************************
//* CHANGE TARGET LIBE FOR NON-REUS COBOL SUBRTNES IF NOT SYS1.COBLIB
//* ******************************************************************
//SYSLMOD  DD DSN=SYS1.COBVS22,DISP=SHR
//SYSUT1   DD DSN=&CBC4UT3,DISP=(OLD,PASS)
//SYSLIN   DD UNIT=2400,VOL=SER=VSCOB2,DSN=VSLIB2,DISP=(OLD,PASS),
//            LABEL=(7,NL),DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB)
