//UP00006   JOB 5740-CB1,SJ0501,MSGLEVEL=(1,1)
//*
//*  RELEASE 1, MODIFICATION LEVEL 1 , PTF 6 OF 5740-CB1
//*
//*  THE FORMAT OF THIS RELEASE IS AS FOLLOWS:
//*
//*    FILE 1 - BLKSIZE=80    - THE JCL FOR APPLICATION
//*    FILE 2 - BLKSIZE=80    - THE VSCBL1 MACRO
//*    FILE 3 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                             EDITOR CONTROL CARDS NECESSARY
//*                             FOR APPLICATION OF COMPILER
//*                             LIBRARY MODULES
//*    FILE 4 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                             EDITOR CONTROL CARDS NECESSARY
//*                             FOR APPLICATION OF SOME SUBROUTINE
//*                             LIBRARY REUSUABLE MODULES
//*    FILE 5 - BLKSIZE=3200  - THE OBJECT MODULES AND LINKAGE
//*                             EDITOR CONTROL CARDS NECESSARY
//*                             FOR APPLICATION OF SOME SUBROUTINE
//*                             LIBRARY REENTRANT MODULES
//*    FILE 6 - BLKSIZE=80 -    CMS INSTALLATION EXEC
//*
//*
//*  THOSE WHO APPLY 5740-CB1 REL 1.1 MAY WISH TO REFERENCE:
//*
//*    IBM OS/VS COBOL COMPILER AND LIBRARY REFERENCE
//*    MATERIAL, ORDER NO. SC28-6481, AND
//*
//*    MEMORANDUM TO:  CURRENT LICENSEES OF OS/VS COBOL COMPILER AND
//*                    LIBRARY (5740-CB1) (DATED SEPTEMBER 15, 1974).
//*
//*
//*  COMMENTS ON APPLICATION:
//*    THE FIRST FILE OF THE RELEASE TAPE IS THE JCL TO APPLY THE
//*    RELEASE.
//*    IF THE TARGET LIBRARIES FOR THE COMPILER AND SUBROUTINE
//*    MODULES ARE NOT SYS1.LINKLIB AND SYS1.COBLIB RESPECTIVELY,
//*    THEN YOU MUST MAKE THE APPROPRIATE JCL CHANGES NECESSARY
//*    FOR YOUR INSTALLATION.
//*    THE SUCCESSIVE FILES ON THIS TAPE ARE USED AS INPUT TO
//*    THE RELEASE APPLICATON.
//*
//*
//*
//STEP1    EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=A
//SYSUT2   DD DSN=&VCBLMAC,DISP=(NEW,PASS),UNIT=SYSDA,
//            DCB=SYS1.MACLIB,SPACE=(80,(200,20,1))
//SYSIN    DD UNIT=2400,VOL=SER=P00006,DISP=(OLD,PASS),
//            LABEL=(2,NL),DCB=(BLKSIZE=80,LRECL=80,RECFM=F),
//            DSN=P5740.CB1.PTF.C00006.FILE2
//*
//STEP2    EXEC PGM=IEUASM,PARM='DECK,NOLOAD',COND=(8,LE),REGION=80K
//SYSLIB   DD DSN=&VCBLMAC,DISP=(OLD,DELETE)
//         DD DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD SYSOUT=A
//SYSUT1   DD DSN=&CBC4UT1,SPACE=(1700,(200,100)),UNIT=SYSDA
//SYSUT2   DD DSN=&CBC4UT2,SPACE=(1700,(200,100)),UNIT=SYSDA
//SYSUT3   DD DSN=&CBC4UT3,SPACE=(1700,(200,100)),UNIT=SYSDA,
//            DISP=(,PASS)
//SYSPUNCH DD DSN=&VCBLOBJ(ASM1),SPACE=(80,(300,20,1)),UNIT=SYSDA,
//            DISP=(NEW,PASS)
//SYSIN    DD *
           VSCBL1
           END
//*
//STEP3    EXEC PGM=IEWL,REGION=120K,COND=(8,LE),
//             PARM='DC,LIST,XREF,NCAL,SIZE=(120K,20K)'
//*
//* ******************************************************************
//* CHANGE TARGET LIBRARY FOR COBOL COMPILER IF NOT SYS1.LINKLIB
//* ******************************************************************
//*
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//DD1      DD DSN=&VCBLOBJ,DISP=(OLD,DELETE)
//SYSUT1   DD UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSLMOD  DD DSN=SYS1.LINKLIB,DISP=OLD
//SYSLIN   DD  UNIT=2400,
//             LABEL=(3,NL),
//             VOL=SER=P00006,
//             DSN=P5740.CB1.PTF.C00006.FILE3,
//             DISP=(OLD,PASS),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//         DD DDNAME=SYSIN
//SYSIN    DD *
           INCLUDE  DD1(ASM1)
           SETSSI E2110006
           NAME  IKFCBL01(R)
//*
//STEP4    EXEC PGM=IEWL,REGION=120K,COND=(8,LE),
//             PARM='DC,LIST,XREF,NCAL,REUS,SIZE=(120K,20K)'
//*
//* ******************************************************************
//* CHANGE TARGET LIBRARY FOR COBOL SUBROUTINES IF NOT SYS1.COBLIB
//* ******************************************************************
//*
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//SYSUT1   DD UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSLMOD  DD DSN=SYS1.COBLIB,DISP=OLD
//SYSLIN   DD  UNIT=2400,
//             LABEL=(4,NL),
//             VOL=SER=P00006,
//             DSN=P5740.CB1.PTF.C00006.FILE4,
//             DISP=(OLD,PASS),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//*
//STEP5    EXEC PGM=IEWL,REGION=120K,COND=(8,LE),
//             PARM='DC,LIST,XREF,NCAL,RENT,SIZE=(120K,20K)'
//*
//* ******************************************************************
//* CHANGE TARGET LIBRARY FOR COBOL SUBROUTINES IF NOT SYS1.COBLIB
//* ******************************************************************
//*
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//SYSUT1   DD UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSLMOD  DD DSN=SYS1.COBLIB,DISP=OLD
//SYSLIN   DD  UNIT=2400,
//             LABEL=(5,NL),
//             VOL=SER=P00006,
//             DSN=P5740.CB1.PTF.C00006.FILE5,
//             DISP=(OLD,KEEP),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//*
//*
