//COBVPTFL     JOB  (1580,5),'0085 LOAD COBVS PTF',CLASS=T
//STEP01   EXEC   LIBRARYN,FILE=MVS
//TAPE    DD   UNIT=2400,VOL=SER=COBPTF,LABEL=(1,BLP),DISP=(OLD,PASS),
//       DCB=(RECFM=FB,LRECL=80,BLKSIZE=3440)
-OPT NOPC,LIST,NOEXEC
-ADD COBVSPTF,CPTF,SEQ=/73,8,100,100/
-PGMR PPROD
-DESC COBVS V1L1 PTF-T6 INSTALL JOB
-AUX TAPE
-END
/*
