//GO      EXEC PGM=LOADER,PARM=(MAP,LET,PRINT)
//SYSLIB   DD  DSNAME=SYS1.FORTLIB,DISP=SHR
//SYSLOUT  DD  SYSOUT=A
//FT05F001 DD  DDNAME=SYSIN
//FT06F001 DD  SYSOUT=A
//FT07F001 DD  SYSOUT=B
