//GENASMOD     PROC MAC='SYS1.AMACLIB',MAC1='SYS1.AMODGEN',
//             MAC2='SYS2.MACLIB',
//             COPT=LIST,LOPT=RENT,L=H,
//             LIB1='SYS1.MLPALIB',IPOVOL=IPOR20,
//             SYSLIB='SYS1.LINKLIB',AOS=05
//*********************************************************************
//*                                                                   *
//*                ASSEMBLE MVS MODIFICATIONS                         *
//*                                                                   *
//*  SYMBOLIC PARAMETERS:-                                            *
//*      LIB1=    TARGET LIBRARY.                      SYS1.MLPALIB   *
//*      SYSLIB=  SECOND AUTOMATIC CALL LIBRARY        SYS1.LINKLIB   *
//*      AOS=     LAST TWO CHARACTERS OF DIST. LIBRARY 05             *
//*      IPOVOL=  VOLUME REFERENCE OF TARGET LIBRARY.  IPOVOL         *
//*      MAC=     FIRST MACRO LIBRARY                  SYS1.AMACLIB   *
//*      MAC1=    SECOND MACRO LIBRARY                 SYS1.AMODGEN   *
//*      MAC2=    THIRD MACRO LIBRARY                  SYS2.MACLIB    *
//*      L=       ASSEMBLER LEVEL                      H              *
//*      COPT=    ASSEMBLER OPTIONS                    LIST           *
//*      LOPT=    LINKAGE EDITOR OPTIONS               RENT           *
//*                                                                   *
//*********************************************************************
//ASM          EXEC PGM=ASM&L,REGION=256K,
//             PARM='NODECK,OBJECT,XREF(SHORT),&COPT'
//SYSLIB       DD   DSN=&MAC,DISP=SHR
//             DD   DSN=&MAC1,DISP=SHR
//             DD   DSN=&MAC2,DISP=SHR
//SYSUT1       DD   DSN=&&SYSUT1,UNIT=VIO,SPACE=(1700,(600,100))
//SYSUT2       DD   DSN=&&SYSUT2,UNIT=VIO,SPACE=(1700,(300,50))
//SYSUT3       DD   DSN=&&SYSUT3,UNIT=VIO,SPACE=(1700,(300,50))
//SYSPRINT     DD   SYSOUT=A,DCB=BLKSIZE=1089
//SYSPUNCH     DD   SYSOUT=B
//SYSGO        DD   DSN=&&OBJSET,UNIT=SYSDA,SPACE=(80,(200,50)),
//             DISP=(MOD,PASS),DCB=(RECFM=FB,BLKSIZE=400)
//LKED         EXEC PGM=SHARDISK,REGION=208K,
//             PARM='SYSLMOD,IEWL,XREF,LIST,LET,REUS,&LOPT',
//             COND=(7,LT,ASM)
//SYSLIB       DD   DSN=&LIB1,DISP=SHR,VOL=REF=&IPOVOL
//             DD   DSN=&SYSLIB,DISP=SHR,VOL=REF=&IPOVOL
//             DD   DSN=SYS1.AOS&AOS,DISP=SHR
//SYSLIN       DD   DSN=&&OBJSET,DISP=(OLD,DELETE)
//             DD   DDNAME=SYSIN
//SYSLMOD      DD   DSN=&LIB1,DISP=SHR,
//             VOL=REF=&IPOVOL
//SYSUT1       DD   DSN=&&SYSUT1,UNIT=VIO,SPACE=(1024,(50,20))
//SYSPRINT     DD   SYSOUT=A,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
//LPALIB       DD   DSN=SYS1.LPALIB,DISP=SHR,VOL=REF=&IPOVOL
//MLPALIB      DD   DSN=SYS1.MLPALIB,DISP=SHR,VOL=REF=&IPOVOL
//LINKLIB      DD   DSN=SYS1.LINKLIB,DISP=SHR,VOL=REF=&IPOVOL
//AOS          DD   DSN=SYS1.AOS&AOS,DISP=SHR
