//IEAVNPMC JOB (5806,5),'** FOR J. NOLS **',CLASS=N                        00010
//LIBRA EXEC LIBRARYN,FILE=MVS                                             00020
//SYSIN DD *                                                               00030
-OPT                                                                       00040
-SEL IEAVNPMC,CKMZ,LIST,EXEC,VERS=0921                                     00050
-HST JN - DATE CHECKING REMOVED FROM THIS MODULE, AND                      00060
-HST JN -  PLACED INTO IEFUJI.                                             00070
-REP ALL                                                                   00080
NIP      TITLE 'INTERNAL MACROS'                                      +    00090
         MACRO                                                          VNP00100
&NAME    CSID  &NONAME                                                  VNP00110
         LCLC  &NAME1                                                   VNP00120
&NAME1   SETC  '&NAME'                                                  VNP00130
         AIF   ('&NONAME' EQ 'NONAME').A01                              VNP00140
&NAME1   DC    CL8'&SYSECT'        NAME OF CSECT                        VNP00150
&NAME1   SETC  ' '                                                      VNP00160
.A01           ANOP                                                     VNP00170
&NAME1   DC    CL8'&SYSDATE'       DATE OF ASSEMBLY                     VNP00180
         DC    CL8'&SYSTIME'       TIME OF ASSEMBLY                     VNP00190
         MEND                                                           VNP00200
         EJECT                                                          VNP00210
*        MACRO                                                          VNP00220
*&NAME   TELL  &MSG                                                     VNP00230
*&NAMEIEAPMNIP TYPE=WTO,PARAM=&MSG ISSUE MESSAGE TO OPERATOR            VNP00240
*        MEND                                                           VNP00250
         SPACE 5                                                        VNP00260
*        MACRO                                                          VNP00270
*&NAME   MSG   &DATA                                                    VNP00280
*        LCLA  &K                                                       VNP00290
*&K      SETA  K'&DATA                                                  VNP00300
*&K      SETA  &K-2                                                     VNP00310
*&NAMEIEAPMNIP TYPE=HEADER,MSGST=(*),MSGEND=(*+4+10+&K),OPT=(,NBC)      VNP00320
*        DC    CL10'&SYSECT'       IDENTIFY ISSUING CSECT               VNP00330
*        DC    C&DATA                                                   VNP00340
*        MEND                                                           VNP00350
         EJECT                                                          VNP00360
*        MACRO                                                          VNP00370
*&NAME   WTO   &MSG,&OPT=                                               VNP00380
*.*                                                                     VNP00390
*.*      ISSUE A MESSAGE TO THE OPERATOR VIA THE NIP SERVICE ROUTINE.   VNP00400
*.*       THE OPTIONAL PARAMETER 'OPT=' SPECIFIES A LIST OF SUFFIXES    VNP00410
*.*       THAT IDENTIFY MESSAGES.  THE FIRST SUCH MESSAGE IS ISSUED     VNP00420
*.*       PRIOR TO THE ACTUAL MESSAGE TEXT ENTERED IN THE MACRO, WHILE  VNP00430
*.*       ALL OTHER MESSAGES ARE ISSUED AFTER THE MESSAGE TEXT.         VNP00440
*.*                                                                     VNP00450
*.*E.G.  WTO   'RHUBARB TART',OPT=(ILOVE,TWICE,ADAY)                    VNP00460
*.*                                                                     VNP00470
*.*      WOULD ISSUE THE FOLLOWING MESSAGES :-                          VNP00480
*.*            MSGILOVE            ( NAME OF A MESSAGE HEADER )         VNP00490
*.*            'RHUBARB TART'                                           VNP00500
*.*            MSGTWICE            ( NAME OF A MESSAGE HEADER )         VNP00510
*.*            MSGADAY             ( NAME OF A MESSAGE HEADER )         VNP00520
*.*                                                                     VNP00530
*        LCLA  &K,&N                                                    VNP00540
*        LCLC  &LABEL                                                   VNP00550
*&LABEL  SETC  '&NAME'                                                  VNP00560
*&K      SETA  K'&MSG                                                   VNP00570
*&K      SETA  &K-2                                                     VNP00580
*&N      SETA  &K+1                                                     VNP00590
*&N      SETA  &N/2                                                     VNP00600
*&N      SETA  &N*2                                                     VNP00610
*        AIF   (N'&OPT EQ 0).NOOPT1                                     VNP00620
*&LABELIEAPMNIP TYPE=WTO,PARAM=MSG&OPT(1)                               VNP00630
*&LABEL  SETC  ' '                                                      VNP00640
*.N00PT1 ANOP                                                           VNP00650
*&LABEL  BAL   RPARM,*+&N+4+4+10   POINT AT MESSAGE HEADER              VNP00660
*    IEAPMNIP  TYPE=HEADER,MSGST=(*),MSGEND=(*+4+10+&K),OPT=(,NBC)      VNP00670
*        DC    CL10'&SYSECT'       IDENTIFY ISSUING CSECT               VNP00680
*        DC    C&MSG                                                    VNP00690
*     IEAPMNIP TYPE=WTO,PARAM=0(,RPARM)                                 VNP00700
*        AIF   (N'&OPT LT 2).END                                        VNP00710
*&N      SETA  1                                                        VNP00720
*.LOOP   ANOP                                                           VNP00730
*&N      SETA  &N+1                                                     VNP00740
*        AIF   (&N GT N'&OPT).END                                       VNP00750
*     IEAPMNIP TYPE=WTO,PARAM=MSG&OPT(&N)                               VNP00760
*        AGO   .LOOP                                                    VNP00770
*.END    ANOP                                                           VNP00780
*        MEND                                                           VNP00790
         TITLE 'PROGRAM IDENTIFICATION'                               +    00800
         SPACE 1                                                        VNP00810
* WRITTEN BY D. R. HURTGEN                                              VNP00820
         SPACE 1                                                           00830
* MODIFIED BY D.A.MOORCROFT        ( MAY 1977 )                         VNP00840
         SPACE 1                                                           00850
* MODIFIED BY J. NOLS              AUGUST 1978                        + VNP00860
         SPACE 1                                                        VNP00870
* MONSANTO COMPANY - GENERAL OFFICES                                    VNP00880
         SPACE 1                                                        VNP00890
* JUNE, 1976                                                            VNP00900
         SPACE 2                                                        VNP00910
*                                                                       VNP00920
         TITLE 'ACCOUTING ROUTINE CONTROL BLOCK DSECT''S'             +    00930
*********************************************************************** VNP00940
*        DSECT FOR MONSANTO VECTOR TABLE ( MVT )                      * VNP00950
*********************************************************************** VNP00960
         SPACE 1                                                        VNP00970
         $MVT  DOC=YES             GENERATE DSECT                       VNP00980
         EJECT                                                          VNP00990
*********************************************************************** VNP01000
*        DSECT FOR AUXILIARY MONSANTO VECTOR TABLE ( AMVT )           * VNP01010
*********************************************************************** VNP01020
         SPACE 1                                                        VNP01030
         $AMVT DOC=YES             GENERATE DSECT                       VNP01040
         EJECT                                                          VNP01050
*********************************************************************** VNP01060
*        DSECT FOR MONSANTO COMMON AREA ( MCA )                       * VNP01070
*********************************************************************** VNP01080
         SPACE 1                                                        VNP01090
         $MCA  DOC=YES             GENERATE DSECT                       VNP01100
         EJECT                                                          VNP01110
*********************************************************************** VNP01120
*        DSECT FOR ACCOUNTING SERVICE AREA ( ASA )                    * VNP01130
*********************************************************************** VNP01140
         SPACE 1                                                        VNP01150
         $MASA                                                          VNP01160
         EJECT                                                          VNP01170
*********************************************************************** VNP01180
*        DSECTS FOR IBM CONTROL BLOCKS                                * VNP01190
*********************************************************************** VNP01200
         SPACE 1                                                        VNP01210
*        THE FOLLOWING FIELDS IN IBM CONTROL BLOCKS ARE REFERENCED:-    VNP01220
         SPACE 1                                                        VNP01230
         $MAEQU                                                         VNP01240
         EJECT                                                          VNP01250
         PRINT OFF                 SUPPRESS PRINTING MASSIVE DSECTS     VNP01260
*        CVT   DSECT=YES           GENERATE CVT  DSECT                  VNP01270
*        IHAASVT ,                 GENERATE ASVT DSECT                  VNP01280
         IHASCVT ,                 GENERATE SCVT DSECT                  VNP01290
*        IHAPCCAT ,                GENERATE PCCAVT DSECT                VNP01300
*        IHAPCCA ,                 GENERATE PCCA DSECT                  VNP01310
         PRINT ON                  RE-ESTABLISH PRINTING                VNP01320
         EJECT                                                          VNP01330
*********************************************************************** VNP01340
*        MISCELLANEOUS DSECTS                                         * VNP01350
*********************************************************************** VNP01360
         SPACE 1                                                        VNP01370
*        IHANVT ,                  GENERATE NVT  DSECT                  VNP01380
*        IEAPNPB ,                                                      VNP01390
*        IEAPPNIP ,                                                     VNP01400
*        IEAPXNIP ALL                                                   VNP01410
         EJECT                                                          VNP01420
*********************************************************************** VNP01430
*        MISCELLANEOUS EQUATES                                        * VNP01440
*********************************************************************** VNP01450
         SPACE 1                                                        VNP01460
*                              - SVCTABLE -                             VNP01470
SVCEP    EQU   0                   SVC ENTRY POINT ADDRESS              VNP01480
         SPACE 1                                                        VNP01490
*               - TIMER SECOND LEVEL INTERRUPT HANDLER -                VNP01500
*SLIHDIS EQU   X'446'              WHERE OUR MOD WAS IN IPO/MVS R1.0    VNP01510
TSLIHDIS EQU   X'434'              WHERE OUR MODIFICATION WILL OCCUR    VNP01520
         SPACE 1                                                        VNP01530
*                      - SMF EXCP COUNT ROUTINE -                       VNP01540
*MFEXDIS EQU   X'B0'               WHERE OUR MOD WAS IN IPO/MVS R1.0    VNP01550
SMFEXDIS EQU   X'BC'               WHERE OUR MODIFICATION WILL OCCUR    VNP01560
*MFEXCON EQU   X'DC'               WHERE OUR MOD WAS IN IPO/MVS R1.0    VNP01570
SMFEXCON EQU   X'E8'               WHERE OUR MODIFICATION WILL OCCUR    VNP01580
         SPACE 1                                                        VNP01590
*                           - ACCOUNTING SVC -                          VNP01600
ACCTGSVC EQU   254                 SVC NUMBER                           VNP01610
TSLIHEPA EQU   0                   TIMER SLIH ENTRY POINT               VNP01620
TSLIHEXA EQU   4                   TIMER SLIH EXTENTION E. P. IN ACCTG. VNP01630
SMFEXEPA EQU   8                   SMF EXCP COUNTING ENTRY POINT        VNP01640
SMFEXEXA EQU   12                  SMF EXCP COUNTING EXTENTION E. P.    VNP01650
NUMADCON EQU   4                   NUMBER OF ADCONS AT START OF SVC     VNP01660
SVCID    EQU   16                  CHARACTER IDENTIFIER FOR SVC ( CL8 ) VNP01670
FIRSTINS EQU   24                  FIRST INSTRUCTION IN THE ACCTG. SVC  VNP01680
         EJECT                                                          VNP01690
*********************************************************************** VNP01700
*        REGISTER EQUATES AND USAGE                                   * VNP01710
*********************************************************************** VNP01720
         SPACE 1                                                        VNP01730
R0       EQU   0                   WORK AND SVC LINKAGE                 VNP01740
R1       EQU   1                   WORK AND SVC LINKAGE                 VNP01750
NVT      EQU   2                   ADDRESS OF NIP VECTOR TABLE          VNP01760
CVTBASE  EQU   3                   ADDRESS OF THE CVT                   VNP01770
WA       EQU   4                   WORK                                 VNP01780
WB       EQU   5                   WORK                                 VNP01790
WC       EQU   6                   WORK                                 VNP01800
WD       EQU   7                   WORK                                 VNP01810
WE       EQU   8                   WORK                                 VNP01820
WF       EQU   9                   WORK                                 VNP01830
SVCT     EQU   10                  ADDRESS OF SVC TABLE                 VNP01840
R11      EQU   11                  ADDRESS OF THE MVT                   VNP01850
BASEA    EQU   12                  BASE REGISTER                        VNP01860
SAVEPTR  EQU   13                  ADDRESS OF REGISTER SAVE AREA        VNP01870
LINK     EQU   14                  RETURN ADDRESS                       VNP01880
R15      EQU   15                  SVC LINKAGE                          VNP01890
         SPACE 5                                                        VNP01900
*********************************************************************** VNP01910
*        REGISTER EQUATES USED BY NIP ROUTINES AND MACROS             * VNP01920
*********************************************************************** VNP01930
         SPACE 1                                                        VNP01940
RPARM    EQU   1                   ADDRESS OF PARAMETER LIST            VNP01950
RNVT     EQU   2                   ADDRESS OF NVT                       VNP01960
RCVT     EQU   3                   ADDRESS OF CVT                       VNP01970
RSAVE    EQU   13                  ADDRESS OF REGISTER SAVE AREA        VNP01980
REXIT    EQU   14                  RETURN ADDRESS FOR SERVICE RTN       VNP01990
RENTRY   EQU   15                  ADDRESS OF SERVICE ROUTINE           VNP02000
         TITLE 'MONSANTO ADDITION TO VS2 IPL/NIP PROCESSING'          +    02010
*********************************************************************** VNP02020
*        HOUSEKEEPING                                                 * VNP02030
*********************************************************************** VNP02040
         SPACE 1                                                        VNP02050
         USING CVTMAP,CVTBASE      ESTABLISH CVT ADDRESSABILITY         VNP02060
IEAVNPMC CSECT                                                          VNP02070
         USING *,BASEA             ESTABLISH ADDRESSABILITY             VNP02080
         B     28(R15)             BRANCH AROUND IDENTIFIER             VNP02090
         CSID  ,                   IDENTIFY CSECT LEST WE DUMP          VNP02100
         STM   14,12,12(SAVEPTR)   SAVE REGISTERS                       VNP02110
         LR    BASEA,R15           SET BASE REGISTER                    VNP02120
         LA    R15,SAVEAREA        GET SAVE AREA ADDRESS                VNP02130
         ST    R15,8(,SAVEPTR)     SET UP BACKWARD AND                  VNP02140
         ST    SAVEPTR,SAVEAREA+4    FORWARD SAVE AREA CHAIN            VNP02150
         LR    SAVEPTR,R15                                              VNP02160
*        IEAPSPIO IEFACTRT         GET PARMLIB MEMBER                   VNP02170
         SPACE 5                                                        VNP02180
         TFRR  ,                   ESTABLISH ESTAE ENVIRONMENT        +    02190
         SPACE 5                                                           02200
         WTO   'IEAVNPMC - MONSANTO NIP ROUTINE IN CONTROL : POWER,  PO+   02210
               WER,  ..  '                                            +    02220
         EJECT                                                          VNP02230
*********************************************************************** VNP02240
*        ACQUIRE CORE FOR CONTROL BLOCKS                              * VNP02250
*********************************************************************** VNP02260
         SPACE 1                                                        VNP02270
*        THE FOLLOWING CONTIGUOUS CONTROL BLOCKS ARE ACQUIRED AND       VNP02280
*         INITIALISED BY THE FOLLOWING ROUTINES :-                      VNP02290
*              MVT  PREFIX                                              VNP02300
*              MVT                                                      VNP02310
*              AMVT PREFIX                                              VNP02320
*              AMVT                                                     VNP02330
*              CSA  PREFIX                                              VNP02340
*              CSA                                                      VNP02350
*              ASA PREFIX          **.                                  VNP02360
*              ASA                 ***. ONE PER ADDRESS SPACE           VNP02370
         SPACE 1                                                        VNP02380
BLDCB    DS    0H                                                     + VNP02390
         L     CVTBASE,FLCCVT      GET CVT ADDRESS                    + VNP02400
         L     WC,CVTASVT          GET ADDRESS OF ASVT                + VNP02410
         USING ASVT,WC             ESTABLISH ASVT ADDRESSABILITY        VNP02420
         L     WA,ASVTMAXU         GET MAX. NUMBER OF ADDRESS SPACES    VNP02430
         LR    WB,WA                 AND SAVE FOR LATER TEST            VNP02440
         LA    WA,1(,WA)           ADD ONE FOR ADDRESS OF COMMON AREA   VNP02450
         TM    ASVTMAXU+3,1        Q.-IS MAX. ADDR. SPACES EVEN OR ODD  VNP02460
         DROP  WC                  DROP ASVT ADDRESSABILITY             VNP02470
         BO    *+8                 B.-ODD, THEREFORE WA VALUE IS EVEN   VNP02480
         LA    WA,1(,WA)           MAKE VALUE EVEN SO LENGTH WILL END   VNP02490
         SLA   WA,2                  ON A DOUBLE WORD                   VNP02500
         LR    WD,WA               WD = SIZE OF MONSANTO VECTOR TABLE   VNP02510
         LA    WA,MVTPLGTH(,WA)    ADD LENGTH OF PREFIX                 VNP02520
         LA    WA,AMVTLGTH+AMVTPLEN(,WA) ADD SIZE OF AUXILIARY MVT ETC  VNP02530
         LA    R0,CALGTH+CAPRLGTH(,WA) ADD COMMON AREA + PREFIX         VNP02540
         LA    WA,ASALGTH+ASAPLGTH WA = LENGTH OF EACH ASA + PREFIX     VNP02550
         MR    WA,WA               COMPUTE LENGTH OF THEM ALL           VNP02560
         AR    R0,WB               R0 = LENGTH OF ALL MONSANTO BLOCKS   VNP02570
         LR    WB,R0               SAVE OVER GETMAIN                    VNP02580
         ICM   R0,8,=AL1(245)      INSERT SUB-POOL NUMBER               VNP02590
         GETMAIN R,LV=(0)          ACQUIRE NON-PAGEABLE SPACE           VNP02600
         EJECT                                                          VNP02610
*********************************************************************** VNP02620
*        INITIALISE ACQUIRED CONTROL BLOCKS                           * VNP02630
*********************************************************************** VNP02640
         SPACE 1                                                        VNP02650
         LR    WA,R1               WA = ADDRESS OF ACQUIRED STORAGE     VNP02660
         USING MVTPREF,WA          ESTABLISH ADDRESS'Y FOR MVT PREFIX   VNP02670
         XC    0(MVTPLGTH,WA),0(WA) CLEAR MVT PREFIX TO HEX'00'         VNP02680
         MVC   MVTPRID,=CL4'MVT'   IDENTIFY MVT CONTROL BLOCK           VNP02690
         DROP  WA                  DROP MVT PREFIX ADDRESSABILITY       VNP02700
         LR    WE,WA               PRESERVE ADDRESS OF MVT PREFIX       VNP02710
         LA    WA,MVTPLGTH(,WA)    POINT PAST PREFIX AT MVT             VNP02720
         LR    R11,WA              PRESERVE MVT ADDRESS FOR LATER       VNP02730
         SH    WB,=AL2(MVTPLGTH)   DECREMENT WB TO ALLOW FOR PREFIX     VNP02740
         LR    WC,WA               SAVE THE ADDRESS                     VNP02750
         SR    R0,R0               THESE WILL CAUSE                     VNP02760
         SR    R1,R1                 CLEARING OF THE                    VNP02770
         MVCL  WA,R0                   ENTIRE ACQUIRED AREA             VNP02780
         AR    WD,WC               POINT WD AT THE AMVT PREFIX          VNP02790
         USING AMVTPREF,WD         ESTABLISH AMVT PREFIX ADDRESSABILITY VNP02800
         MVC   AMVTPRID,=CL4'AMVT' IDENTIFY AMVT CONTROL BLOCK          VNP02810
         DROP  WD                  DROP AMVT PREFIX ADDRESSABILITY      VNP02820
         LA    WD,AMVTPLEN(,WD)    POINT PAST PREFIX AT AMVT            VNP02830
         ST    WD,MVTAMVT-MVTPREF(WE) SAVE AMVT ADDRESS IN MVT PREFIX   VNP02840
         LA    WD,AMVTLGTH(,WD)    POINT PAST AMVT AT COMMON AREA PREFI VNP02850
         USING CAPREFIX,WD         ESTABLISH PREFIX ADDRESSABILITY      VNP02860
         MVC   CAPRID,=CL4'MCA'    IDENTIFY COMMON AREA                 VNP02870
         DROP  WD                  DROP PREFIX ADDRESSABILITY           VNP02880
         EJECT                                                          VNP02890
*********************************************************************** VNP02900
*        INITIALISE THE COMMON AREA ( MCA )                           * VNP02910
*********************************************************************** VNP02920
         SPACE 1                                                        VNP02930
         LA    WD,CAPRLGTH(,WD)    POINT WD AT COMMON AREA ITSELF       VNP02940
         ST    WD,0(,WC)           PUT IT IN THE VECTOR TABLE           VNP02950
         L     WE,CVTPCCAT         SET UP ALL VALUES IN THE COMMON AREA VNP02960
         L     WF,PCCAT00P(,WE)    WE = PCCAVT ADDR AND WF = PCCA ADDR  VNP02970
         SPACE 1                                                        VNP02980
         MVC   CARSIZE-CADSECT(L'CARSIZE,WD),=F'512' REGION SIZE BELOW  VNP02990
*                                   WHICH CORE USED USED IN ALGORITHMS  VNP03000
         STIDP CPUID               STORE THE CPU ID                     VNP03010
         CLI   CPUID,X'FF'         ARE WE RUNNING UNDER VM              VNP03020
         BNE   *+8                 BR IF NO VM                          VNP03030
         OI    AWBFLAG1-AWBSTART(WD),AWB1VM FLAG THAT VM IS PRESENT     VNP03040
         SPACE 1                                                        VNP03050
         MVC   AWBJOBNO-AWBSTART(AWBTODC-AWBSTART+L'AWBTODC,WD),MOD158  VNP03060
         CLC   PCCACPID+8(4,WF),=C'0158'     Q.-ARE WE ON A 158         VNP03070
         BNE   CKFOR165            B.-NO                                VNP03080
         OC    PCCAT01P(4,WE),PCCAT01P(WE)   Q.-RUNNING AS AN MP        VNP03090
         BNZ   MACHDONE            B.-YES                               VNP03100
         MVI   AWBMACH-AWBSTART(WD),1   CHANGE MACHINE CODE FOR 158B    VNP03110
         CLC   PCCACPID+2(6,WF),=C'023633'   Q.-IS IT                   VNP03120
         BE    MACHDONE            B.-YES                               VNP03130
         MVI   AWBMACH-AWBSTART(WD),0   OTHERWISE, DEFAULT IS 158A      VNP03140
         B     MACHDONE                                                 VNP03150
CKFOR165 MVC   AWBJOBNO-AWBSTART(AWBTODC-AWBSTART+L'AWBTODC,WD),MOD165  VNP03160
         CLC   PCCACPID+8(4,WF),=C'0165'     Q.-ARE WE ON THE 165       VNP03170
         BE    MACHDONE            B.-YES                               VNP03180
         MVC   AWBJOBNO-AWBSTART(AWBTODC-AWBSTART+L'AWBTODC,WD),MOD168  VNP03190
         EJECT                                                          VNP03200
*********************************************************************** VNP03210
*        INITIALISE THE ACCOUNTING SERVICE AREAS ( ASA'S )            * VNP03220
*********************************************************************** VNP03230
         SPACE 1                                                        VNP03240
MACHDONE LA    WC,4(,WC)           BUMP PAST COMMON AREA ADDRESS        VNP03250
         LA    WD,CAEND-CADSECT(,WD)    WD = ADDRESS OF 1ST ASA PREFIX  VNP03260
LOOP     CR    WA,WD               Q.-AT END OF ALL ACCOUNTING AREAS    VNP03270
         BE    AWDUN               B.-YES                               VNP03280
         USING ASAPREF,WD          ESTABLISH ASA PREFIX ADDRESSABILITY  VNP03290
         MVC   ASAPRID,=CL4'ASA'   IDENTIFY ASA                         VNP03300
         LA    WD,ASAPLGTH(,WD)    POINT WD AT START OF ASA ITSELF      VNP03310
         DROP  WD                  DROP ASA PREFIX ADDRESSABILITY       VNP03320
         USING ASADSECT,WD         ESTABLISH ASA ADDRESSABILITY         VNP03330
         ZAP   ASACPUTM,=P'0'      ZEROISE 1ST ACCUMULATOR              VNP03340
         MVC   ASAIOTM(ASAPDEND-ASAIOTM),ASACPUTM ... AND PROPAGATE     VNP03350
         DROP  WD                  DROP ASA ADDRESSABILITY              VNP03360
         ST    WD,0(,WC)           STORE ADDRESS OF THIS ASA            VNP03370
         LA    WC,4(,WC)           BUMP FOR NEXT ENTRY IN VECTOR TABLE  VNP03380
         LA    WD,ASAEND-ASADSECT(,WD) AND FOR THE NEXT ASA ADDRESS     VNP03390
         B     LOOP                                                     VNP03400
         EJECT                                                          VNP03410
*********************************************************************** VNP03420
*        RETURN TO NIP PROCESSING                                     * VNP03430
*********************************************************************** VNP03440
         SPACE 1                                                        VNP03450
         USING MVTDSECT,R11        ESTABLISH MVT ADDRESSABILITY         VNP03460
AWDUN    EQU   *                   CONTINUE                             VNP03470
         SPACE 1                                                        VNP03480
*        SET FLAG IN THE MVT IF VM IS PRESENT                           VNP03490
         SPACE 1                                                        VNP03500
         CLI   CPUID,X'FF'         TEST IF VM IS PRESENT                VNP03510
         BNE   *+8                 BR IF NO VM                          VNP03520
         OI    MVTFLAG1,MVTFVM     FLAG THAT VM IS PRESENT              VNP03530
         SPACE 5                                                        VNP03540
*        SET FLAG IF OTHER ROUTINES ARE TO DUMP IF ERRORS ARE FOUND     VNP03550
         SPACE 1                                                        VNP03560
         B     *+8                 BYPASS SETTING FLAG                  VNP03570
         OI    MVTFLAG1,MVTFDUMP   FLAG THAT DUMPS ARE REQUIRED         VNP03580
         SPACE 5                                                        VNP03590
*        SET FLAG IF TIMER SLIH EXTENSION IS TO BE USED                 VNP03600
         B     *+8                 BYPASS SETTING FLAG                  VNP03610
         OI    MVTFLAG1,MVTFTEXT   FLAG THAT TSLIH EXTENSION REQUIRED   VNP03620
         SPACE 5                                                        VNP03630
*        SET FLAG IF COSTS TO APPEAR IN ACCOUNTING BOXES                VNP03640
         SPACE 1                                                        VNP03650
         NOP   *+8                 BYPASS SETTING FLAG                  VNP03660
         OI    MVTFLAG1,MVTFCOST   FLAG THAT COSTS ARE TO BE PRINTED    VNP03670
         SPACE 5                                                        VNP03680
*        SET FLAG IF CHARGE CODES TO BE VALIDATED AGAINST 'CHRGCTAB'    VNP03690
         SPACE 1                                                        VNP03700
         NOP   *+8                 BYPASS SETTING FLAG                  VNP03710
         OI    MVTFLAG1,MVTFVCC    FLAG THAT CHARGE CODES TO BE VALID'D VNP03720
         SPACE 5                                                        VNP03730
*        SET FLAG IF 'OLD' ACCOUNTING ALGORITHMS TO BE USED             VNP03740
         SPACE 1                                                        VNP03750
         B     *+8                 BYPASS SETTING FLAG                  VNP03760
         OI    MVTFLAG1,MVTFOLDA   FLAG THAT OLD ALGORITHMS TO BE USED  VNP03770
         DROP  R11                 DROP MVT ADDRESSABILITY              VNP03780
AWDUN1   ST    R11,CVTUSER         POINT CVT AT THE MVT                 VNP03790
         ESTAE 0                   DISENGAGE INTERACTIVE ESTAE EXIT   +    03800
         L     SAVEPTR,SAVEAREA+4                                       VNP03810
         LM    14,12,12(SAVEPTR)   RESTORE THE REGISTERS                VNP03820
         SR    R15,R15                                                  VNP03830
         BR    LINK                RETURN TO NIP                        VNP03840
*                        CONSTANTS AND WORK AREAS                       VNP03850
         EJECT                                                          VNP03860
         LTORG *                                                        VNP03870
         SPACE 5                                                        VNP03880
SAVEAREA DS    18F                 REGISTER SAVE AREA                   VNP03890
WSCODE   DS    0XL4                                                     VNP03900
         DC    X'0'                                                     VNP03910
ERRFLAGS DC    X'0'                                                     VNP03920
         DC    X'7FE'                                                   VNP03930
         SPACE 2                                                        VNP03940
* THE FOLLOWING CONSTANTS ARE MACHINE DEPENDENT AND ARE WHAT WILL BE    VNP03950
* USED TO INITIALIZE ALL VALUES IN THE ACCOUNTING WORK BLOCK SECTION OF VNP03960
* THE COMMON AREA.                                                      VNP03970
         SPACE 1                                                        VNP03980
MOD158   DC    0F'0',H'1',C'158',AL1(2),H'0',FE1'1.6,.8,1,.5',FS12'1'   VNP03990
MOD165   DC    H'1',C'165',AL1(3),H'0',FE1'3.0,1.5,1,.5',FS12'1'        VNP04000
MOD168   DC    H'1',C'155',AL1(4),H'0',FE2'4.5,2.25,1,.5',FS12E1'1'     VNP04010
         SPACE 1                                                        VNP04020
CPUID    DS    D                   WORK AREA FOR CPU ID INFOMATION      VNP04030
         SPACE 2                                                        VNP04040
         LTORG                                                          VNP04050
         END   IEAVNPMC                                                 VNP04060
-EMOD                                                                      04070
-END                                                                       04080
/*                                                                         04090
//COMPILE EXEC GENASMOD                                                    04100
//ASM.SYSIN DD DSN=&&OSJOB,DISP=(OLD,DELETE)                               04110
//LKED.SYSIN DD *                                                          04120
 NAME IEAVNPMC(R)                                                          04130
/*                                                                         04140
