         MACRO
         IECDSECT
         SPACE 1
*                      THIS MACRO IS USED TO DEFINE THE WORK AREA
*                           FOR ALL MODULES OF OPEN,CLOSE,TCLOSE
*                           AND END OF VOLUME FOR O/S 360
         SPACE 1
*                      THIS MACRO DEFINES A WORK AREA WITH THE
*                           FOLLOWING FORMAT
         SPACE 1
*                           1.LABELS AND DSCB
*                                LABELS
*                                     VOLUME LABEL
*                                     FILE LABEL 1
*                                     FILE LABEL 2
*                                DSCB
*                                     FORMAT 1
*                                     FORMAT 3 KEY
*                                     FORMAT 3 DATA
*                                     CORE ADDRESS OF NEXT DSCB
*                                MESSAGE AREA................ 100 BYTES
*                           2.JFCB........................... 176 BYTES
*                           3.ECB.............................. 4 BYTES
*                           4.IOB............................. 40 BYTES
*                           5.DEB............................. 44 BYTES
*                           6.DCB.............................. 4 BYTES
*                           7.CCW S........................... 96 BYTES
         SPACE 1 0
*                                                   TOTAL *** 464 BYTES
         SPACE 2
* ***
* ***
* ***
* ***
         SPACE 1
*                      VOLUME LABEL
         SPACE 1
DXLBL    DS    0CL80 0
VOLLABI  DS    CL3 0                  LABEL IDENTIFIER
VOLNO    DS    CL1 0                  VOLUME LABEL NUMBER
VOLSERNO DS    CL6 0
VOLSEC   DS    CL1 0
         DS    0CL10 0                RESERVED
VOLVTOC  DS    CL5 0
         DS    CL5 0
         DS    CL10 0       RESERVED
         DS    CL10 0       RESERVED
VOLOWNER DS    CL10 0       OWNER NAME AND ADDRESS CODE
         DS    CL29 0       RESERVED
         SPACE 1
*                      FILE LABEL 1
         SPACE 1
         ORG   DXLBL
FL1LABI  DS    CL3 0        LABEL IDENTIFIER
FL1NO    DS    CL1 0        FILE LABEL NUMBER
FL1ID    DS    CL17 0       FILE IDENTIFIER
FL1FILSR DS    CL6 0        FILE SERIAL NUMBER
FL1VOLSQ DS    CL4 0        VOLUME SEQUENCE NUMBER
FL1FILSQ DS    CL4 0        FILE SEQUENCE NUMBER
FL1GNO   DS    CL4 0        GENERATION NUMBER
FL1VNG   DS    CL2 0        VERSION NUMBER OF GENERATION
FL1CREDT DS    CL6 0        CREATION DATE
FL1EXPDT DS    CL6 0        EXPIRATION DATE
FL1FSEC  DC    C'0' 0       FILE SECURITY INDICATOR
FL1BLKCT DS    CL6 0        BLOCK COUNT
FL1SYSCD DS    CL13 0       SYSTEM CODE
FL1RES   DS    0CL7 0       RESERVED FOR FUTURE USE
         DS    CL1
FL1RES1  DS    CL6
         SPACE 1
*                      FILE LABEL 2
         SPACE 1
         ORG   FL1ID
FL2RECFM DS    CL1 0        RECORD FORMAT
FL2BLKL  DS    CL5 0        BLOCK LENGTH
FL2LRECL DS    CL5 0        BLOCKING FACTOR/RECORD LENGTH
FL2DEN   DS    CL1 0        DENSITY
FL2FILP  DS    CL1 0        FILE POSITION
FL2JSID  DS    0CL17 0      JOB/STEP IDENTIFICATION
FL2JOBD  DS    CL8 0        JOB IDENTIFICATION
FL2JSSP  DC    C'/' 0       SLASH
FL2STEPD DS    CL8 0        STEP IDENTIFICATION
FL2TRTCH DS    CL2 0        TAPE RECORDING TECHNIQUE
FL2CNTRL DS    CL1 0        CARRIAGE CONTROL CHARACTER
         DS    CL1 0        RESERVED FOR FUTURE USE
FL2BLKA  DS    CL1 0        BLOCK ATTRIBUTE
FL2RES   DS    CL41 0       RESERVED FOR FUTURE USE
         SPACE 1
*                      DATA SET CONTROL BLOCK
         SPACE 1
         ORG   DXLBL
DXDSCB   DS    0CL96
DSCFMTID DC    C'1'
DSCFILSR DS    CL6 0        FILE SERIAL NUMBER
DSCVOLSR DS    CL2 0
DSCCREDT DS    CL3 0        CREATION DATE IN DISCONTINUOUS BIN
DSCEXPDT DS    CL3 0        EXPIRATION DATE IN DISCONTINUOUS BIN
DSCNOEXT DS    CL1
DSCBLDBL DS    CL1
         DS    CL1
DSCSYSCD DS    CL13 0       SYSTEM CODE
         DS    CL7
DSCFILTY DS    CL2 0        FILE TYPE
DSCRECFM DS    CL1 0        RECORD FORMAT
DSCOPTCD DS    CL1 0        OPTION CODE
DSCBLKL  DS    CL2 0        BLOCK LENGTH
DSCLRECL DS    CL2 0        RECORD LENGTH
DSCKEYL  DS    CL1 0        KEY LENGTH
DSCRKP   DS    CL2 0        KEY LOCATION
DSCDSIND DS    CL1
DSCSCALO DS    CL4
DSCLSTAR DS    CL5
DSCTRBAL DS    CL2
DSCEXTYP DS    CL1 0        EXTENT TYPE INDICATOR
DSCEXTSQ DS    CL1 0        EXTENT SEQUENCE NUMBER
DSCLOWLM DS    CL4
DSCUPPLM DS    CL4
DSCEXT1  DS    CL10
DSCEXT2  DS    CL10
DSCNEXT  DS    CL5 0        POINTER TO NEXT RECORD
DSCCORE  DS    CL4 0        CORE ADDRESS OF NEXT DSCB RECORD
DSCBEND  EQU   *
         SPACE 1
*                      DATA SET CONTROL BLOCK -FORMAT 3- KEY PORTION
         SPACE 1
         ORG   DXDSCB
DXDSCB3K DS    0CL40
DSCBF3C  DC    X'03030303'
DSCBEXSK DS    0CL40
DSCBEXTY DS    CL1 0        EXTENT TYPE INDICATOR
DSCBEXSQ DS    CL1 0        EXTENT SEQUENCE NUMBER
DSCBLLMT DS    CL4 0        CCHH LOWER LIMIT
DSCBULMT DS    CL4 0        CCHH UPPER LIMIT
DSCBEX2  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX3  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX4  DS    CL10 0       ADDITIONAL EXTENT
         SPACE 1
*                      DATA SET CONTROL BLOCK -FORMAT 3- RECORD PORTION
         SPACE 1
         ORG   DXDSCB
DSCBFMID DC    C'3' 0       FORMAT ID
DSCBEXSD DS    0CL90 0      ADDITIONAL EXTENTS
DSCBEX5  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX6  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX7  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX8  DS    CL10 0       ADDITIONAL EXTENT
DSCBEX9  DS    CL10 °8      ADDITIONAL EXTENT
DSCBEXA  DS    CL10 0       ADDITIONAL EXTENT
DSCBEXB  DS    CL10 0       ADDITIONAL EXTENT
DSCBEXC  DS    CL10 0       ADDITIONAL EXTENT
DSCBEXD  DS    CL10 0       ADDITIONAL EXTENT
DSCBNEXT DS    CL5 0        CCHHR OF NEXT FORMAT 3 DSCB
         SPACE 1
*                      MESSAGE AREA
         SPACE 1
         ORG   DXDSCB
REPLYLTH DS    CL1
REPLYADR DS    CL3
REPLYECB DS    CL4
MSGLSTSZ DS    CL2 0        MSG LENGTH
MCSFLAGS DS    CL2 0        FLAG FIELD FOR MCS
MESSAGEA DS    CL68 0       MESSAGE AREA
DESCODE  DS    CL2 0        DESCRIPTOR CODE FOR MCS
ROUTCODE DS    CL2 0        ROUTING CODE FOR MCS
REPLY    DS    CL12 0       REPLY AREA
*
         ORG   MESSAGEA
*
*              DEFINITION OF LENGTH OF MESSAGE COMPONENTS
MSERL    EQU   3 0          MESSAGE SERIAL NUMBER LENGTH
MINSTL   EQU   6 0          MSG INSTRUCTION LTH INC MSG SER
MUNL     EQU   3 0          MESSAGE UNIT NAME LENGTH
MVOLL    EQU   6 0          MESSAGE VOLUME SERIAL LENGTH
* MTXTL        LENGTH MAY BE DEFINED BY EACH MODULE TO FIT REQUIREMENT
* MSGLTH       LENGTH OF FULL MSG DEFINED BY EACH MODULE
*              MESSAGE FORMAT IS 'IEC000A M 000,00000  (TEXT)     '
MSGIOSUP DC    CL3'IEC'     I/O SUPPORT MESSAGE IDENTITY
MSGSER   DS    0CL3 0       MESSAGE SERIAL NUMBER
         ORG   MSGSER+MSERL-1
MSGSERLO DS    CL1 0        VOLUME SERIAL LO ORDER BYTE
         ORG   MSGSER
MSGINSTR DC    CL6'000A M'  MESSAGE INSTRUCTION INCL MSGSER
         ORG   MSGINSTR+MINSTL-1
MSGACTN  DS    CL1 0        MESSAGE ACTION REQD BY OPERATOR
         DC    C' '
MSGUN    DC    CL3'000' 0   UNIT NAME THAT MSG REFERS TO
         DC    C','
MSGVOLSR DC    CL6'000000'  VOLUME SERIAL THAT MSG REFERS TO
         DC    C','
MSGTEXT  DS    0CL38
         SPACE 1
*                      JOB FILE CONTROL BLOCK
         SPACE 1
         ORG   DSCBEND
DXJBF    DS    0CL176
         IEFJFCBN
         SPACE 1
*                      EVENT CONTROL BLOCK
         SPACE 1
DXECB    DS    0CL4
         DC    X'00000000'
         SPACE 1
*                      INPUT/OUTPUT BLOCK
         SPACE 1
DXIOB    DS    0CL32
IOBFLAG1 DC    X'00'
IOBFLAG2 DC    X'00'
IOBSENSE DS    0H
IOBSENS0 DS    CL1
IOBSENS1 DS    CL1 0        SENSE BYTE 1
IOBECBPT DS    XL1
         DC    AL3(DXECB)
IOBCSW   DS    0D
IOBCOMAD DC    X'00000000'  KEY,0000,COMMAND ADDRESS
IOBSTAT0 DC    X'00' 0      STATUS BYTE 0
IOBSTAT1 DC    X'00' 0      STATUS BYTE 1
IOBCNT   DC    X'0000' 0    COUNT
IOBSIOCC DS    XL1
IOBSTART DC    AL3(DXCCW)
IOBWGHT  DS    XL1
IOBDCBPT DC    AL3(DXDCB)
         DS    XL1
         DS    XL3
IOBINCAN DC    X'0000'
IOBERRCT DS    XL2
DXDAADDR DS    D 0          DIRECT ACCESS ADDRESS (MBBCCHHR)
         SPACE 1
*                      DATA EXTENT BLOCK
         SPACE 1
DYYYY    DS    0CL44
DXDEB    EQU   DYYYY-4
DXDEBDEB DC    X'00000000'
DXDEBOFL DS    0CL1
DXDEBIRB DC    X'00000000'
DXDEBSYS DC    X'00000000'
DXDEBUSR DC    X'00000000'
DXDEBECB DC    X'00000000'
DXDEBID  DS    0CL1
DXDEBDCB DC    AL4(DXDCB)
DXDCBAD  EQU   DXDEBDCB
DXDEBAPP DS    CL4
DXDEBMOD DS    0CL1
DXDEBUCB DS    F
DXDEBBIN DS    H
DXDEBSCC DS    H
DXDEBSHH DS    H
DXDEBECC DS    H
DXDEBEHH DS    H
DXDEBNTR DS    H
         SPACE 1
*                      DATA CONTROL BLOCK
         SPACE 1
DXXXX    DS    0F
DXDCB    EQU   DXXXX-44 0   POINTER TO RELATIVE BEGINNING OF DCB
DXDCBDEB DC    A(DXDEB)
         SPACE 1
*                      CHANNEL CONTROL WORDS
         SPACE 1
         CNOP  0,8
DXCCW    DS    0CL96
DXCCW1   DS    D
DXCCW2   DS    D
DXCCW3   DS    D
DXCCW4   DS    D
DXCCW5   DS    D
DXCCW6   DS    D
DXCCW7   DS    D
DXCCW8   DS    D
DXCCW9   DS    D
DXCCW10  DS    D
DXCCW11  DS    D
DXCCW12  DS    D
         SPACE 1
DSECTSIZ EQU   464 0        CORE AREA REQUIRED FOR THIS MACRO
         MEND
