         MACRO
&NAME    IEFJFCBN
         AIF   ('&NAME' EQ '').NONAME
&NAME    EQU   *
         AGO   .NEXT
.NONAME  ANOP
INFMJFCB EQU   *
.NEXT    ANOP
JFCBDSNM DS    CL44 0   DATA SET NAME
JFCBELNM DS    CL8 0    ELEMENT NAME OR VERSION
JFCBTSDM DS    CL1 0    TASK SCHEDULER - DATA
*                       MANAGEMENT INTERFACE BYTE
JFCBSYSC DS    0CL13 0  SYSTEM CODE
JFCBDSCB DS    CL3
JFCFCBID DS    CL4 0    FCB IMAGE ID
JFCAMPTR DS    CL3
JFCRDBPT DS    CL3
JFCBLTYP DS    CL1 0    LABEL TYPE AND USER'S-LABEL
*                       INDICATOR
JFCBUFOF DS    CL1 0    BUFFER OFFSET FOR TAPE DATA SETS
JFCBFLSQ DS    CL2 0    FILE SEQUENCE NUMBER
JFCBVLSQ DS    CL2 0    VOLUME SEQUENCE NUMBER
JFCBMASK DS    CL8 0    DATA MANAGEMENT MASK
JFCBCRDT DS    CL3 0    DATA SET CREATION DATE
JFCBXPDT DS    CL3 0    DATA SET EXPIRATION DATE
JFCBIND1 DS    CL1 0    INDICATOR BYTE 1
JFCBRLSE EQU   64 0      BITS 0 AND 1 - EXTERNAL
*                        STORAGE RELEASE INDICATOR
JFCBLOCT EQU   16 0      BITS 2 AND 3 - DATA SET
*                        HAS BEEN LOCATED
JFCBNEWV EQU   4 0       BITS 4 AND 5 - NEW VOLUME
*                        ADDED TO DATA SET
JFCBPMEM EQU   1 0       BITS 6 AND 7 - DATA SET IS
*                        A MEMBER OF A PODS OR GDG
JFCBIND2 DS    CL1 0    INDICATOR BYTE 2
JFCBSTAT EQU   64 0      BITS 0 AND 1 - DATA SET
*                        STATUS (NEW, OLD, OR MOD)
JFCBSCTY EQU   16 0      BITS 2 AND 3 - DATA SET
*                        SECURITY INDICATOR
JFCBUFNO DS    0AL1
JFCBUFRQ DS    AL1
JFCBFTEK DS    0BL1
JFCBFALN DS    BL1
JFCBUFL  DS    AL2
JFCEROPT DS    BL1
JFCTRTCH DS    0BL1
JFCKEYLE DS    0AL1
JFCMODE  DS    0BL1
JFCCODE  DS    0BL1
JFCSTACK DS    0BL1
JFCPRTSP DS    BL1
JFCDEN   DS    BL1
JFCLIMCT DS    AL3
JFCDSORG DS    BL2
JFCRECFM DS    BL1
JFCOPTCD DS    BL1
JFCBLKSI DS    AL2
JFCLRECL DS    AL2
JFCNCP   DS    AL1
JFCNTM   DS    AL1
JFCUCSID DS    0CL4 0   UCS ID
JFCRKP   DS    AL2
JFCCYLOF DS    AL1
JFCDBUFN DS    AL1
JFCUCSOP DS    0CL1 0   UCS OPTIONS
JFCINTVL DS    AL1
JFCCPRI  DS    BL1
JFCSOWA  DS    AL2
JFCBNTCS DS    CL1 0    NUMBER OF OVERFLOW TRACKS
JFCBNVOL DS    CL1 0    NUMBER OF VOLUME SERIAL NUMBERS
JFCBVOLS DS    CL30 0   VOLUME SERIAL NUMBERS (THE FIRST FIVE)
JFCBEXTL DS    CL1 0    LENGTH OF BLOCK OF EXTRA
*                       VOLUME SERIAL NUMBERS
*                       (BEYOND FIVE)
JFCBEXAD DS    CL3 0    TRACK ADDRESS OF BLOCK OF
*                       EXTRA VOLUME SERIAL NUMBERS
JFCBPQTY DS    CL3 0    PRIMARY QUANTITY OF D.A. STORAGE REQUIRED
JFCBCTRI DS    CL1 0    INDICATES WHETHER CYLINDERS, TRACKS, OR RECORDS
*                       ARE SPECIFIED IN JFCBPQTY AND JFCBSQTY
JFCBSQTY DS    CL3 0    SECONDARY QUANTITY OF D.A. STORAGE REQUIRED
JFCBIND3 DS    CL1 0    INDICATOR BYTE 3
JFCBCNTG EQU   64 0     BITS 0 AND 1 - CONTIGUOUS STORAGE INDICATOR
JFCBMXIG EQU   16 0     BITS 2 AND 3 - MAXIMUM
*                       AVAILABLE EXTENT INDICATOR
JFCBALXI EQU   4 0      BITS 4 AND 5 - ALL EXTENTS INDICATOR
JFCBRNDC EQU   1 0      BITS 6 AND 7 - ROUND CYLINDER INDICATOR
JFCBDQTY DS    CL3 0    QUANTITY OF D.A. STORAGE
*                       REQUIRED FOR A DIRECTORY
JFCBSPNM DS    CL3 0    CORE ADDRESS OF THE JFCB
*                       WITH WHICH CYLINDERS ARE SPLIT
JFCBABST DS    CL2 0    RELATIVE ADDRESS OF FIRST
*                       TRACK TO BE ALLOCATED
JFCBSBNM DS    CL3 0    CORE ADDRESS OF THE JFCB
*                       FROM WHICH SPACE IS TO BE SUBALLOCATED
JFCBDRLH DS    CL3 0    AVERAGE DATA RECORD LENGTH
JFCBVLCT DS    CL1 0    VOLUME COUNT
JFCBSPTN DS    CL1 0    NUMBER OF TRACKS PER CYLINDER TO BE USED BY
*                       THIS DATA SET WHEN SPLIT CYLINDERS IS INDICATED
JFCBLGTH EQU 176 0   LENGTH OF JFCB
JFCBEND  EQU   *
         MEND
