//IEFW21SD JOB (1580,5),'0252 LNK AFTER IOGEN',CLASS=N
//*
//*  RELINK  IEFW21SD INTO MLPALIB AFTER IOGEN TO GET NEW DEVICE TABLES
//*
//STEP01       EXEC LKED,REGION=900K,
//        PARM='SYSLMOD,IEWL,NCAL,LIST,XREF,RENT,REUS,SIZE=(600K,64K)'
//SYSLMOD      DD   DSN=SYS1.LPALIB,DISP=SHR,UNIT=3330,VOL=SER=IPOR01
//SYSPUNCH     DD   DSN=SYS1.OBJPDS01,DISP=SHR,UNIT=3330,VOL=SER=IPOR01
//OLDLPA       DD   DSN=SYS1.LPALIB,DISP=SHR,UNIT=3330,VOL=SER=TPOR01
 INCLUDE SYSPUNCH(IEFEDTTB)
 INCLUDE SYSPUNCH(IEFSGOPT)
 INCLUDE OLDLPA(IEFW21SD)                                              0
      ORDER IEFDB400
      ORDER IEFDB401
      ORDER IEFAB4F7(P)
      ORDER IEFAB4F6
      ORDER IEFDB4FF
      ORDER IEFDB4FC
      ORDER IEFDB4FA
      ORDER IEFDB410(P)
      ORDER IEFDB412
      ORDER IEFDB411
      ORDER IEFAB4DC
      ORDER IEFDB417
      ORDER IEFAB4E9
      ORDER IEFAB445
      ORDER IEFDB413
      ORDER IEFDB414
      ORDER IEFDB418
      ORDER IEFDB4FE
      ORDER IEFDB4F9
      ORDER IEFDB4F8
      ORDER IEFDB4FD
      ORDER IEFDB480
      ORDER IEFDB481
      ORDER IEFDB4A0
      ORDER IEFDB4A1
      ORDER IEFDB470
      ORDER IEFDB450
      ORDER IEFDB460
      ORDER IEFDB490
      ORDER IEFBB401
      ORDER IEFAB4FE
      ORDER IEFBB402
      ORDER IEFBB404
      ORDER IEFBB4M3
      ORDER IEFAB451
      ORDER IEFAB452
      ORDER IEFAB453
      ORDER IEFAB470
      ORDER IEFAB454
      ORDER IEFAB457
      ORDER IEFAB464
      ORDER IEFAB459
      ORDER IEFAB421
      ORDER IEFAB427
      ORDER IEFAB431
      ORDER IEFAB423
      ORDER IEFAB424
      ORDER IEFAB425
      ORDER IEFAB426
      ORDER IEFAB430
      ORDER IEFAB433
      ORDER IEFAB436(P)
      ORDER IEFAB440(P)
      ORDER IEFAB4F0
      ORDER IEFAB434(P)
      ORDER IEFAB428
      ORDER IEFAB4FC
      ORDER IEFAB435(P)
      ORDER IEFAB441
      ORDER IEFAB442
      ORDER IEFAB432
      ORDER IEFAB490
      ORDER IEFAB4F3
      ORDER IEFAB4FD
      ORDER IEFAB471(P)
      ORDER IEFAB4FA(P)
      ORDER IEFAB473(P)
      ORDER IEFAB4M5
      ORDER IEFAB4F9
      ORDER IEFAB4F8
      ORDER IEFAB475
      ORDER IEFAB476
      ORDER IEFAB480
      ORDER IEFAB4F2(P)
      ORDER IEFAB492
      ORDER IEFAB493
      ORDER IEFAB494(P)
      ORDER IEFAB495
      ORDER IEFBB410(P)
      ORDER IEFBB412
      ORDER IEFBB414
      ORDER IEFBB416
      ORDER IEFAB4EC
      ORDER IEFAB4A0
      ORDER IEFAB4A2(P)
      ORDER IEFAB4A4(P)
      ORDER IEFAB4A6
      ORDER IEFAB4A8
 ALIAS IGC0009I
 ALIAS IEFAB4DC
 ALIAS IEFBB410
 ALIAS IEFAB49C
 ALIAS IEFAB4F5
 ALIAS IEFAB4F4
 ALIAS IEFAB4UV
 ALIAS IEFAB445
 ALIAS IEFAB4EC
 ENTRY IEFBB401
 NAME IEFW21SD(R)
