//IPORREST     JOB  (1582,5),'RESTORE IPOR20',CLASS=T,COND=(0,NE)
/*JOBPARM      TIME=60
//S0   EXEC   PGM=IEHDASDR
//*
//*            RESTORE IPOR TAPES TO DISK
//*
//SYSPRINT     DD   SYSOUT=A
//TAPE         DD   DSN=IPOR.TAPES,DISP=OLD,
//             UNIT=(TAPE,1),VOL=SER=(IPOR21,IPOR22),DCB=DEN=3,
//             LABEL=(,NL)
//DISK         DD   UNIT=3330-1,VOL=SER=TPOR01,DISP=OLD
//SYSIN        DD   *
     RESTORE   FROMDD=TAPE,TODD=DISK,PURGE=YES,CPYVOLID=YES
/*
//S1 EXEC PGM=AMASPZAP
//*
//*            ZAP TO RECLAIM SECOND HALF OF DOUBLE DENSITY DISK
//*
//SYSLIB DD DSN=FORMAT4.DSCB,VOL=SER=IPOR20,DISP=OLD,UNIT=3330-1
//SYSPRINT DD SYSOUT=A
//SYSIN DD *
 CCHHR 0001000001
 VER 0034 0194      1ST ALT TRK 404 0
 REP 0034 0328      1ST ALT TRK 808 0
 VER 003A 00        CHECK IF OK ON PACK (04=DIRF,08=DOSCNVRT)
 REP 003A 80        SET DOS BIT
 VER 003E 019B      TOTAL CYLS MODEL1
 REP 003E 032F      TOTAL CYLS MODEL11
/*
//S2 EXEC PGM=IEFBR14
//ANY DD DSN=ANY,VOL=SER=IPOR20,DISP=NEW,UNIT=3330-1,SPACE=(CYL,(40))
/*
//S3 EXEC PGM=AMASPZAP
//SYSLIB DD DSN=FORMAT4.DSCB,VOL=SER=IPOR20,DISP=OLD,UNIT=3330-1
//SYSPRINT DD SYSOUT=A
//SYSIN DD *
 CCHHR 0001000001
 VER 003A 08        DOS CONVERT BIT (SHOULD BE ON NOW)
 REP 003A 00        REMOVE IT
//S4           EXEC PGM=MAPDISK,REGION=128K
//*
//*            MAP OF DISK PACK
//*
//SYSPRINT     DD   SYSOUT=A
//SYSOUT       DD   SYSOUT=A
//DD1          DD   UNIT=3330-1,VOL=SER=IPOR20,DISP=OLD
