//JES2B404  EXEC RELEASE,JOB=JES2B404                                   JCL40401
//JES2B404 JOB (1192,5),'0222 JES2B404 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL40402
//JES2B404  EXEC HASPASM,MODULE=JES2B404,ASMBLR=ASMH                    JCL40403
