//JES2B004  EXEC RELEASE,JOB=JES2B004                                   JCL00401
//JES2B004 JOB (1192,5),'0222 JES2B004 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL00402
//JES2B004  EXEC HASPASM,MODULE=JES2B004,ASMBLR=ASMH                    JCL00403
