//JES2B336  EXEC RELEASE,JOB=JES2B336                                   JCL33601
//JES2B336 JOB (1192,5),'0222 JES2B336 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL33602
//JES2B336  EXEC HASPASM,MODULE=JES2B336                                JCL33603
