//JES2B207  EXEC RELEASE,JOB=JES2B207                                   JCL20701
//JES2B207 JOB (1192,5,,,,,,999,9999,9999),'0222 JES2B207 ASMBLY',     CJCL20702
//             CLASS=N,TYPRUN=HOLD                                      JCL20703
//JES2B207  EXEC HASPASM,MODULE=JES2B207,ASMBLR=ASMH                    JCL20704
