//JES2    PROC OPT=PRODPM41,                                           C
//             MODS=PRODMS41,                                          C
//             ALTMEM=JES2PARM,                                        C
//             STEPLIB='SYS1.JES2R41',                                 C
//             PROCVOL=DLIB01,                                         C
//             CONTROL='JES2.CONTRLIB'
//IEFPROC EXEC PGM=HASJES20,DPRTY=(15,15),TIME=1440,PERFORM=9
//STEPLIB   DD DSN=&STEPLIB,DISP=SHR
//*
//*      IMPORTANT NOTE:-
//*       UNDER NO CIRCUMSTANCES REMOVE THE UNIT AND VOLUME
//*      INFORMATION FROM THE REFERENCES TO TEST AND REMOTE PROCLIBS,
//*      BECAUSE THE TEST AND REMOTE INDEX LEVELS DO NOT RESIDE ON
//*      THE VSAM MASTER CATALOG, AND ALLOCATION WILL ABEND.  THUS,
//*      IF THE UNIT AND VOLUME INFORMATION IS REMOVED, THEN THE MVS
//*      SYSTEM IS UN-IPLABLE, AND YOU WILL BE A DEAD DUCK.
//*
//PROC00    DD DSN=SYS1.PROCLIB,DISP=SHR,UNIT=3330-1,VOL=SER=&PROCVOL
//          DD DSN=TEST.PROCLIB,DISP=SHR,UNIT=3330-1,VOL=SER=&PROCVOL
//          DD DSN=REMOTE.PROCLIB,DISP=SHR,UNIT=3330-1,VOL=SER=&PROCVOL
//          DD DSN=BP.PROCLIB,DISP=SHR,UNIT=3330-1,VOL=SER=&PROCVOL
//PROC01    DD DSN=SYS1.PROCLIB,DISP=SHR,UNIT=3330-1,VOL=SER=IPOR01
//HASPPARM  DD DSN=&CONTROL.(&OPT),DISP=SHR,FREE=CLOSE
//ALTPARM   DD DSN=SYS1.PARMLIB(&ALTMEM),DISP=SHR
//HASPLIST  DD DDNAME=IEFRDER
//MODPRINT  DD DSN=JES2.MODPRINT,DISP=SHR,FREE=CLOSE
//MODPARMS  DD DSN=&CONTROL.(&MODS),DISP=SHR,FREE=CLOSE
//* NOTE TO FIND ERROR IN JES2PARM ---> S JES2,00E (00E OR ANY PRINTER)
