//JES2CON  EXEC RELEASE,JOB=JES2CON                                     JCLL0110
//*                                                                     JCLL0120
//JES2CON  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2CON ASMBLY',      CJCLL0130
//             CLASS=N,TYPRUN=HOLD                                      JCLL0140
//JES2CON EXEC HASPASM,MODULE=HASPCON                                   JCLL0150
