//JES2B304  EXEC RELEASE,JOB=JES2B304                                   JCL30401
//JES2B304 JOB (1192,5),'0222 JES2B304 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL30402
//JES2B304  EXEC HASPASM,MODULE=JES2B304                                JCL30403
