//JES2B313  EXEC RELEASE,JOB=JES2B313                                   JCL31301
//JES2B313 JOB (1192,5),'0222 JES2B313 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL31302
//JES2B313  EXEC HASPASM,MODULE=JES2B313,ASMBLR=ASMH                    JCL31303
