//JES2S405  EXEC RELEASE,JOB=JES2S405                                   JCL40501
//JES2S405 JOB (1192,5),'0222 JES2S405 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL40502
//JES2S405  EXEC HASPASM,MODULE=JES2S405,ASMBLR=ASMH                    JCL40503
