//JES2ACCT  EXEC RELEASE,JOB=JES2ACCT                                   JCLA0110
//*                                                                     JCLA0120
//JES2ACCT  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2ACCT ASMBLY',    CJCLA0130
//             CLASS=N,TYPRUN=HOLD                                      JCLA0140
//JES2ACCT EXEC HASPASM,MODULE=HASPACCT                                 JCLA0150
