//JES2B201  EXEC RELEASE,JOB=JES2B201                                   JCL20101
//JES2B201 JOB (1192,5),'0222 JES2B201 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL20102
//JES2B201  EXEC HASPASM,MODULE=JES2B201                                JCL20103
