//JES2B604  EXEC RELEASE,JOB=JES2B604                                   JCL60401
//JES2B604 JOB (1192,5),'0222 JES2B604 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL60402
//JES2B604  EXEC HASPASM,MODULE=JES2B604                                JCL60403
