//JES2B612  EXEC RELEASE,JOB=JES2B612                                   JCL61201
//JES2B612 JOB (1192,5),'0222 JES2B612 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL61202
//JES2B612  EXEC HASPASM,MODULE=JES2B612                                JCL61203
