//JES2DOC  EXEC RELEASE,JOB=JES2DOC                                     JCLD0110
//*                                                                     JCLD0120
//JES2DOC  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2DOC ASMBLY',      CJCLD0130
//             CLASS=N,TYPRUN=HOLD                                      JCLD0140
//JES2DOC EXEC HASPASM,MODULE=HASPDOC                                   JCLD0150
