         SPACE 1                                                 *AJCT* EB296010
AJCTEXT  EQU   *                   MONSANTO EXTENSIONS TO JCT    *AJCT* EB296020
* THIS EXTENSION IMMEDIATELY PRECEDES THE EQUATE JCTEND          *AJCT* EB296030
         SPACE 1                                                 *AJCT* EB296040
         DS    0F                  ENSURE FULLWORD ALIGNMENT     *AJCT* EB296050
         DS    10F                 RESERVED FOR FUTURE EXPANSION *AJCT* EB296200
AJCTFLAG DS    C                   MONSANTO FLAG BYTE            *AJCT* EB296500
AJCTMAJC DS    CL3                 MAJOR COST CENTRE             *AJCT* EB296510
AJCTMINC DS    CL2                 MINOR COST CENTRE             *AJCT* EB296520
AJCTENT  DS    CL2                 ENTITY CODE                   *AJCT* EB296530
AJCTNLPR DS    BL4                 NUMBER OF LINES PRINTED       *AJCT* EB296540
AJCTPRST DS    BL4                 PRINTER START TIME            *AJCT* EB296550
AJCTPRSD DS    PL4                 PRINTER START DATE            *AJCT* EB296560
AJCTPRET DS    BL4                 PRINTER END TIME              *AJCT* EB296570
AJCTPRED DS    PL4                 PRINTER END DATE              *AJCT* EB296580
         DS    CL32                RESERVED FOR FUTURE EXPANSION *AJCT* EB296800
         SPACE 1                                                 *AJCT* EB296940
AJCTEXTE EQU   *                   END OF MONSANTO EXTENSION     *AJCT* EB296950
AJCTEXTL EQU   *-AJCTEXT           LENGTH OF MONSANTO EXTENSION  *AJCT* EB296960
*                                  ( SHOULD BE 100 DECIMAL )     *AJCT* EB298970
*                                  ( COLD START REQUIRED IF NOT )*AJCT* EB296980
         SPACE 1                                                 *AJCT* EB296990
