//JES2XEQ  EXEC RELEASE,JOB=JES2XEQ                                     JCLU0110
//*                                                                     JCLU0120
//JES2XEQ  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2XEQ ASMBLY',      CJCLU0130
//             CLASS=N,TYPRUN=HOLD                                      JCLU0140
//JES2XEQ EXEC HASPASM,MODULE=HASPXEQ                                   JCLU0150
