//JES2B308  EXEC RELEASE,JOB=JES2B308                                   JCL30801
//JES2B308 JOB (1192,5),'0222 JES2B308 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL30802
//JES2B308  EXEC HASPASM,MODULE=JES2B308                                JCL30803
