//JES2PRPU  EXEC RELEASE,JOB=JES2PRPU                                   JCLQ0110
//*                                                                     JCLQ0120
//JES2PRPU  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2PRPU ASMBLY',    CJCLQ0130
//             CLASS=N,TYPRUN=HOLD                                      JCLQ0140
//JES2PRPU EXEC HASPASM,MODULE=HASPPRPU                                 JCLQ0150
