//JES2RM08  EXEC RELEASE,JOB=JES2RM08                                   RMT08110
//JES2RM08 JOB (1192,5),'0222 JES2RM08 ASMBLY',CLASS=N,TYPRUN=HOLD      RMT08120
/*JOBPARM      TIME=999,LINES=9999,CARDS=9999                           RMT08122
//JES2RM08  EXEC JES2RMTS,REMOTE=8                                      RMT08130
//OPTIONS      DD *                                                     RMT08140
$.RMTSYS3,8                        LINGEN                               RMT08150
&MACHSIZ=8192                      8K MACHINE                           RMT08160
&S3FORML=72                        LINES PER PAGE                       RMT08170
-INC JES2SYS3                                                           RMT0818%
$.RMTEND                                                                RMT08190
