//JES2B324  EXEC RELEASE,JOB=JES2B324                                   JCL32401
//JES2B324 JOB (1192,5),'0222 JES2B324 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL32402
//JES2B324  EXEC HASPASM,MODULE=JES2B324                                JCL32403
