//JES2B702  EXEC RELEASE,JOB=JES2B702                                   JCL70201
//JES2B702 JOB (1192,5),'0222 JES2B702 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL70202
//JES2B702  EXEC HASPASM,MODULE=JES2B702,ASMBLR=ASMH                    JCL70203
