//JES2SSSM  EXEC RELEASE,JOB=JES2SSSM                                   JCLT0110
//*                                                                     JCLT0120
//JES2SSSM  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2SSSM ASMBLY',    CJCLT0130
//             CLASS=N,TYPRUN=HOLD                                      JCLT0140
//JES2SSSM EXEC HASPASM,MODULE=HASPSSSM                                 JCLT0150
