//JES2B316  EXEC RELEASE,JOB=JES2B316                                   JCL31601
//JES2B316 JOB (1192,5),'0222 JES2B316 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL31602
//JES2B316  EXEC HASPASM,MODULE=JES2B316                                JCL31603
