//JES2B320  EXEC RELEASE,JOB=JES2B320                                   JCL32001
//JES2B320 JOB (1192,5),'0222 JES2B320 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL32002
//JES2B320  EXEC HASPASM,MODULE=JES2B320                                JCL32003
