//JES2B303  EXEC RELEASE,JOB=JES2B303                                   JCL30301
//JES2B303 JOB (1192,5),'0222 JES2B303 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL30302
//JES2B303  EXEC HASPASM,MODULE=JES2B303                                JCL30303
