//JES2MISC  EXEC RELEASE,JOB=JES2MISC                                   JCLN0110
//*                                                                     JCLN0120
//JES2MISC  JOB (1195,5,,,,,,999,9999,9999),'0222 JES2MISC ASMBLY',    CJCLN0130
//             CLASS=N,TYPRUN=HOLD                                      JCLN0140
//JES2MISC EXEC HASPASM,MODULE=HASPMISC                                 JCLN0150
