//JES2B332  EXEC RELEASE,JOB=JES2B332                                   JCL33201
//JES2B332 JOB (1192,5),'0222 JES2B332 ASMBLY',CLASS=N,TYPRUN=HOLD      JCL33202
//JES2B332  EXEC HASPASM,MODULE=JES2B332                                JCL33203
