//JOE?%%%  JOB (1195,5),'1195 JOE',CLASS=N
//STEP01       EXEC SYSUPDTE,FILE=MVS,
// LIB1='JES2.GENLIB'
//SYSIN DD DATA,DLM='??'
-OPT NOLIST,NOPC,EXEC(R)
-DLM ====?%%%,?%%%
-EMOD
-ADD ====?%%%,?%%%,SEQ=/81,6,10,10/
-DESC &COM
-PGMR JES2.GENLIB
-INC ====?%%%                                                           0000020%
-EMOD
-END
??
//JES2?%%%  EXEC RELEASE,JOB=JES2?%%%
//JES2?%%% JOB (1192,5),'0222 JES2?%%% ASMBLY',CLASS=N,TYPRUN=HOLD
//JES2?%%%  EXEC HASPASM,MODULE=JES2?%%%,ASMBLR=ASMH
//NEXTJOB EXEC RELEASE,JOB=JESL?%%%
//JESL?%%%  JOB (1192,5),'0222 FOR J. NOLS',CLASS=N,TYPRUN=HOLD
//JESMLINK PROC
//MODS    EXEC PGM=SHARDISK,PARM=(SYSLMOD,IEWL,LIST,LET,XREF),         C
//             REGION=256K
//SYSPRINT DD  SYSOUT=A
//SYSUDUMP DD  SYSOUT=A
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(3,3))
//SYSLIB   DD  DSN=JES2.OBJECT,DISP=SHR
//JES2     DD  DSN=JES2.OBJECT,DISP=SHR
//SYSLIN   DD  DDNAME=SYSIN
//SYSIN    DD  DSN=JES2.GENLIB(GENLKED),DISP=SHR
//SYSLMOD  DD  DSN=JES2.TESTLIB,DISP=SHR
//       PEND
//JESA   EXEC  JESMLINK
//MODS.SYSIN DD *
 INCLUDE JES2(JES2?%%%)
 NAME JES2?%%%(R)
/*
