//JESADSNS  JOB (1580,5),'0222 JESADSNS ALLOCN',CLASS=N
/*JOBPARMS     LINES=9999,TIME=15
//PREVENT EXEC PGM=IEFBR14
//SYSIN DD DATA,DLM='$$'
//SCRA EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=A
//DISK DD UNIT=DISK,VOL=SER=MVSPCK,DISP=SHR
//SYSIN DD *
 SCRATCH DSNAME=SYS1.HASPACE,VOL=DISK=MVSPCK
 SCRATCH DSNAME=SYS1.HASPCKPT,VOL=DISK=MVSPCK
 SCRATCH DSNAME=JES2.MODPRINT,VOL=DISK=MVSPCK
 UNCATLG DSNAME=JES2.MODPRINT
/*
//ALLOCATE EXEC PGM=COPY
//SYSPRINT DD SYSOUT=A
//SPACE DD DSN=SYS1.HASPACE,DISP=(,KEEP),UNIT=DISK,VOL=SER=MVSPCK,
//  LABEL=EXPDT=11111,SPACE=(CYL,20)
//CKPT DD DSN=SYS1.HASPCKPT,DISP=(,KEEP),UNIT=DISK,VOL=SER=MVSPCK,
//   LABEL=EXPDT=11111,SPACE=(CYL,1)
//SYSUT2 DD DSN=JES2.MODPRINT,DISP=(,CATLG),UNIT=DISK,
// DCB=(RECFM=FBM,LRECL=133,BLKSIZE=1330),SPACE=(TRK,(1,1)),
//  VOL=SER=MVSPCK
//CONTRLIB EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=A
//SYSUT2 DD DSN=JES2.CONTRLIB,DISP=(,CATLG),UNIT=3330-1,
//  VOL=SER=IPOR01,SPACE=(TRK,(5,1,5)),
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN DD *
./ ADD NAME=JES2PARMS
* DUMMY
./ ADD NAME=JES2MODS
* DUMMY
/*
//JES2R40 DD DSN=SYS1.JES2R40,DISP=(,CATLG),UNIT=DISK,VOL=SER=IPOR01,
// SPACE=(CYL,(5,2,10)),LABEL=EXPDT=11111,
// DCB=SYS2.TESTLIB
$$
//JES2R40X DD DSN=SYS1.JES2R40X,DISP=(,CATLG),UNIT=DISK,
// VOL=REF=SYS1.JES2R40,DCB=SYS1.JES2R40,LABEL=EXPDT=11111,
// SPACE=(CYL,(2,2,10))
