//JESMLINK  EXEC RELEASE,JOB=JESMLINK                                   JCL95110
//*                                                                     JCL95120
//JESMLINK  JOB (1580,5),'0222 JESMLINK-EDIT',CLASS=N,TYPRUN=HOLD       JCL95130
//JESMLINK PROC                                                         JCL95140
//MODS    EXEC PGM=SHARDISK,PARM=(SYSLMOD,IEWL,LIST,LET,XREF),         CJCL95150
//             REGION=256K                                              JCL95160
//SYSPRINT DD  SYSOUT=A                                                 JCL95170
//SYSUDUMP DD  SYSOUT=A                                                 JCL95180
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(3,3))                             JCL95190
//SYSLIB   DD  DSN=JES2.OBJECT,DISP=SHR                                 JCL95200
//JES2     DD  DSN=JES2.OBJECT,DISP=SHR                                 JCL95210
//SYSLIN   DD  DDNAME=SYSIN                                             JCL95220
//SYSIN    DD  DSN=JES2.GENLIB(GENLKED),DISP=SHR                        JCL95230
//SYSLMOD  DD  DSN=SYS2.TESTLIB,DISP=SHR                                JCL95240
//       PEND                                                           JCL95250
//JESA   EXEC  JESMLINK                                                 JCL95260
/*
//
