//LIBNFRC      JOB  (5860,5),'RESTORE ADR FAIR MOD',CLASS=T
/*MESSAGE      TAPE SUPPLIED WITH JOB. PLEASE RETURN TO PSG.
//STEP01   EXEC   PGM=LIBRARY,PARM='NRJS,NJTA,IEX=IEX'
//*********************************************************************
//*    RECOVER FAIR MODULES FROM DISTRIBUTION TAPE.                 *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//OSJOB        DD   DSN=&&COPY,DISP=(,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,2)),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=960)
//MASTIN       DD   UNIT=TAPE,VOL=SER=LIBRYN,LABEL=(3,NL),DISP=OLD,
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=1000)
//SYSAF01   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSAF02   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSAF03   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSIN   DD   *
_OPT UTILITY,NOCYCLE,NOPC
-OPT LIST,NOEXEC,NOPC
-COPY FAIROS
-COPY FAIRDSCT
-END
//STEP02   EXEC   LIBRARYN,FILE=MVS
//*******************************************************************
//*    ADD FAIR MODULES TO LIBRARYN.MVS.                            *
//*******************************************************************
//SYSIN   DD   DSN=&&COPY,DISP=(OLD,DELETE)
