//LIBNGEN      JOB  (5860,5),'GENERATE',CLASS=T
//*********************************************************************
//*    GENERATE A NEW RELEASE OF LIBRARIAN/VS.                        *
//*          PLEASE CHANGE THE RELEASE NUMBER BEFORE                *
//*          RUNNING THIS JOB. CURRENTLY IT IS '13'.                *
//*********************************************************************
//STEP00   EXEC   PGM=UT434,PARM=' REMOVE DSN=SYS2.LIBVS13,PURGE'
//*********************************************************************
//*    PRECAUTIONARY SCRATCH OF CURRENT DATASETS.                   *
//*********************************************************************
//SYSPRINT   DD   SYSOUT=A
//DISK   DD   VOL=REF=SYS1.SVCLIB,DISP=OLD
//SYSIN   DD   *
     REMOVE  DSN=SYS2.LIBVS13L,PURGE
//STEP01   EXEC     PGM=IEBUPDTE,PARM=NEW
//*********************************************************************
//*    CREATE LIBRARIES TO RECEIVE THE GENERATED LOAD MODULES.      *
//*    RESTORE OBJECT MODULES FROM TAPE TO A TEMPORARY FILE.        *
//*********************************************************************
//LIBRNL       DD   DSN=SYS2.LIBVS13L,DISP=(,CATLG),
//  UNIT=3330,VOL=SER=DLIB01,SPACE=(TRK,(5,1,5)),LABEL=EXPDT=11111,
//             DCB=DSCBLOAD
//LIBRN        DD   DSN=SYS2.LIBVS13,DISP=(,CATLG),
//  UNIT=3330,VOL=SER=DLIB01,SPACE=(TRK,(19,19,5)),LABEL=EXPDT=11111,
//             DCB=DSCBLOAD
//SYSPRINT     DD   DUMMY
//SYSUT2       DD   DSN=PSG.LIBOBJ,DISP=(,PASS),
//             VOL=REF=SYSPK2,SPACE=(1120,(250,50,7),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=1120)
//SYSIN        DD   UNIT=2400,VOL=SER=LIBRYN,LABEL=(,NL),DISP=OLD,
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=3440,DEN=3)
//STEP02   EXEC   PGM=SHARDISK,COND=(0,NE,STEP01),
//********************************************************************
//*    GENERATE LIBRARIAN MAIN MODULE. 'LIBRARY'.                   *
//********************************************************************
//             REGION=208K,
//             PARM='SYSLMOD,IEWL,OVLY,NCAL,LIST,XREF'
//SYSPRINT     DD   SYSOUT=A
//SYSLIN       DD   DSN=PSG.LIBOBJ(RL0001),DISP=(OLD,PASS),
//   VOL=REF=SYSPK2
//SYSLMOD      DD   DSN=SYS2.LIBVS13(LIBRARY),DISP=SHR
//SYSUT1       DD   UNIT=SYSDA,SEP=SYSLMOD,SPACE=(CYL,(5,1))
//RELOC        DD   DSN=PSG.LIBOBJ,DISP=SHR,
//   VOL=REF=SYSPK2
//STEP03   EXEC   PGM=SHARDISK,COND=(0,NE,STEP01),
//*******************************************************************
//*    GENERATE LIBRARIAN LPA MODULE 'EPXVWVZP'.                    *
//*******************************************************************
//             REGION=208K,
//             PARM='SYSLMOD,IEWL,RENT,NCAL,LIST,XREF'
//SYSPRINT     DD   SYSOUT=A
//SYSLIN       DD   DSN=PSG.LIBOBJ(RL0003),DISP=(OLD,PASS),
//   VOL=REF=SYSPK2
//SYSLMOD      DD  DSN=SYS2.LIBVS13L(EPXVWVZP),DISP=SHR
//SYSUT1       DD   UNIT=SYSDA,SEP=SYSLMOD,SPACE=(CYL,(5,1))
//RELOC        DD   DSN=PSG.LIBOBJ,DISP=SHR,
//   VOL=REF=SYSPK2
