//MARK1 JOB (5810,5),'BENCHMARK',CLASS=O
//COPY EXEC PGM=COPY
//SYSPRINT DD DUMMY
//SYSUT1 DD DSN=SYS1.PARMLIB(IEASYS00),DISP=SHR
//SYSUT2 DD DSN=&&RATS,DISP=(,PASS),SPACE=(TRK,(19,19),RLSE),
// UNIT=SYSDA
//COPY EXEC TSGRUN,JOB=MARK1
