//MARK4 JOB (5810,5),'BENCHMARK',CLASS=O
//ASM EXEC PGM=MAPDISK
//SYSOUT DD UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)
//SYSPRINT DD UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)
//DD1 DD UNIT=SYSDA,DSN=&&UGH,DISP=(,PASS),SPACE=(TRK,1)
//COPY EXEC TSGRUN,JOB=MARK4,COND=EVEN
