//MARK3 JOB (5810,5),'BENCHMARK',CLASS=O
//ASM EXEC ASMFCL,L=H
//ASM.SYSIN DD DSN=TSG.SOURCE(UT495),DISP=SHR,UNIT=DISK,VOL=SER=SPOOL1
//COPY EXEC TSGRUN,JOB=MARK3
