//MNTPRVTE JOB (1586,5),'** FOR J. NOLS **',CLASS=N
//STEP01       EXEC GENZPMOD
//SYSIN        DD   *
    DUMPT IEFW21SD IEFAB435
     NAME IEFW21SD IEFAB435
*
*        THE FOLLOWING ZAP IS DESIGNED TO CHANGE THE ALLOCATION
*        ROUTINES TO LOAD A MOUNTABLE VOLUME WITH THE USE ATTRIBUTE OF
*        PRIVATE RATHER THAN PUBLIC. THIS WILL PREVENT THE ALLOCATION
*        OF WORK FILES TO THE VOLUME AND MAKE IT POSSIBLE TO DEMOUNT
*        THE VOLUME WHEN NECCESSARY.
*
*   THE FOLLOWING TWO CARDS WERE USED FOR MVS IPO1
*VER 0624 9608,C022
*REP 0624 9610,C022
*
*   THE FOLLOWING TWO CARDS ARE FOR MVS IPO R2.0
*   THE FOLLOWING TWO CARDS ARE FOR MVS IPO R3.0
 VER 062C 9608,C022
 REP 062C 9610,C022
 IDRDATA MNTPRVTE
/*
