//PSGMODS      JOB  (1582,5),'LIST MVS MODS',CLASS=T
/*JOBPARM      LINES=50
//STEP01   EXEC   PGM=T586P04
//SYSPRINT   DD   SYSOUT=A
//MASTER   DD   DSN=LIBRARYN.MVS,DISP=SHR
//STEPLIB   DD   DSN=MOPP.PROGLIB,DISP=SHR
//SYSUT2   DD   DSN=&&P04,DISP=(,PASS),
//   UNIT=VIO,SPACE=(CYL,(1,1)),DCB=BLKSIZE=80
//SYSUT1  DD   *
-OPT LIST,NOEXEC,NOPC
-SEL ACTCPY00,TEST,TEMP
-SEL ACTCPY01,TEST,TEMP
-SEL ACTCPY02,TEST,TEMP
-SEL ACTLNK01,TEST,TEMP
-SEL ACTLNK02,TEST,TEMP
-SEL ACTLNK03,TEST,TEMP
-SEL ACTZAP01,TEST,TEMP
-SEL ACTZAP02,TEST,TEMP
-SEL ACTZAP03,TEST,TEMP
-SEL AUTOCOMM,TEST,TEMP
-SEL AUXCMM00,TEST,TEMP
-SEL AUXCMM01,TEST,TEMP
-SEL AUXCMM02,TEST,TEMP
-SEL AUXCMM03,TEST,TEMP
-SEL AUXCMM04,TEST,TEMP
-SEL AUXCMM05,TEST,TEMP
-SEL AUXCMM06,TEST,TEMP
-SEL AUXCMM07,TEST,TEMP
-SEL AUXCMM09,TEST,TEMP
-SEL AUXCMM10,TEST,TEMP
-SEL AUXCMM11,TEST,TEMP
-SEL AUXCMM12,TEST,TEMP
-SEL AUXCMM14,TEST,TEMP
-SEL AUXCOMM,TEST,TEMP
-SEL CHRGCTAB,TEST,TEMP
-SEL DEVNAMET,TEST,TEMP
-SEL FMTENT,TEST,TEMP
-SEL IEAVADDB,TEST,TEMP
-SEL IEAVADFT,TEST,TEMP
-SEL IEAVADZZ,TEST,TEMP
-SEL IEAVADDM,TEST,TEMP
-SEL IEAVADDY,TEST,TEMP
-SEL IEAVADPM,TEST,TEMP
-SEL IEAVAD02,TEST,TEMP
-SEL IEAVNPMC,TEST,TEMP
-SEL IEAVREST,TEST,TEMP
-SEL IEE0503D,TEST,TEMP
-SEL IEFACTRT,TEST,TEMP
-SEL IEFUJI,TEST,TEMP
-SEL IEFUTL,TEST,TEMP
-SEL IEFU29,TEST,TEMP
-SEL IEFU83,TEST,TEMP
-SEL IEFW21SD,TEST,TEMP
-SEL IGC254,TEST,TEMP
-SEL JEAVAD02,TEST,TEMP
-SEL JES2B005,TEST,TEMP
-SEL LOOK3330,TEST,TEMP
-SEL MASTCAT,TEST,TEMP
-SEL MNTPRVTE,TEST,TEMP
-SEL MONCB,TEST,TEMP
-SEL MSTRJZAP,TEST,TEMP
-SEL MZ0003,TEST,TEMP
-SEL MZ0004,TEST,TEMP
-SEL M11IPO2,TEST,TEMP
-SEL RDE,TEST,TEMP
-SEL SMFEXEXT,TEST,TEMP
-SEL STAGE1B,TEST,TEMP
-SEL STAGE2,TEST,TEMP
-SEL STAG2SEL,TEST,TEMP
-SEL SVCTABLE,TEST,TEMP
-SEL TESTTSO,TEST,TEMP
-SEL TESTUJI,TEST,TEMP
-SEL TESTUJIJ,TEST,TEMP
-SEL TRKRLSE,TEST,TEMP
-SEL TSLIHEXT,TEST,TEMP
-DLM T586B01,TEST
-DLM T586B02,TEST
-DLM T586DMMY,TEST
-DLM T586INDX,TEST
-DLM T586LT1,TEST
-DLM T586LT2,TEST
-DLM T586LT3,TEST
-DLM T586LT4,TEST
-DLM T586MREQ,TEST
-DLM T586M04M,TEST
-SEL UNITZAP,TEST,TEMP
-SEL XEAVAD02,TEST,TEMP
-SEL XEE0503D,TEST,TEMP
-SEL ZAPNAMER,TEST,TEMP
-SEL ZAPNAMET,TEST,TEMP
-SEL ZAPNAME2,TEST,TEMP
-END
/*
//STEP02   EXEC   LIBRARYN,FILE=MVS
//SYSIN   DD   DSN=&&P04,DISP=(OLD,DELETE)
