//MSTRJCL JOB (1586,5),'** FOR J. NOLS **',CLASS=N
//ZAPPO EXEC GENZPMOD,LIB1='SYS1.LINKLIB'
//SYSIN DD *
 DUMPT MSTRJCL MSTRJCL
 NAME MSTRJCL MSTRJCL
*    CHANGE AUTO START OF JES2 FROM // START JES2 TO //*START JES2
*    TO ENABLE SECONDARY SUBSYSTEMS TO BE SELECTED AS MASTER
 VER 0320 616140E2E3C1
 REP 0320 61615C
 IDRDATA MSTRJZAP
/*
