//JEAOPENB JOB (1140,5),'J ABBEY',CLASS=O
//BUILD EXEC ASMFCL,L=H
//SYSIN DD DSN=WINGLES.FILELIST,DISP=OLD
//LKED.SYSLMOD DD DSN=SYS1.LINKLIB2,DISP=SHR
 NAME FILELIST(R)
/*
