         TITLE 'CHRGCTAB - TABLE OF VALID CHARGE CODES'
         MACRO
&NAME    CSID
&NAME    DC    CL8'&SYSECT'        NAME OF CSECT
         DC    CL8'&SYSDATE'       DATE OF ASSEMBLY
         DC    CL8'&SYSTIME'       TIME OF ASSEMBLY
         MEND
CHRGCTAB CSECT
         USING *,15
START    DC    A(TABSTART)         ADDRESS OF START OF TABLE
         DC    A(4)                LENGTH OF EACH ELEMENT
END      DC    A(TABEND)           ADDRESS OF END OF TABLE
TABNO    DC    A((TABEND-TABSTART+4)/4) NUMBER OF ELEMENTS IN TABLE
         CSID  ,                   IDENTIFY CSECT ( LEST WE DUMP )
TABSTART EQU   *                   START OF TABLE
