//PLICKI   PROC
//GO       EXEC PGM=&LOAD
//SYSPLIC  DD  DSNAME=SYS1.PLICLNK,DISP=SHR
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  DSNAME=&&SYSUT1,UNIT=VIO,DCB=(BLKSIZE=1024,BUFNO=1),
//             SPACE=(1024,(120,120),,CONTIG,ROUND)
