//R01TODB1     JOB  (1582,5),'IPOR01 TO DLIB01',CLASS=T,
//           RESTART=(*),MSGLEVEL=(2,0)
/*JOBPARM      TIME=99,LINES=99
//STEP01       EXEC PGM=IEHPROGM
//*********************************************************************
//*      SCRATCH UNWANTED AND DISPLACED DATASETS.                     *
//*********************************************************************
//SYSPRINT     DD   SYSOUT=A
//DLIB01       DD   UNIT=3330,VOL=SER=DLIB01,DISP=OLD
//SYSIN        DD   *
     SCRATCH   VOL=3330-1=DLIB01,PURGE,DSNAME=SYS1.TSGLINK
     SCRATCH   VOL=3330-1=DLIB01,PURGE,DSNAME=SYS1.TSGPROC
     SCRATCH   VOL=3330-1=DLIB01,PURGE,DSNAME=SYS1.DUMP00
     SCRATCH   VOL=3330-1=DLIB01,PURGE,DSNAME=SYS1.DUMP01
/*
//PSWDDEL      EXEC PGM=IDCAMS,REGION=320K
//*********************************************************************
//*      DELETE THE MASTER CATALOG MASTER PASSWORD TO SAVE WTORS      *
//*********************************************************************
//SYSPRINT   DD   SYSOUT=A
//IPOR01   DD   UNIT=3330,VOL=SER=IPOR01,DISP=OLD
//SYSIN   DD   *
    ALTER  CATALOG.IPOJ01/TSGOROPS NULLIFY(UPDATEPW)
/*
//DS01   EXEC  CP,V=DLIB01,DS='SYS1.LINKLIB2',ED=99365
//*********************************************************************
//*      COPY 32 DATASETS FROM IPOR01 TO DLIB01                       *
//*********************************************************************
//SYSUT2 DD    SPACE=(ABSTR,(418,2793,84))
//DS02   EXEC  CP,V=DLIB01,DS='SYS1.SSORT21C',ED=99365
//SYSUT2 DD     SPACE=(ABSTR,(76,3211,14))
//DS03   EXEC  CP,V=DLIB01,DS='SYS1.SORTLIB',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(1,3362,7))
//DS04   EXEC  CP,V=DLIB01,DS='SYS2.LIBRN53',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(38,3287,7))
//DS05   EXEC  CP,V=DLIB01,DS='SYS2.LIBVS13',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(19,3325,7))
//DS06   EXEC  CP,V=DLIB01,DS='SYS1.PROCLIB',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(703,5130,98))
//DS07   EXEC  CP,V=DLIB01,DS='TEST.PROCLIB',ED=11111
//SYSUT2 DD    SPACE=(ABSTR,(760,6289,84))
//DS08   EXEC  CP,V=DLIB01,DS='REMOTE.PROCLIB',ED=11111
//SYSUT2 DD    SPACE=(ABSTR,(380,3895,56))
//DS09   EXEC  CP,V=DLIB01,DS='TEST.FDLIB',ED=11111
//SYSUT2 DD    SPACE=(ABSTR,(190,4389,28))
//DS10   EXEC  CP,V=DLIB01,DS='FDLIB',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(285,4579,28))
//DS11   EXEC  CP,V=DLIB01,DS='SYS1.COBVS11',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(94,4941,70))
//DS12   EXEC  CP,V=DLIB01,DS='SYS1.ASMH50',ED=99365
//SYSUT2 DD    SPACE=(ABSTR,(18,3344,7))
//DS13   EXEC  CP,V=DLIB01,DS='SYS1.PLIBASE',ED=99365,
//             P=10,S=2,D=70,A=CYL
//DS14   EXEC  CP,V=DLIB01,DS='SYS1.PL1F217',ED=99365,
//             P=8,S=1,D=124,A=CYL
//DS16   EXEC  CP,V=DLIB01,DS='SYS1.FORTG217',ED=99365,
//             P=1,S=1,D=35,A=CYL
//DS17   EXEC  CS,V=DLIB01,DS='SYS2.ASTERISK',ED=99365,
//             P=9,S=0
//DS18   EXEC  CS,V=DLIB01,DS='SYS2.ZERO',ED=99365,
//             P=18,S=0
//DS19   EXEC  CS,V=DLIB01,DS='SYS2.HIGHVALU',ED=99365,
//             P=4,S=0
//DS20   EXEC  CP,V=DLIB01,DS='SYS1.PLITASK',ED=99365,
//             P=1,S=1,D=7
//DS21   EXEC  CP,V=DLIB01,DS='SYS1.PL1F206',ED=99365,
//             P=140,S=19,D=124
//DS24   EXEC  CP,V=DLIB01,DS='SYS2.COBE206',ED=99365,
//             P=36,S=19,D=36
//DS15   EXEC  CP,V=DLIB01,DS='SYS1.FORTX22',ED=99365,
//             P=4,S=1,D=70,A=CYL
//SYSUT1 DD    DCB=(RECFM=U,BLKSIZE=13030)
//DS25   EXEC  CP,V=DLIB01,DS='SYS2.STLPROCS',ED=99365,
//             P=1,S=1,D=14,A=CYL
//DS26   EXEC  CP,V=DLIB01,DS='SYS2.TABLIB',ED=99365,
//             P=2,S=1,D=14,A=CYL
//DS27   EXEC  CP,V=DLIB01,DS='SYS2.CONTRLIB',ED=99365,
//             P=19,S=19,D=7
//DS28   EXEC  CP,V=DLIB01,DS='SYS2.REREAD',ED=99365,
//             P=1,S=1,D=1
//DS29   EXEC  CP,V=DLIB01,DS='SYS2.REREADX',ED=99365,
//             P=2,S=2,D=2
//DS30   EXEC  CP,V=DLIB01,DS='SYS2.JCLLIB',ED=99365,
//             P=4,S=1,D=56,A=CYL
//DS32   EXEC  CP,V=DLIB01,DS='SYS2.UT410LIB',ED=99365,
//             P=4,S=1,D=28,A=CYL
//DS31   EXEC  CS,V=DLIB01,DS='SYS1.IPLTEXT',ED=99365,
//             P=1,S=1
//DS22   EXEC  CS,V=DLIB01,DS='SYS1.TRACE',ED=11111,
//             P=1,S=0,A=CYL,R=
//DS23   EXEC  CS,V=DLIB01,DS='SYS2.GTFDATA',ED=11111,
//             P=1,S=0,A=CYL,R=
//PSWDREST EXEC   PGM=IDCAMS,REGION=320K,COND=(0,NE)
//*********************************************************************
//*      RESTORE MASTER CATALOG UPDATE PASSWORD                       *
//*********************************************************************
//SYSPRINT  DD   SYSOUT=A
//IPOR01   DD   UNIT=3330-1,VOL=SER=IPOR01,DISP=OLD
//SYSIN   DD   *
   ALTER   CATALOG.IPOJ01/TSGOROPS UPDATEPW(TSGOROPS)
/*
//REALLOC      EXEC PGM=COPY
//*********************************************************************
//*      REALLOCATE 2NDRY SYSTEM DUMP DATASETS                        *
//*********************************************************************
//SYSPRINT   DD   SYSOUT=A
//SYSUT2       DD   DSN=SYS1.DUMP00,DISP=(,KEEP),
//             UNIT=3330,VOL=SER=DLIB01,SPACE=(CYL,(12),,CONTIG),
//             DCB=(RECFM=F,LRECL=4104,BLKSIZE=4104),LABEL=EXPDT=11111
//SYSUT3       DD   DSN=SYS1.DUMP01,DISP=(,KEEP),
//             UNIT=3330,VOL=SER=DLIB01,SPACE=(CYL,(12),,CONTIG),
//             DCB=(RECFM=F,LRECL=4104,BLKSIZE=4104),LABEL=EXPDT=11111
//MAP          EXEC MAPDISK,DD1=DLIB01
//*********************************************************************
//*      MAP DLIB01 TO CHECK RESULTING LAYOUT                         *
//*********************************************************************
