//SSSVCS    JOB   (1586,5),'** FOR J. NOLS **',CLASS=N
//STEP01   EXEC   GENCYMOD,LIB1='SYS1.LPALIB'
//*********************************************************************
//*      COPY SYNCSORT SVCS FROM CURRENT 'SYS1.LPALIB'                *
//*      TO 'SYS1.LPALIB' OF A NEW RELEASE OF IPO                     *
//*********************************************************************
//SYSIN   DD   *
   COPY   INDD=((SYSUT1,R)),OUTDD=SYSUT2
   S   M=IGX00010
/*
