//SYNCCOPY     JOB  (1140,5),'PSG',CLASS=T
//SCOPY   PROC
//SCOPY   EXEC  PGM=COPY,PARM='T=COPY OF SYNCSORT/4 R2.1C DSN=&DS.'
//SYSPRINT    DD   SYSOUT=A
//SYSUT1       DD   DSN=&DS,DISP=(OLD,PASS),
//             UNIT=2400,VOL=SER=030621,LABEL=(&F,SL)
//SYSUT2       DD   DSN=&DS,DISP=(,PASS),
//             UNIT=2400,LABEL=(&F,SL),VOL=SER=M30621
//SYSUDUMP     DD   SYSOUT=A
//             PEND
//STEP01   EXEC SCOPY,F=1,DS=F1DOCUMT
//STEP02   EXEC     SCOPY,DS=F2LLSSRT,F=2
//STEP03   EXEC     SCOPY,F=3,DS=F3SLTSRT
//STEP04   EXEC     SCOPY,DS=F4SLEXIT,F=4
//STEP05   EXEC     SCOPY,F=5,DS=F5SLUTIL
//STEP06   EXEC   SCOPY,F=6,DS=F6SRCLIB
//STEP07   EXEC   SCOPY,F=7,DS=F7LKDJCL
//STEP08   EXEC   SCOPY,F=8,DS=F8SVCVS2
//STEP09   EXEC   SCOPY,F=9,DS=F9SVCVS1
//STEP10   EXEC   SCOPY,F=10,DS=FASEUTIL
//STEP11   EXEC   SCOPY,F=11,DS=FBLLSSRT
//STEP12   EXEC   SCOPY,F=12,DS=FCTPFSCZ
