/*$ZI
//TESTB305 JOB (1194,9),'SOFTHOLD FOR HELDRDR',CLASS=A
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,9),'SOFTHOLD FOR HELDRDR',CLASS=B
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,5),'SOFTHOLD FOR HELDRDR',CLASS=N
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,9),'SOFTHOLD FOR HELDRDR',CLASS=R
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,9),'SOFTHOLD FOR HELDRDR',CLASS=P
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,5),'SOFTHOLD FOR HELDRDR',CLASS=T
// EXEC PGM=IEFBR14
//TESTB305 JOB (1194,9),'SOFTHOLD FOR HELDRDR',CLASS=O
// EXEC PGM=IEFBR14
