//TESTB901     JOB  (1194,5),'0 + & = 0/0 + - = _',CLASS=N
/*ROUTEX PRINT LOCAL


 PRINT PUNCHES 0 PLUS & AS ZERO ('0'). NEXT LINE 10 TIMES.   *- HERE -*
                                                             {{{{{{{{{{


 PRINT PUNCHES 0 PLUS - AS UNDERLINE ('_'). NEXT LINE 10 TIMES.  *- HERE -*
                                                                 }}}}}}}}}}


/*EOT
