//TESTS405 JOB (1194,5,,,,,,1),'0222 ADD TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5,,,,,,2),'0222 ADD TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5,,,,,,3),'0222 ADD TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5,,,,,,4),'0222 ADD TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5,,,,,,6),'0222 ADD TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5,,,,,,20),'0222 ADD TIME',CLASS=N
/*JOBPARM   TIME=1
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
//TESTS405 JOB (1194,5),'0222 ADD DEF TIME',CLASS=N
//STEP01       EXEC ASMFCLG
//ASM.SYSIN    DD   *
IEFBR15  CSECT
         BR    15                  LOOP A LOT
         END
/*
