//TRKRLSE JOB (1586,5),'** FOR J. NOLS **',CLASS=N
//STEP1 EXEC PGM=IEBCOPY,REGION=100K
//SYSPRINT DD SYSOUT=A
//SYSUT3 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//IN DD DSN=SYS1.LPALIB,DISP=SHR,VOL=REF=IPOVOL
//OUT DD DSN=SYS1.MLPALIB,DISP=SHR,VOL=REF=IPOVOL
 COPY O=OUT,I=((IN,R))
 S M=IGG020P1
/*
//STEP2      EXEC GENZPMOD,COND=(0,NE)
//SYSIN DD *
***********************************************************************
*        THIS ZAP ENSURES THAT, REGARDLESS OF THE UNITS OF ALLOCATION *
*         SPACE IS RELEASED TO THE NEAREST TRACK, AND THE SECONDARY   *
*         EXTENT SIZE IS NULLIFIED.                                   *
*                                                                     *
*        THIS ZAP IS ASSOCIATED WITH THE ( BRUSSELS ) INSTALLATION    *
*         STANDARDS THAT :-                                           *
*              1. RLSE IS SPECIFIED FOR ALL NEW OR MOD SEQUENTIAL D/S *
*              2. SPACE IS RECODED WITH MOD                           *
*                                                                     *
***********************************************************************
*
     DUMPT IGG020P1 IGG020P1
     NAME      IGG020P1 IGG020P1
*
***********************************************************************
*                                                                     *
*        AVOID ALIGNING ALLOCATION TO CYLINDER BOUNDARY REGARDLESS OF *
*         UNIT OF ALLOCATION, AND UTILISE UNNEEDED CODE ( CYLINDER    *
*         ALIGNMENT ) TO ZEROISE THE SECONDARY EXTENT SIZE IN THE DSCB.
*                                                                     *
***********************************************************************
*
*
     VER       054C 4710C556       BR IF CYL REQUEST
     REP       054C 4700C556       NO-OP BRANCH
     VER       0554 47E0C58E       BR IF NOT REC ROUNDED
     VER       0558 41400001,D203B2209008 MISC INSTRUCTIONS
     REP       0554 D703D032D032   ZEROISE SECONDARY ALLOCATION
     REP       055A 47F0C58E,0700  BR TO 'SAVEFMT3'
*
***********************************************************************
*                                                                     *
*        FORCE NON-CYLINDER ALIGNMENT WHATEVER THE UNITS OF SPACE     *
*        ORIGINALLY REQUESTED.                                        *
*                                                                     *
***********************************************************************
*
*
     VER       06D6 4710C6E4       BR IF CYL REQUEST
     REP       06D6 4700C6E4       NO-OP BRANCH
     VER       06DE 4710C6E4       BR IF REC ROUNDED
     REP       06DE 4700C6E4       NO-OP BRANCH
 IDRDATA TRKRLSE
*
*
***********************************************************************
*
    NAME IGG020P1 IGG020P2
     NAME      IGG020P1 IGG020P2
*
***********************************************************************
*                                                                     *
*        FORCE NON-CYLINDER ALIGNMENT FOR THE EXTENT IF IT IS A       *
*        SECONDARY EXTENT IN THE FORMAT-3 DSCB.                       *
*                                                                     *
***********************************************************************
*
*
     VER       0062 4710C076       BR IF CYL REQUEST
     REP       0062 4700C076       NO-OP BRANCH
     VER       006A 4710C076       BR IF REC ROUNDED REQUEST
     REP       006A 4700C076       NO-OP BRANCH
     IDRDATA   TRKRLSE
*
*
***********************************************************************
/*
