//UT458TST     JOB  (1580,5),'0052 FOR J.NOLS',CLASS=A,ADDRSPC=REAL
//* THIS JOB STREAM IS USED TO TEST THE NEW DYNAMO AND
//*    UT458 UNDER MVS.
//             EXEC RPGECL
//RPG.SYSIN    DD   *
01010H              I                                                     TES458
01020FINPUT   IP  F  80  80            DADEVT       S                     TES458
01030FPRINT   O   F 132 132           LDADEVT       S                     TES458
02110LPRINT   0010106012                                                  TES458
03010IINPUT   AA  99                                                      TES458
03020I                                        1   1 A                     TES458
03030I                                        1   6 B                     TES458
03040I                                        1   6 C                     TES458
03050I                                        1   6 D                     TES458
03060I                                        1   5 E                     TES458
03070I                                        1   5 F                     TES458
03080I                                        1   5 G                     TES458
03090I                                        1   9 H                     TES458
03100I                                        1   9 I                     TES458
03110I                                        1   9 J                     TES458
03120I                                        1   9 K                     TES458
03130I                                        1   9 L                     TES458
03140I                                        1   6 M                     TES458
03150I                                        1   1 N                     TES458
10010C                     RLABL          FIELD1  8        PROGRAM NAME   TES458
10010C                     RLABL          FIELD2  1        OPERATION CODE TES458
10020C                     RLABL          MMDDYY  6         '010273'      TES458
10030C                     RLABL          DDMMYY  6         '020173'      TES458
10040C                     RLABL          YYMMDD  6         '730102'      TES458
10050C                     RLABL          DWWYY   5         '20173'       TES458
10060C                     RLABL          YYWWD   5         '73012'       TES458
10070C                     RLABL          YYDDD   5         '73002'       TES458
10080C                     RLABL          REPORT  9         ' 2 JAN 73'   TES458
10090C                     RLABL          LASTM   9         'DECEMBER '   TES458
10100C                     RLABL          THISM   9         'JANUARY  '   TES458
10110C                     RLABL          NEXTM   9         'FEBRUARY '   TES458
10120C                     RLABL          DAYNAM  9         'TUESDAY  '   TES458
10130C                     RLABL          HHMMSS  6                       TES458
10140C                     RLABL          RTCODE  1        RETURN CODE    TES458
     C   90                GOTO SKIP
     C                     MOVE 'UT458   'FIELD1
     C                     EXIT MINGL
     C                     SETON                         90               TES458
     C           SKIP      TAG
11010C           CC        ADD  1         CC      20                      TES458
11020C           CC        COMP 1                        01               TES458
11030C           CC        COMP 2                        02               TES458
11040C           CC        COMP 3                        03               TES458
11050C           CC        COMP 4                        04               TES458
11060C           CC        COMP 5                        05               TES458
11070C           CC        COMP 6                        06               TES458
11080C           CC        COMP 7                        07               TES458
11090C           CC        COMP 8                        08               TES458
11100C           CC        COMP 9                        09               TES458
11110C           CC        COMP 10                       10               TES458
11120C   01                GOTO T01                                       TES458
11130C   02                GOTO T02                                       TES458
11140C   03                GOTO T03                                       TES458
11150C   04                GOTO T04                                       TES458
11160C   05                GOTO T05                                       TES458
11170C   06                GOTO T06                                       TES458
11180C   07                GOTO T07                                       TES458
11190C   08                GOTO T08                                       TES458
11200C   09                GOTO T09                                       TES458
12010C   10                GOTO T10                                       TES458
12020C                     SETON                     H1                   TES458
12030C           T01       TAG                                            TES458
10150C                     MOVE 'RP'      REPORT                          TES458
12040C                     MOVE '1'       FIELD2                          TES458
12050C                     MOVE '110173'  MMDDYY                          TES458
12051C                     MOVEL'FRENCH'  REPORT                          TES458
12060C                     EXIT MINGE                                     TES458
12070C                     GOTO FIN                                       TES458
12080C           T02       TAG                                            TES458
12090C                     MOVE '2'       FIELD2                          TES458
12100C                     MOVE '011173'  DDMMYY                          TES458
12101C                     MOVEL'FLEMISH' REPORT                          TES458
12110C                     EXIT MINGE                                     TES458
12120C                     GOTO FIN                                       TES458
12130C           T03       TAG                                            TES458
12140C                     MOVE '3'       FIELD2                          TES458
12150C                     MOVE '731101'  YYMMDD                          TES458
12151C                     MOVEL'GERMAN'  REPORT                          TES458
12160C                     EXIT MINGE                                     TES458
12170C                     GOTO FIN                                       TES458
13010C           T04       TAG                                            TES458
13020C                     MOVE '4'       FIELD2                          TES458
13030C                     MOVE '40076'   DWWYY                           TES458
13040C                     EXIT MINGE                                     TES458
13050C                     GOTO FIN                                       TES458
13060C           T05       TAG                                            TES458
13070C                     MOVE '5'       FIELD2                          TES458
13080C                     MOVE '76005'   YYWWD                           TES458
13090C                     EXIT MINGE                                     TES458
13100C                     GOTO FIN                                       TES458
13110C           T06       TAG                                            TES458
13120C                     MOVE '6'       FIELD2                          TES458
13130C                     MOVE '73305'   YYDDD                           TES458
13140C                     EXIT MINGE                                     TES458
13150C                     GOTO FIN                                       TES458
14010C           T07       TAG                                            TES458
14020C                     MOVE '0'       FIELD2                          TES458
14030C                     EXIT MINGE                                     TES458
14040C                     GOTO FIN                                       TES458
14050C           T08       TAG                                            TES458
14060C                     MOVE 'A'       FIELD2           INVALID OPCODE TES458
14070C                     EXIT MINGE                                     TES458
14080C                     GOTO FIN                                       TES458
14090C           T09       TAG                                            TES458
14100C                     MOVE '6'       FIELD2           INVALID YYDDD  TES458
14110C                     MOVE '73366'   YYDDD                           TES458
14120C                     EXIT MINGE                                     TES458
14130C                     GOTO FIN                                       TES458
14140C           T10       TAG                             INVALID DATE   TES458
15010C                     MOVE '1'       FIELD2                          TES458
15020C                     MOVE 'A'       MMDDYY                          TES458
15030C                     EXIT MINGE                                     TES458
15040C           RTCODE    COMP '2'                      20               TES458
15050C                     MOVEL'1'       NOPC    6                       TES458
15060C  N20                GOTO FIN                                       TES458
15070C                     MOVE '2'       FIELD2                          TES458
15080C                     MOVE 'A'       DDMMYY                          TES458
15090C                     EXIT MINGE                                     TES458
15100C           RTCODE    COMP '2'                      20               TES458
15110C                     MOVEL'12'      NOPC                            TES458
15120C  N20                GOTO FIN                                       TES458
15130C                     MOVE '3'       FIELD2                          TES458
15140C                     MOVE 'A'       YYMMDD                          TES458
15150C                     EXIT MINGE                                     TES458
15160C           RTCODE    COMP '2'                      20               TES458
15170C                     MOVEL'123'     NOPC                            TES458
15180C  N20                GOTO FIN                                       TES458
15190C                     MOVE '4'       FIELD2                          TES458
15200C                     MOVE 'A'       DWWYY                           TES458
16010C                     EXIT MINGE                                     TES458
16020C           RTCODE    COMP '2'                      20               TES458
16030C                     MOVEL'1234'    NOPC                            TES458
16040C  N20                GOTO FIN                                       TES458
16050C                     MOVE '5'       FIELD2                          TES458
16060C                     MOVE 'A'       YYWWD                           TES458
16070C                     EXIT MINGE                                     TES458
16080C           RTCODE    COMP '2'                      20               TES458
16090C                     MOVEL'12345'   NOPC                            TES458
16100C  N20                GOTO FIN                                       TES458
16110C                     MOVE '6'       FIELD2                          TES458
16120C                     MOVE 'A'       YYDDD                           TES458
16130C                     EXIT MINGE                                     TES458
16140C                     MOVEL'123456'  NOPC                            TES458
17010C           FIN       TAG                                            TES458
17020C                     MOVE FIELD2    A                               TES458
17030C                     MOVE MMDDYY    B                               TES458
17040C                     MOVE DDMMYY    C                               TES458
17050C                     MOVE YYMMDD    D                               TES458
17060C                     MOVE DWWYY     E                               TES458
17070C                     MOVE YYWWD     F                               TES458
17080C                     MOVE YYDDD     G                               TES458
17090C                     MOVE REPORT    H                               TES458
17100C                     MOVE LASTM     I                               TES458
17110C                     MOVE THISM     J                               TES458
17120C                     MOVE NEXTM     K                               TES458
17130C                     MOVE DAYNAM    L                               TES458
17140C                     MOVE HHMMSS    M                               TES458
17150C                     MOVE RTCODE    N                               TES458
     CLR                   EXIT MINGD
20010OPRINT   D  2     1P                                                 TES458
20020O                                   14 'TEST UT458 RPG'              TES458
20030O                         UDATE     50 '0 /  /  '                    TES458
20040OPRINT   D  2     99                                                 TES458
20050O                         CC         3 '  -'                         TES458
20060O                         A          5                               TES458
20070O                         B         12                               TES458
20080O                         C         19                               TES458
20090O                         D         26                               TES458
20100O                         E         32                               TES458
20110O                         F         38                               TES458
20120O                         G         44                               TES458
20130O                         H         54                               TES458
20140O                         I         64                               TES458
20150O                         J         74                               TES458
20160O                         K         84                               TES458
20170O                         L         94                               TES458
20180O                         M        101                               TES458
20190O                         N        103                               TES458
20200O                         NOPC     111                               TES458
//LKED.SYSLIB DD DSN=SYS2.DYNAMING,DISP=SHR
// DD DSN=SYS1.LINKLIB,DISP=SHR
// DD DSN=SYS1.LINKLIB2,DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.DYNAMING(UT458RPG),DISP=SHR
// EXEC PGM=UT458RPG
//STEPLIB DD DSN=SYS2.DYNAMING,DISP=SHR
//INPUT   DD *










/*
//PRINT   DD   SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//             EXEC COBECL,RELEASE=TEST
//COB.SYSIN    DD   *
000010 IDENTIFICATION DIVISION.                                         TESUT458
000020 PROGRAM-ID.     'TESUT458'.                                      TESUT458
000030 AUTHOR.         NOLS J.                                          TESUT458
000040 DATE-WRITTEN.   NOVEMBER 1973.                                   TESUT458
000050 REMARKS.                                                         TESUT458
000060         THIS PROGRAM IS A TEST FOR UT458.                        TESUT458
000070 ENVIRONMENT DIVISION.                                            TESUT458
000080 CONFIGURATION SECTION.                                           TESUT458
000090 SOURCE-COMPUTER.    IBM-360.                                     TESUT458
000100 OBJECT-COMPUTER.    IBM-360.                                     TESUT458
000110 INPUT-OUTPUT SECTION.                                            TESUT458
000120 FILE-CONTROL.                                                    TESUT458
000130     SELECT PRINT-FILE ASSIGN 'PRINT' UTILITY.                    TESUT458
000140 DATA DIVISION.                                                   TESUT458
000150 FILE SECTION.                                                    TESUT458
000160 FD  PRINT-FILE                                                   TESUT458
000170     RECORDING MODE IS F                                          TESUT458
000180     BLOCK CONTAINS 1 RECORDS                                     TESUT458
000190     RECORD CONTAINS 133 CHARACTERS                               TESUT458
000200     LABEL RECORD ARE STANDARD                                    TESUT458
000210     DATA RECORD IS PRINT-RECORD.                                 TESUT458
000220                                                                  TESUT458
000230 01  PRINT-RECORD                    PICTURE X(133).              TESUT458
001010 WORKING-STORAGE SECTION.                                         TESUT458
001011 77  TWO         PICTURE X VALUE '0'.                             TESUT458
001012 77  THREE       PICTURE X VALUE '1'.                             TESUT458
001012 77  UT458       PICTURE X(8) VALUE 'UT458   '.                   TESUT458
001020 01  DATE-AREA.                                                   TESUT458
001025     03  OPCODE                      PICTURE X.                   TESUT458
001030     03  DATE-1-MMDDYY               PICTURE X(6).                TESUT458
001040     03  DATE-2-DDMMYY               PICTURE X(6).                TESUT458
001050     03  DATE-3-YYMMDD               PICTURE X(6).                TESUT458
001060     03  DATE-4-DWWYY                PICTURE X(5).                TESUT458
001070     03  DATE-5-YYWWD                PICTURE X(5).                TESUT458
001080     03  DATE-6-YYDDD                PICTURE X(5).                TESUT458
001090     03  DATE-REPORT                 PICTURE X(9).                TESUT458
001100     03  DATE-LASTMONTH              PICTURE X(9).                TESUT458
001110     03  DATE-THISMONTH              PICTURE X(9).                TESUT458
001120     03  DATE-NEXTMONTH              PICTURE X(9).                TESUT458
001130     03  DATE-DAY                    PICTURE X(9).                TESUT458
001140     03  DATE-HHMMSS                 PICTURE X(6).                TESUT458
001150     03  DATE-RTCODE                 PICTURE X.                   TESUT458
001160 01  HEAD-LINE.                                                   TESUT458
001170     03  FILLER  PICTURE X VALUE SPACE.                           TESUT458
001180     03  TITLE   PICTURE X(16) VALUE 'TEST UT458 COBOL'.          TESUT458
001190     03  FILLER  PICTURE X(116) VALUE SPACES.                     TESUT458
001200 01  DET-LINE.                                                    TESUT458
001210     03  FILLER  PICTURE X VALUE SPACE.                           TESUT458
001220     03  DETA    PICTURE X(86).                                   TESUT458
001223     03  FILLER  PICTURE X(46) VALUE SPACES.                      TESUT458
002010 PROCEDURE DIVISION.                                              TESUT458
002020 A01-OPEN-FILE.                                                   TESUT458
002030     OPEN OUTPUT PRINT-FILE.                                      TESUT458
           ENTER LINKAGE.
           CALL 'DYNAML' USING UT458.
           ENTER COBOL.
002040 A02-PROCESS.                                                     TESUT458
002050     WRITE PRINT-RECORD FROM HEAD-LINE                            TESUT458
002060         AFTER ADVANCING THREE LINES.                             TESUT458
002070     MOVE '1' TO OPCODE.                                          TESUT458
002080     MOVE '110173' TO DATE-1-MMDDYY.                              TESUT458
002081     MOVE 'FRENCH   ' TO DATE-REPORT.                             TESUT458
002090     PERFORM  U458.                                               TESUT458
002100     MOVE '2' TO OPCODE.                                          TESUT458
002110     MOVE '011173' TO DATE-2-DDMMYY.                              TESUT458
002111     MOVE 'FLEMISH  ' TO DATE-REPORT.                             TESUT458
002120     PERFORM  U458.                                               TESUT458
002130     MOVE '3' TO OPCODE.                                          TESUT458
002140     MOVE '731101' TO DATE-3-YYMMDD.                              TESUT458
002141     MOVE 'GERMAN   ' TO DATE-REPORT.                             TESUT458
002150     PERFORM  U458.                                               TESUT458
002160     MOVE '4' TO OPCODE.                                          TESUT458
002170     MOVE '60076' TO DATE-4-DWWYY.                                TESUT458
002180     PERFORM  U458.                                               TESUT458
002190     MOVE '5' TO OPCODE.                                          TESUT458
002200     MOVE '76010' TO DATE-5-YYWWD.                                TESUT458
002210     PERFORM  U458.                                               TESUT458
002220     MOVE '6' TO OPCODE.                                          TESUT458
002230     MOVE '73305' TO DATE-6-YYDDD.                                TESUT458
002240     PERFORM  U458.                                               TESUT458
002250     MOVE '0' TO OPCODE.                                          TESUT458
003010     PERFORM  U458.                                               TESUT458
003020     MOVE 'A' TO OPCODE.                                          TESUT458
003030     PERFORM  U458.                                               TESUT458
003040     MOVE '6' TO OPCODE.                                          TESUT458
003050     MOVE '73366' TO DATE-6-YYDDD.                                TESUT458
003060     PERFORM  U458.                                               TESUT458
003070     MOVE '6' TO OPCODE.                                          TESUT458
003080     MOVE '0000A' TO DATE-6-YYDDD.                                TESUT458
003090     PERFORM  U458.                                               TESUT458
003100     MOVE '5' TO OPCODE.                                          TESUT458
003110     MOVE '74012' TO DATE-5-YYWWD.                                TESUT458
003120     PERFORM  U458.                                               TESUT458
003130     MOVE '4' TO OPCODE.                                          TESUT458
003140     MOVE '30175' TO DATE-4-DWWYY.                                TESUT458
003150     PERFORM  U458.                                               TESUT458
003160     MOVE '3' TO OPCODE.                                          TESUT458
003170     MOVE '00000A' TO DATE-3-YYMMDD.                              TESUT458
003180     PERFORM  U458.                                               TESUT458
003190     MOVE '2' TO OPCODE.                                          TESUT458
003200     MOVE '00000A' TO DATE-2-DDMMYY.                              TESUT458
003210     PERFORM  U458.                                               TESUT458
003220     MOVE '1' TO OPCODE.                                          TESUT458
003230     MOVE '00000A' TO DATE-1-MMDDYY.                              TESUT458
003240     PERFORM  U458.                                               TESUT458
003250     GO TO ENDPGM.                                                TESUT458
004010 U458.
004020                                                                  TESUT458
004030     ENTER LINKAGE.                                               TESUT458
004040     CALL 'DYNAMO' USING UT458 DATE-AREA.
004050     ENTER COBOL.                                                 TESUT458
004060     MOVE DATE-AREA TO DETA.                                      TESUT458
004070     WRITE PRINT-RECORD FROM DET-LINE
004080         AFTER ADVANCING TWO LINES.                               TESUT458
004090                                                                  TESUT458
004100 ENDPGM.                                                          TESUT458
           ENTER LINKAGE.
           CALL 'DYNAMD' USING UT458.
           ENTER COBOL.
004110     CLOSE PRINT-FILE.                                            TESUT458
004120     STOP RUN.                                                    TESUT458
/*
//LKED.SYSLMOD DD DSN=SYS2.DYNAMING(UT458COB),DISP=SHR
//LKED.SYSLIB DD
//            DD DSN=SYS2.DYNAMING,DISP=SHR,UNIT=3330,VOL=SER=MVSPCK
//    DD     DSN=SYS1.LINKLIB,DISP=SHR
//    DD     DSN=SYS1.LINKLIB2,DISP=SHR
// EXEC PGM=UT458COB
//STEPLIB DD DSN=SYS2.DYNAMING,DISP=SHR
//PRINT   DD   SYSOUT=A
//SYSUDUMP DD SYSOUT=A
