//JEALISTX JOB (1580,5),'0000 J ABBEY',CLASS=R
// EXEC ASMFCL,L=H
//SYSLIB DD
//       DD DSN=JEA.MACLIB,DISP=SHR
PDSCLEAR ZCSECT
         OPEN  (PDS,UPDAT)
         READ  DECB1,SF,PDS,BUFFER
         CHECK DECB1
         MVC   BUFFER(L'CLRDATA),CLRDATA
         WRITE DECB1,SF,MF=E
         CHECK DECB1
         CLOSE (PDS)
         ZRETURN
BUFFER   DS    CL264
CLRDATA  DC    X'FFFFFFFFFFFFFFFF000EFFFFFFFFFFFFFFFF00000000'
PDS      DCB   DDNAME=SYSUT1,DSORG=PO,MACRF=(R,W),LRECL=256,RECFM=F,   X
               BLKSIZE=256,DEVD=DA,KEYLEN=8
         END
//LKED.SYSLMOD DD DSN=SYS2.TESTLIB(UT507),DISP=SHR
