         TITLE   'TIME OF DAY ROUTINE'
CLOCK    START        0
SAVE     SAVE    (2,12),T     SAVE REGISTERS.
         BALR  12,0           ESTABLISH
         USING *,12            ADDRESSING.
         ST    13,SV+4
         LA    13,SV
*
*
*   THIS SUBROUTINE CALLS THE INTERVAL TIMER MACRO.  THE MACRO RESULT
*   IS RETURNED IN REGISTER ZERO IN TENTHS OF SECONDS.  THIS RESULT
*   IS DECIMALY SHIFTED TWO POSITIONS BY DIVISION.  THE SUBROUTINE
*   RESULT IS RETURNED TO THE CALLING PROGRAM VIA STANDARD LINKAGE.
*
*
         LR     7,1          STORE POINTER IN REG 7
         TIME  BIN            GET TIME OF DAY.
         LR    4,0           TIME IN SEC/10
         SRDA  4,32          SHIFT IN ODD/EVEN PAIR
         D     4,=F'100'     SCALE TWO PLACES DEC
         ST    5,FWD
         L     6,0(0,7)
         MVC  0(4,6),FWD
         L     13,SV+4
         RETURN (14,12),T
SV       DS    18F
FWD      DS    CL4
         END   SAVE
