               /* SVCACT - SUMMARISE SVC ACTIVITY */
 SVCACT:PROC OPTIONS(MAIN);
          DCL       /* STANDARD HOOVER MONITOR RECORD FORMATS         */
                    /*                                                */
                    /*                                                */
              1 TYPE0 CTL(P),                   /*                    */
                2 TYPE CHAR(1),                 /*                    */
                2 OPTIONS BIT(8),               /*                    */
                  3 EXCP BIT(1) UNAL,           /*                    */
                  3 LINK BIT(1) UNAL,           /*                    */
                  3 XCTL BIT(1) UNAL,           /*                    */
                  3 LOAD BIT(1) UNAL,           /*                    */
                  3 ATTACH BIT(1) UNAL,         /*                    */
                  3 BLDL BIT(1) UNAL,           /*                    */
                  3 CPULOG BIT(1) UNAL,         /*                    */
                  3 TIMER BIT(1) UNAL,          /*                    */
                2 SPARE CHAR(1),                /*                    */
                2 INTERVAL CHAR(4),             /*                    */
                  3 SECONDS CHAR(2),            /*                    */
                  3 TENTHS CHAR(1),             /*                    */
                  3 HUNDREDTHS CHAR(1),         /*                    */
                2 CORESIZE FIXED BIN(31,0) UNAL,/*                    */
                2 TIME FIXED BIN(31,0) UNAL,    /*                    */
                2 DATE FIXED BIN(31,0) UNAL;    /*                    */
          DCL 1 TYPE1 CTL(P),                   /*LINK,LOAD,XCTL RECD */
              2 TYPE CHAR(1),                   /*                    */
              2 TCBID BIT(8),                   /*                    */
                3 BLDLFLAG BIT(1) UNAL,         /*                    */
                3 NOT_DEFINED BIT(7) UNAL,      /*                    */
              2 SVCNUMB CHAR(4),                /*                    */
              2 SPACE CHAR(1),                  /*                    */
              2 MODULE CHAR(8),                 /*                    */
              2 FREQUENCY CHAR(4),              /*ALWAYS ONE          */
              2 SPACES CHAR(4);                 /*                    */
          DCL 1 TYPE2 CTL(P),                   /*                    */
              2 TYPE CHAR(1),                   /*                    */
              2 SPARE CHAR(1),                  /*                    */
              2 BINARY_SVC_NUMBER BIT(8),       /*                    */
              2 NOT_DEFINED CHAR(1),            /*                    */
              2 SVCNUMBER CHAR(8),              /*                    */
                3 SVCCHARS CHAR(5),             /*                    */
                3 SVCTYPE PIC '999',            /*                    */
              2 FREQUENCY FIXED BIN(31) UNAL,   /*                    */
              2 PADDING CHAR(4);                /*                    */
          DCL 1 TYPE3 CTL(P),                   /*                    */
              2 TYPE CHAR(1),                   /*                    */
              2 SPARE CHAR(1),                  /*                    */
              2 BINARY_SVC_NUMBER CHAR(4),      /*                    */
              2 SPARE2 CHAR(1),                 /*                    */
              2 DEVICE_ADDRESS CHAR(3),         /*                    */
                3 CONTROLLER CHAR(1),           /*                    */
                3 UNIT CHAR(2),                 /*                    */
              2 SPARE3 CHAR(1),                 /*                    */
              2 FREQUENCY CHAR(4),              /*                    */
              2 PADDING CHAR(4);                /*                    */
          DCL 1 TYPE4 CTL(P),                   /*CHANNEL & CPU STATES*/
              2 TYPE CHAR(1),                   /*                    */
              2 SPARE CHAR(1),                  /*                    */
              2 FLAGS(18) BIT(8),               /*                    */
                3 CHANNEL_ZERO BIT(1) UNAL,     /*                    */
                3 CHANNEL_ONE BIT(1) UNAL,      /*                    */
                3 CHANNEL_TWO BIT(1) UNAL,      /*                    */
                3 CHANNEL_THREE BIT(1) UNAL,    /*                    */
                3 CHANNEL_FOUR BIT(1) UNAL,     /*                    */
                3 PROTECT_KEY_ZERO BIT(1) UNAL, /*                    */
                3 CPU_WAIT BIT(1) UNAL,         /*                    */
                3 PROBLEM_STATE BIT(1) UNAL;    /*                    */
          DCL 1 TYPE5 CTL(P),                   /*DISK ARM MOVEMENT   */
              2 TYPE CHAR(1),                   /*                    */
              2 DEVICE_ADDRESS CHAR(3),         /*                    */
                3 CONTROLLER CHAR(1),           /*                    */
                3 UNIT CHAR(2),                 /*                    */
              2 SEEK_ADDRESS(8) FIXED BIN UNAL; /*                    */
          DCL 1 TYPE9 CTL(P),                   /*                    */
              2 TYPE CHAR(1),                   /*                    */
              2 SPARE CHAR(1),                  /*                    */
              2 FREQUENCY FIXED BIN(31,0) UNAL, /*                    */
              2 SPARE2 CHAR(4),                 /*                    */
              2 RUN_TIME FIXED BIN(31,0) UNAL,  /*                    */
              2 PADDING CHAR(4);                /*                    */
          DCL P POINTER;                        /*                    */
          DCL       /*                                                */
                    /*                                                */
                    /*                                                */
               FILEIN FILE INPUT RECORD BUFFERED;
         DCL   BLANKS CHAR(21) INIT('                    *'),
               BOX CHAR(10) INIT('         *');
          DCL SVC FIXED DECIMAL(3,0),           /*                    */
              SVCTABLE(0:255) FIXED BIN(31) INIT((256)0); /*         */
         /* END OF DECLARATIONS */
          OPEN FILE(FILEIN);                    /*                    */
          ON ENDFILE(FILEIN) GOTO ENDDATA;      /*                    */
 DOIT: READ FILE(FILEIN) SET(P);                /*READ A RECORD       */
          IF TYPE2.TYPE='2'                     /*TEST FOR TYPE 2     */
           THEN GO TO SVC_RECORD;               /* YES                */
           ELSE GO TO DOIT;                     /* NO,TRY AGAIN       */
 SVC_RECORD: SVCTABLE(SVCTYPE)=SVCTABLE(SVCTYPE) + TYPE2.FREQUENCY;
             GOTO DOIT;                         /*AND GO ROUND        */
 ENDDATA: CLOSE FILE(FILEIN);                   /*                    */
         L,N=0;
 MAP:    DO J=1 TO 4;
         PUT EDIT(' PAGE ',J,(39)' ','TOTAL SVC ACTIVITY',
               BLANKS,(80)'*')(PAGE,A,F(1),A,A,SKIP(3),
               A,A);
        LINE: DO I=1 TO 8;
               PUT EDIT(BLANKS)(SKIP,A);
               DO K=1 TO 8;
               PUT EDIT(BOX)(A); END;
               PUT EDIT(BLANKS)(SKIP,A);
               DO K=1 TO 8;
               PUT EDIT('   ',L,'   *')(A,F(3),A);
               L=L+1; END;
               PUT EDIT(BLANKS)(SKIP,A);
               DO K=1 TO 8;
               PUT EDIT(BOX)(A); END;
               PUT EDIT(BLANKS)(SKIP,A);
               DO K=1 TO 8;
               PUT EDIT('  ',SVCTABLE(N),' *')(A,F(6),A);
         N=N+1; END;
               PUT EDIT(BLANKS)(SKIP,A);
               DO K=1 TO 8;
               PUT EDIT(BOX)(A); END;
               PUT EDIT(BLANKS,(80)'*')(SKIP,A,(80)A);
               END LINE;
         END MAP;
          END;                                  /*                    */
