*       PGM=NI11DSC VER=009 VOL=NIBS05 TIME/DATE=68038 23:36:27 BAL
NI11DSC  CSECT
         TITLE  '**NIBSIO SUB-SYSTEM**  MODULE=NI11DSC. V-2'
   USING  *,15
    B   22(0,15)
   DC  FL1'18'
     DC   CL9'NI11DSC '
   DC  CL8'V002'
   STM  14,12,12(13)
   ST   13,SAVEAREA+4
    CNOP  0,4
   BAL  13,SAVEAREA+72
   DROP  15
   USING  *,13
SAVEAREA  DC  18F'0'
  L  15,SAVEAREA+4
   ST  13,8(0,15)
*
*
*   *** REGISTER USAGE IN THE TRANSLATE/PRINT LOOP ***
*        REPEATED AS MANY TIMES AS NEEDED
*               44 BYTES       DATA SET NAME
*               6  BYTES       VOLUME IDENTIFICATION
*        REG 2  PARAMETER COUNTER
*        REG 3  PARAMETER LIST
*        REG 4  CUR LEN TIMES 2 MINUS1 FOR MVC.
*        REG 5  CUR LEN.
*        REG 6  DCB ADDR.
*        REG 7  ADDR OF FIELD NAME/LEN CONSTANT.
*        REG 8  BAL REG.
*        REG 9  PRINT AREA ADDR.
*        REG 10  BCT REG FOR 4 WAY LOOP.
*
*        UPON ENTRY TO THIS PROGRAM REG6 CONTAINS ADDR OF LIST
*                                   REG7 CONTAINS ADDR OF NIBCNTRL DCB
*
*
         STM   6,7,ENTSAVE
  MVI TYPESW,C'1'
         B     TWORND
TWORND   MVC   HEAD3(44),0(6)
  MVC  ZINRX(6),44(6)
         LA    7,TAGF1
SETUP    L     1,ENTSAVE+4
         LA    0,DSCBHEAD
         PUT   (1),(0)
         MVC   VOLNUM(6),44(6)
         MVC   NAME(44),0(6)
         OBTAIN DSCBAAA
         ST    15,HOLD15
         CLI   RETNCD,X'00'
         BE    OKAY
         CLI   RETNCD,X'04'
         BE    NOVOL
         CLI   RETNCD,X'08'
         BE    NODSCB
         CLI   RETNCD,X'12'
         BE    IOERROR
* INVALID RETURN CODE FROM OBTAIN MACRO
NOVOL    LA    0,NOVOLHD
         L     1,ENTSAVE+4
         PUT   (1),(0)
         B     CHECK
IOERROR  LA    0,IOERRHD
         L     1,ENTSAVE+4
         PUT   (1),(0)
         B     CHECK
NODSCB   LA    0,NODSCBHD
         L     1,ENTSAVE+4
         PUT   (1),(0)
         B     CHECK
OKAY     LA    6,ARA
DCLOOP   LA    10,4
         BAL   8,CLRPRT
         LA    9,SLK1
REIT     BAL   8,UNPK
         LA    7,9(0,7)
    CLC   0(4,7),KDDDD
      BC  8,*+16
         LA    9,23(0,9)
         LA    6,0(5,6)
         BCT   10,REIT
         L     1,ENTSAVE+4
         LA    0,DATA
         PUT   (1),(0)
         CLC   0(4,7),KDDDD
         BC    7,DCLOOP
  CLI  TYPESW,C'1'
  BC  8,CK1NY
  BC  15,OUTDCB
GETADSC  OBTAIN DSCBBBB
         ST    15,HOLD15
         CLI   RETNCD,X'00'
         BE    OKAY23
         CLI   RETNCD,X'04'
         BE    NOVOL
         CLI   RETNCD,X'08'
         BE    NODSCB
         CLI   RETNCD,X'12'
         BE    IOERROR
OKAY23  LA  6,AREA+44
  CLI  AREA+44,X'F2'
         BE    F2
  CLI  AREA+44,X'F3'
         BE    F3
CHECK    B     OUTDCB
CK1NY  CLC  ARA+135-44(5),=XL5'0'
  BC  8,OUTDCB
  MVC  PTRDS(5),ARA+135-44
  B  GETADSC
F2       EQU   *   PRINT FORMAT 2
  MVI  TYPESW,C'2'
         LA    7,TAGF2
  L  1,ENTSAVE+4
  LA  0,DSCBHEAD
  PUT  (1),(0)
   B  DCLOOP
F3       EQU   *   PRINT FORMAT 3
  MVI  TYPESW,C'3'
         LA    7,TAGF3
  L  1,ENTSAVE+4
  LA  0,DSCBHEAD
  PUT  (1),(0)
    B  DCLOOP
DSCBBBB  CAMLST SEEK,PTRDS,VOLNUM,AREA
DSCBAAA  CAMLST SEARCH,NAME,VOLNUM,ARA
OUTDCB  EQU  *
   L  13,SAVEAREA+4
   LM  2,12,28(13)
  L  14,12(13)
   MVI  12(13),X'FF'
  BR  14
CLRPRT   MVI   SLK1,C' '
         MVC   SLK1+1(132),SLK1
         BCR   15,8
UNPK     LA    5,0
         LA    4,0
         IC    5,8(0,7)
         IC    4,8(0,7)
         AR    4,4
         SH    4,=H'1'
         MVC   6(8,9),0(7)   MOVE FLD NAME TO PRINT
         MVI   14(9),C'='
         UNPK  W9(9),0(5,6)
         MVZ   W9(9),=XL9'0'
         TR    W9(8),TRTABL
         STC   4,MOVT+1
MOVT     MVC   15(0,9),W9
         BCR   15,8
ENTSAVE  DC    2F'0'
         CNOP  0,4
W9       DC    CL9' '
TRTABL   DC    C'0123456789ABCDEF'
DATA     DC    C'0'
SLK1     DC    CL6' '
FLD1     DC    CL8' '
BLNK1    DC    CL1' '
DAT1     DC    CL8' '
*
SLK2     DC    CL6' '
FLD2     DC    CL8' '
BLNK2    DC    CL1' '
DAT2     DC    CL8' '
*
SLK3     DC    CL6' '
FLD3     DC    CL8' '
BLNK3    DC    CL1' '
DAT3     DC    CL8' '
*
SLK4     DC    CL6' '
FLD4     DC    CL8' '
BLNK4    DC    CL1' '
DAT4     DC    CL8' '
         DC    CL50' '
CON1     DC    F'1'
CON50    DC    F'50'
HOLD15   DC    FL3'0'
RETNCD   DC    X'00'
DSCBHEAD DS    0CL133
         DC    CL1'1'      SKIP TO PAGE TOP
         DC    C' ** NIBSIO DSCB FORMAT FOR '
HEAD3    DC    CL44' IF YOU CAN READ THIS, CALL JACK KELLER'
  DC  CL7'VOLSER='
ZINRX  DC  CL6' '
  DC  CL90'     **  SEE  IBM  SRL  C28-6628.'
AREA     DS    0D
         DS    CL135
  DS  CL5
         DS    CL210
ARA      DS    0D
         DS    CL135
POINT    DS    CL5
         DS    CL210
NOVOLHD  DS    0D
         DC    C' ** VOLUME IS NOT MOUNTED WHICH WAS REQUESTED ** '
         DC    CL85' '
IOERRHD  DS    0D
         DC    C' ** AN UNRECOVERABLE INPUT/OUTPUT ERROR OCCURED '
         DC    C' WHILE TRYING TO READ A DATA SET CONTROL BLOCK. '
         DC    CL38' '
PTRDS  DC  CL6' '
TYPESW  DC  C' '
NODSCBHD DS    0D
         DC    C' ** NO DATA SET CONTROL BLOCK ON THE VOLUME SPEC'
         DC    C'IFIED.  VERIFY DATA SET NAME AND VOLUME.        '
         DC    CL38' '
NULHEAD  DC    C'1 ** NO PARAMETER LIST ACCOMPANYING DSCB DUMP '
         DC    C'REQUEST ** '
         DC    CL77' '
VOLNUM   DC    CL6' '
NAME     DC    CL44'DUMMY'
BTY      DC    C' '
TAGF1   DC  CL8'DS1FMTID'
         DC    FL1'1'
         DC    CL8'DS1DSSN'
         DC    FL1'2'
         DC    CL8'       '
         DC    FL1'4'
         DC    CL8'DS1VOLSQ'
         DC    FL1'2'
         DC    CL8'DS1CREDT'
         DC    FL1'3'
         DC    CL8'DS1EXPDT'
         DC    FL1'3'
         DC    CL8'DS1NOEPV'
         DC    FL1'1'
         DC    CL8'DS1NOBDB'
         DC    FL1'1'
         DC    CL8'RESERVED'
         DC    FL1'1'
         DC    CL8'DS1SYSCD'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'RESERVED'
         DC    FL1'3'
         DC    CL8'RESERVED'
         DC    FL1'4'
         DC    CL8'DS1DSORG'
         DC    FL1'2'
         DC    CL8'DS1RECFM'
         DC    FL1'1'
         DC    CL8'DS1OPTCD'
         DC    FL1'1'
         DC    CL8'DS1BLKL'
         DC    FL1'2'
         DC    CL8'DS1LRECL'
         DC    FL1'2'
         DC    CL8'DS1KEYL'
         DC    FL1'1'
         DC    CL8'DS1RKP'
         DC    FL1'2'
         DC    CL8'DS1DSIND'
         DC    FL1'1'
         DC    CL8'DS1SCALO'
         DC    FL1'4'
         DC    CL8'DS1LSTAR'
         DC    FL1'3'
         DC    CL8'DS1TRBAL'
         DC    FL1'2'
         DC    CL8'RESERVED'
         DC    FL1'2'
         DC    CL8'DS1EXT1'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS1EXT2'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS1EXT3'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS1PTRDS'
         DC    FL1'2'
         DC    CL8'        '
         DC    FL1'3'
         DC    C'DDDD'
TAGF2    DC    CL8'DS2CODE'
         DC    FL1'1'
         DC    CL8'DS22MIND'
         DC    FL1'3'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2L2MEN'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'DS23MIND'
         DC    FL1'3'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2L3MIN'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'RESERVED'
         DC    FL1'4'
         DC    CL8'RESERVED'
         DC    FL1'4'
         DC    CL8'RESERVED'
         DC    FL1'4'
         DC    CL8'RESERVED'
         DC    FL1'4'
         DC    CL8'RESERVED'
         DC    FL1'3'
         DC    CL8'DS2FMTID'
         DC    FL1'1'
         DC    CL8'DS2NOLEV'
         DC    FL1'1'
         DC    CL8'DS2DVIND'
         DC    FL1'1'
         DC    CL8'DS21RCYL'
         DC    FL1'3'
         DC    CL8'DS2LTCYL'
         DC    FL1'2'
         DC    CL8'DS2CYLOV'
         DC    FL1'1'
         DC    CL8'DS2HIRIN'
         DC    FL1'1'
         DC    CL8'DS2HIRPR'
         DC    FL1'1'
         DC    CL8'DS2HIROV'
         DC    FL1'1'
         DC    CL8'DS2RSHTR'
         DC    FL1'1'
         DC    CL8'DS2HIRTI'
         DC    FL1'1'
         DC    CL8'RESERVED'
         DC    FL1'1'
         DC    CL8'DS2TAGDT'
         DC    FL1'2'
         DC    CL8'DS2RORG3'
         DC    FL1'3'
         DC    CL8'DS2NOBYT'
         DC    FL1'2'
         DC    CL8'DS2NOTRK'
         DC    FL1'1'
         DC    CL8'DS2PRCTR'
         DC    FL1'4'
         DC    CL8'DS2STIND'
         DC    FL1'1'
         DC    CL8'DS2CYLAD'
         DC    FL1'3'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2ADLIN'
         DC    FL1'3'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2ADHIN'
         DC    FL1'3'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2LPRAD'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2LTRAD'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'DS2LCYAD'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'DS2LMSAD'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'DS2LOVAD'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2BYOVL'
         DC    FL1'2'
         DC    CL8'DS2RORG2'
         DC    FL1'2'
         DC    CL8'DS2OVRCT'
         DC    FL1'2'
         DC    CL8'DS2RORG1'
         DC    FL1'2'
         DC    CL8'RESERVED'
         DC    FL1'3'
         DC    CL8'DS2PTRDS'
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'1'
         DC    C'DDDD'
TAGF3    DC    CL8'DS3CODE'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'DS3EXTNT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS3EXTNT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS3EXTNT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS3FMTID'
         DC    FL1'1'
         DC    CL8'DS1ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS2ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS3ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS4ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS5ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS6ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS7ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS8ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS9ADEXT'
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'1'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'        '
         DC    FL1'4'
         DC    CL8'DS3PTRDS'
         DC    FL1'2'
         DC    CL8'        '
         DC    FL1'3'
KDDDD    DC    C'DDDD'
         LTORG
         END
