000010 IDENTIFICATION DIVISION.                                          RIGTEST
000020                                                                   RIGTEST
000030 PROGRAM-ID.     'RIGTEST'.                                        RIGTEST
000040                                                                   RIGTEST
000050 AUTHOR.         P.S.GRANT.                                        RIGTEST
000060                                                                   RIGTEST
000070 REMARKS.        RIGAM TESTING PROGRAM.                            RIGTEST
000080                 EXECUTES RIGAM I/O ACCORDING TO CARD INPUT.       RIGTEST
000090                    PRINTS CARD IMAGE AND RESULT.                  RIGTEST
000100                                                                   RIGTEST
000110 ENVIRONMENT DIVISION.                                             RIGTEST
000120                                                                   RIGTEST
000130 CONFIGURATION SECTION.                                            RIGTEST
000140                                                                   RIGTEST
000150 SOURCE-COMPUTER.    IBM-360.                                      RIGTEST
000160 OBJECT-COMPUTER.    IBM-360.                                      RIGTEST
000170                                                                   RIGTEST
000180 INPUT-OUTPUT SECTION.                                             RIGTEST
000190 FILE-CONTROL.                                                     RIGTEST
000200         SELECT  CARDS       ASSIGN  TO  'SYSIN'    UTILITY.       RIGTEST
000210         SELECT  PRINT       ASSIGN  TO  'SYSPRINT' UTILITY.       RIGTEST
000220                                                                   RIGTEST
000230                                                                   RIGTEST
000240 DATA DIVISION.                                                    RIGTEST
000250                                                                   RIGTEST
000260 FILE SECTION.                                                     RIGTEST
000270                                                                   RIGTEST
000280 FD      CARDS                                                     RIGTEST
000290         RECORDING MODE IS F                                       RIGTEST
000300         LABEL RECORDS ARE STANDARD                                RIGTEST
000310         RECORD CONTAINS 80 CHARACTERS                             RIGTEST
000320         BLOCK CONTAINS 1 RECORDS                                  RIGTEST
000330         DATA RECORD IS CARD-REC.                                  RIGTEST
000340 01      CARD-REC.                                                 RIGTEST
000350     03  CARD-OPCODE             PICTURE XXX.                      RIGTEST
000352     03  CARD-FILETYPE           PICTURE X.                        RIGTEST
000354     03  CARD-FILENO             PICTURE XXX.                      RIGTEST
000356     03  CARD-FILEID             PICTURE XXX.                      RIGTEST
000360     03  CARD-KEY                PICTURE X(11).                    RIGTEST
000370     03  CARD-DATA               PICTURE X(13).                    RIGTEST
000375     03  CARD-RECN               PICTURE X(6).                     RIGTEST
000380     03  CARD-RECNO REDEFINES CARD-RECN PICTURE 9(6).             RIGTEST
000390     03  FILLER                  PICTURE X(40).                    RIGTEST
000390                                                                   RIGTEST
000400 FD      PRINT                                                     RIGTEST
000410         RECORDING MODE IS F                                       RIGTEST
000420         LABEL RECORDS ARE STANDARD                                RIGTEST
000430         RECORD CONTAINS 133 CHARACTERS                            RIGTEST
000440         BLOCK CONTAINS 1 RECORDS                                  RIGTEST
000450         DATA RECORD IS PRINT-REC.                                 RIGTEST
000460 01      PRINT-REC.                                                RIGTEST
000470     03  FILLER                  PICTURE X.                        RIGTEST
000480     03  PRINT-LINE.                                               RIGTEST
               05    FILLER            PICTURE X(34).                    RIGTEST
               05    RETURN-IMAGE      PICTURE X(14).                    IGTEST
000490         05    FILLER            PICTURE X(84).                    RIGTEST
000500 WORKING-STORAGE SECTION.                                          RIGTEST
000510 77      KEY-STORE               PICTURE X(11) VALUE SPACES.       RIGTEST
000520 77      RIGAM                   PICTURE X(8) VALUE 'RIGAM'.       RIGTEST
000530                                                                   RIGTEST
000540                                                                   RIGTEST
000550 01      RETURN-MSG.                                               RIGTEST
000555     03      RETURN-IND          PICTURE Z9.                       RIGTEST
000560     03      RECNO-IN            PICTURE ZZZZZ9.                   RIGTEST
000570     03      RECNO-OUT           PICTURE ZZZZZ9.                   RIGTEST
000590                                                                   RIGTEST
000600 01      RIGAM-FILE.                                               RIGTEST
000610     03      FILLER      PICTURE S999 COMPUTATIONAL VALUE 2.       RIGTEST
000620     03      FILLER      PICTURE S999 COMPUTATIONAL VALUE 2.       RIGTEST
000630     03      RECORD      PICTURE S999999 COMPUTATIONAL VALUE 0.    RIGTEST
000640     03      INDICATOR   PICTURE S999 COMPUTATIONAL VALUE 0.       RIGTEST
000650     03      OPCODE      PICTURE XXX  VALUE SPACES.                RIGTEST
000660     03      RIG-FILETYPE        PICTURE X.                        RIGTEST
000670     03      RIG-FILENO          PICTURE XXX.                      RIGTEST
000680     03      RIG-KEY     PICTURE X(11) VALUE SPACES.               RIGTEST
000690     03      FILLER      PICTURE X(24) VALUE SPACES.               RIGTEST
000700     03      FILLER      PICTURE XX    VALUE 'NN'.                 RIGTEST
000710                                                                   RIGTEST
000720 01      DATA-AREA.                                                RIGTEST
000730     03      FILE-ID     PICTURE XXX.                              RIGTEST
000740     03      FILLER.                                               RIGTEST
000750         05      FILE-KEY        PICTURE X(11).                    RIGTEST
000760         05      FILE-DATA       PICTURE X(555).                   RIGTEST
000770                                                                   RIGTEST
000780 01      LOOP-MSG.                                                 RIGTEST
000790     03      FILLER              PICTURE X(20)                     RIGTEST
000800             VALUE 'LOOP - LATEST KEY = '.                         RIGTEST
000810     03      LOOP-NEWKEY         PICTURE X(11).                    RIGTEST
000820     03      FILLER              PICTURE X(18)                     RIGTEST
000830             VALUE ' - PREVIOUS KEY = '.                           RIGTEST
000840     03      LOOP-OLDKEY         PICTURE X(11).                    RIGTEST
000850                                                                   RIGTEST
000860                                                                   RIGTEST
100100 PROCEDURE DIVISION.                                               RIGTEST
100200                                                                   RIGTEST
100300 START-UP.                                                         RIGTEST
100400     OPEN INPUT CARDS.                                             RIGTEST
100500     OPEN OUTPUT PRINT.                                            RIGTEST
100600     MOVE  ' RIGAM TESTING PROGRAM           IND RECIN RECOUT'     RIGTEST
100650             TO PRINT-LINE.                                        RIGTEST
100700     WRITE PRINT-REC AFTER 0 LINES.                                RIGTEST
100800     ENTER LINKAGE.                                                RIGTEST
100900     CALL 'DYNAML' USING RIGAM.                                    RIGTEST
101000     ENTER COBOL.                                                  RIGTEST
101800 READ-CARDS.                                                       RIGTEST
101900     READ CARDS AT END GO TO EOJ.                                  RIGTEST
102000     MOVE CARD-REC TO PRINT-LINE.                                  RIGTEST
102010     IF CARD-OPCODE NOT = SPACES,                                  RIGTEST
102200     MOVE CARD-OPCODE TO OPCODE.                                   RIGTEST
102300     MOVE CARD-KEY  TO RIG-KEY FILE-KEY.                           RIGTEST
102310     MOVE CARD-FILETYPE TO RIG-FILETYPE.                           RIGTEST
102320     MOVE CARD-FILENO TO RIG-FILENO.                               RIGTEST
102400     MOVE CARD-DATA TO FILE-DATA.                                  RIGTEST
102500     MOVE CARD-FILEID TO FILE-ID.                                  RIGTEST
10525      TRANSFORM CARD-RECN  FROM SPACE TO ZERO.                      RIGTEST
102550     MOVE CARD-RECNO TO RECORD RECNO-IN.                           RIGTEST
102600     PERFORM RIGIO THRU RIGIO-END.                                 RIGTEST
102700     IF  OPCODE  NOT = 'RSG'                                       RIGTEST
102750                 AND OPCODE NOT = 'RSA'                            RIGTEST
102800                 GO TO READ-CARDS.                                 RIGTEST
102900                                                                   RIGTEST
103000 PRINT-FILE.                                                       RIGTEST
103100     MOVE DATA-AREA TO PRINT-LINE.                                 RIGTEST
103300     MOVE FILE-KEY TO KEY-STORE.                                   RIGTEST
103400     PERFORM RIGIO THRU RIGIO-END.                                 RIGTEST
104100     IF  INDICATOR = 29                                            RIGTEST
104200                 MOVE 'END OF FILE PRINT' TO PRINT-LINE,           RIGTEST
104300                 PERFORM PRINTOUT                                  RIGTEST
104400                 GO TO READ-CARDS.                                 RIGTEST
103500     IF  KEY-STORE NOT LESS THAN FILE-KEY                          RIGTEST
103550                 AND OPCODE = 'RSG'                               RIGTEST
103600                 MOVE FILE-KEY TO LOOP-NEWKEY                      RIGTEST
103700                 MOVE KEY-STORE TO LOOP-OLDKEY                     RIGTEST
103800                 MOVE LOOP-MSG TO PRINT-LINE,                      RIGTEST
103900                 PERFORM PRINTOUT                                  RIGTEST
104000                 GO TO READ-CARDS.                                 RIGTEST
104500     IF  INDICATOR NOT = 1                                         RIGTEST
104600                 MOVE 'SOMETHING ODD. OPCODE =RSG' TO PRINT-LINE,  RIGTEST
104700                 PERFORM PRINTOUT                                  RIGTEST
104800                 GO TO READ-CARDS.                                 RIGTEST
104900     GO TO PRINT-FILE.                                             RIGTEST
105000                                                                   RIGTEST
105100 RIGIO.                                                            RIGTEST
105200     ENTER LINKAGE.                                                RIGTEST
105300     CALL 'DYNAMO' USING RIGAM                                     RIGTEST
105400                         RIGAM-FILE                                RIGTEST
105500                         DATA-AREA                                 RIGTEST
105600                         EXCEPTIONS.                               RIGTEST
105700     ENTER COBOL.                                                  RIGTEST
105800 EXCEPTIONS.                                                       RIGTEST
105900     MOVE INDICATOR  TO RETURN-IND.                                RIGTEST
105950     MOVE RECORD TO RECNO-OUT.                                     RIGTEST
106000     MOVE RETURN-MSG TO RETURN-IMAGE.                              RIGTEST
106100 PRINTOUT.                                                         RIGTEST
106200     WRITE  PRINT-REC AFTER 2 LINES.                               RIGTEST
106300     MOVE SPACES TO PRINT-LINE.                                    RIGTEST
106400 RIGIO-END.  EXIT.                                                 RIGTEST
106500                                                                   RIGTEST
106600 EOJ.                                                              RIGTEST
107600     MOVE 'RIGAM TEST END' TO PRINT-LINE.                          RIGTEST
107700     PERFORM PRINTOUT.                                             RIGTEST
107800     CLOSE  CARDS PRINT.                                           RIGTEST
107900     STOP RUN.                                                     RIGTEST
