       IDENTIFICATION DIVISION.
       PROGRAM-ID.     'T375PDP'
       AUTHOR. J NOLS  IBM 3750 - SWITCHING SYSTEM.
       DATE-WRITTEN.       JANUARY 1976.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.    C01 IS TO-NEXT-PAGE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT T375F010 ASSIGN TO UT-S-T375F010.
           SELECT TOBLE ASSIGN TO UT-S-TABLE.
           SELECT T375RDP ASSIGN TO UR-S-T375RDP.
       DATA DIVISION.
       FILE SECTION.
       FD  T375RDP
           RECORDING F
           BLOCK 1 RECORDS
           RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS OMITTED
           DATA RECORD IS PRINT.
       01  PRINT.
           03  CTRLCHAR    PICTURE X.
           03  FILLER      PICTURE X(26).
           03  CARD-IMAGE  PICTURE X(80).
           03  FILLER      PICTURE X(26).
       FD  TOBLE
           RECORDING F
           BLOCK 0 RECORDS
           RECORD CONTAINS  80 CHARACTERS
           LABEL RECORDS STANDARD
           DATA RECORD IS CARD.
       01  CARD        PICTURE X(80).
       FD  T375F010
           RECORDING F
           BLOCK 5 RECORDS
           RECORD CONTAINS 300 CHARACTERS
           LABEL RECORDS STANDARD
           DATA RECORD IS TELINFO.
       01  TELINFO.
           03  FILLER          PICTURE X(16).
           03  CIVIL-ST        PICTURE X.
           03  STATOS          PICTURE X.
           03  NAME            PICTURE X(30).
           03  FILLER          PICTURE X(45).
           03  THTU            PICTURE X(4).
           03  OUTLET          PICTURE X(8).
           03  FILLER          PICTURE X(13).
           03  CLASS-SERV      PICTURE 99.
           03  FILLER          PICTURE X(13).
           03  REROUTE         PICTURE X.
           03  FILLER          PICTURE X(10).
           03  REROUTHTU       PICTURE X(4).
           03  FILLER          PICTURE X(152).
       WORKING-STORAGE SECTION.
       77  ONE             PICTURE 9 VALUE 1.
       77  MR              PICTURE X(4) VALUE '  MR'.
       77  MRS             PICTURE X(4) VALUE ' MRS'.
       77  MISS            PICTURE X(4) VALUE 'MISS'.
       77  IND             PICTURE 9999 COMPUTATIONAL VALUE ZERO.
       77  CLSV            PICTURE 9999 COMPUTATIONAL VALUE ZERO.
       77  C54             PICTURE 9999 COMPUTATIONAL VALUE ZERO.
       77  M54             PICTURE 9999 COMPUTATIONAL VALUE 51.
       01  EXT-NAME-LINE.
           03  FILLER      PICTURE X(21).
           03  P-THTU      PICTURE X(4).
           03  FILLER      PICTURE X(3).
           03  P-CIVIL     PICTURE X(4).
           03  FILLER      PICTURE X(2).
           03  P-NAME      PICTURE X(30).
           03  FILLER      PICTURE X(16).
       01  REROUTE-LINE.
           03  FILLER      PICTURE X(32).
           03  P-RTHTU     PICTURE X(4).
           03  FILLER      PICTURE X(44).
       01  OUTLET-CLSV-LINE.
           03  FILLER      PICTURE X(58).
           03  P-OUTLET    PICTURE X(8).
           03  FILLER      PICTURE X(14).
       01  TABE.
           03  FILLER OCCURS 561 TIMES.
               05  TE      PICTURE X(80).
       PROCEDURE DIVISION.
           OPEN INPUT TOBLE.
           OPEN OUTPUT T375RDP.
       READ-TABLE.
           READ TOBLE
               AT END GO TO READ-T375F010-OPEN.
           ADD 1 TO IND.
           MOVE CARD TO TE (IND).
           MOVE SPACES TO PRINT.
           MOVE CARD TO CARD-IMAGE.
           WRITE PRINT BEFORE ADVANCING ONE LINES.
           ADD 1 TO C54.
           IF C54 = M54
               MOVE SPACES TO CARD-IMAGE
               WRITE PRINT AFTER ADVANCING TO-NEXT-PAGE
               SUBTRACT  C54 FROM C54.
           GO TO READ-TABLE.
       READ-T375F010-OPEN.
           CLOSE TOBLE.
           OPEN INPUT T375F010.
       READ-T375F010.
           READ T375F010
               AT END GO TO PROGRAM-END.
           IF THTU = SPACES
               GO TO READ-T375F010.
           IF CLASS-SERV = '  '
               GO TO READ-T375F010.
           IF CLASS-SERV = 16
               MOVE 11 TO CLASS-SERV.
           MOVE CLASS-SERV TO CLSV.
           MULTIPLY CLSV       BY M54 GIVING IND.
           SUBTRACT M54 FROM IND.
           ADD 1 TO IND.
           MOVE 1 TO C54.
       LOOP-DISTR-PAGE.
           IF C54 NOT = 4 GO TO NO4.
               MOVE TE (IND) TO EXT-NAME-LINE.
               MOVE THTU TO P-THTU.
               MOVE NAME TO P-NAME.
               IF CIVIL-ST = '1'
                   MOVE MR   TO P-CIVIL.
               IF CIVIL-ST = '2'
                   MOVE MRS  TO P-CIVIL.
               IF CIVIL-ST = '3'
                   MOVE MISS TO P-CIVIL.
               MOVE SPACES TO P-CIVIL.
               MOVE EXT-NAME-LINE TO CARD-IMAGE.
               GO TO WRITE-LINE.
       NO4.
           IF C54 = 48 AND REROUTE NOT = '0'
               MOVE SPACES TO CARD-IMAGE
               GO TO WRITE-LINE.
           IF C54 = 49 AND REROUTE = '0'
               MOVE TE (IND) TO REROUTE-LINE
               MOVE REROUTHTU TO P-RTHTU
               MOVE REROUTE-LINE TO CARD-IMAGE
               GO TO WRITE-LINE.
           IF C54 = 49 AND REROUTE NOT = '0'
               MOVE SPACES TO CARD-IMAGE
               GO TO WRITE-LINE.
           IF C54 = 51
               MOVE TE (IND) TO OUTLET-CLSV-LINE
               MOVE OUTLET TO P-OUTLET
               MOVE OUTLET-CLSV-LINE TO CARD-IMAGE
               GO TO WRITE-LINE.
       NORMAL.
           MOVE TE (IND) TO CARD-IMAGE.
       WRITE-LINE.
           WRITE PRINT BEFORE ADVANCING ONE LINES.
           IF C54 = 51
               MOVE SPACES TO CARD-IMAGE
               WRITE PRINT AFTER ADVANCING TO-NEXT-PAGE
               GO TO READ-T375F010.
           ADD 1 TO IND.
           ADD 1 TO C54.
           GO TO LOOP-DISTR-PAGE.
       PROGRAM-END.
           CLOSE T375F010.
           CLOSE T375RDP.
           STOP RUN.
