AA       START
         PRINT ON,NODATA,GEN
         SAVE  (14,12)
         USING AA,R3,R4,R11
         LR    R3,R15
         LA    R4,4095(R3)
         LA    R4,1(R4)
         LA    R11,4095(R4)
         LA    R11,1(R11)
         ST    R13,SAVE+4
         LR    R12,R13
         LA    R13,SAVE
         ST    R13,8(R12)
         USING SAVE,R13,R12
         LA    R12,4095(R13)
         LA    R12,1(R12)
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
         L     R5,0(R0,R1)
         MVC   NAME(5),2(R5)
         OPEN  (DCBF,(INPUT))
         OPEN  (DCBL,(INPUT))
         OPEN  (DCBH,(INPUT))
         OPEN  (SNAPDUMP,(OUTPUT))
         OPEN  (DCBM,(OUTPUT))
         OPEN  (DCBP,(OUTPUT))
         OPEN  (DCBC,(INPUT))
         OPEN  (DCBI,(OUTPUT))
         BLDL  DCBF,LIST
         LTR   R15,R15
         BNZ   TESTCC
         FIND  DCBF,TTR,C
         READ  DECBF,SF,DCBF,FBUF,84
         CHECK DECBF
         BLDL  DCBL,LIST
         LTR   R15,R15
         BNZ   TESTCC
         FIND  DCBL,TTR,C
         READ  DECBL,SF,DCBL,LBUF,792
         CHECK DECBL
* TEST ON PARAMETERS
         MVC   PARLENG+2(2),0(R5)
         CLC   PARLENG+2(2),=XL2'5'
         BE    GOON
         L     R6,PARLENG
         S     R6,HSEVEN
         LA    R5,8(R5)
SCANO    DS    0H
         EX    R6,TRT
         LR    R8,R1
         BC    8,TESTPAR
         BC    4,SCANA
         BC    2,ERROR60
SCANA    DS    0H
         SR    R8,R5
         S     R8,HONE
         EX    R8,CTHTU0
         BE    STHTU0
         EX    R8,CTHTU1
         BE    STHTU1
         EX    R8,CTHTU2
         BE    STHTU2
         EX    R8,CSRQP
         BE    SSRQP
         EX    R8,CNBLOCK
         BE    SNBLOCK
         EX    R8,CFDF
         BE    SFDF
         EX    R8,CKEY
         BE    SKEY
         EX    R8,CBTHTU
         BE    SBTHTU
         EX    R8,CBNCOMM
         BE    SBNCOMM
         EX    R8,CRDF1
         BE    SRDF1
         EX    R8,COUTLET
         BE    SOUTLET
         B     ERROR61
STHTU0   DS    0H
         MVC   STA,ON
         B     SCANB
STHTU1   DS    0H
         MVC   STB,ON
         B     SCANB
STHTU2   DS    0H
         MVC   STC,ON
         B     SCANB
SSRQP    DS    0H
         MVC   STD,ON
         B     SCANB
SNBLOCK  DS    0H
         MVC   STE,ON
         B     SCANB
SFDF     DS    0H
         MVC   STF,ON
         B     SCANB
SKEY     DS    0H
         MVC   STG,ON
         B     SCANB
SBTHTU   DS    0H
         MVC   STH,ON
         B     SCANB
SBNCOMM  DS    0H
         MVC   STI,ON
         B     SCANB
SRDF1    DS    0H
         MVC   STJ,ON
         B     SCANB
SOUTLET  DS    0H
         MVC   STK,ON
         B     SCANB
SCANB    DS    0H
         AR    R5,R8
         A     R5,HONE
         A     R5,HONE
         SR    R6,R8
         S     R6,HONE
         S     R6,HONE
         B     SCANO
TESTPAR  DS    0H
         MVC   STZ,ON
         SR    R8,R5
         S     R8,HONE
         EX    R6,CTHTU0
         BE    PTHTU0
         EX    R6,CTHTU1
         BE    PTHTU1
         EX    R6,CTHTU2
         BE    PTHTU2
         EX    R6,CSRQP
         BE    PSRQP
         EX    R6,CNBLOCK
         BE    PNBLOCK
         EX    R6,CFDF
         BE    PFDF
         EX    R6,CKEY
         BE    PKEY
         EX    R6,CBTHTU
         BE    PBTHTU
         EX    R6,CBNCOMM
         BE    PBNCOMM
         EX    R6,CRDF1
         BE    PRDF1
         EX    R6,COUTLET
         BE    POUTLET
         B     ERROR61
PTHTU0   DS    0H
         MVC   STA,ON
         B     GO
PTHTU1   DS    0H
         MVC   STB,ON
         B     GO
PTHTU2   DS    0H
         MVC   STC,ON
         B     GO
PSRQP    DS    0H
         MVC   STD,ON
         B     GO
PNBLOCK  DS    0H
         MVC   STE,ON
         B     GO
PFDF     DS    0H
         MVC   STF,ON
         B     GO
PKEY     DS    0H
         MVC   STG,ON
         B     GO
PBTHTU   DS    0H
         MVC   STH,ON
         B     GO
PBNCOMM  DS    0H
         MVC   STI,ON
         B     GO
PRDF1    DS    0H
         MVC   STJ,ON
         B     GO
POUTLET  DS    0H
         MVC   STK,ON
         B     GO
GO       DS    0H
         TIME
         ST    R1,PDATE
         UNPK  UDATE,PDATE
         PACK  PDATE,UDATE+2(3)
         PACK  PYEAR,UDATE(2)
         MVN   PYEAR+3(1),=X'FF'
         UNPK  UYEAR,PYEAR
         DP    PYEAR,=P'4'
         CP    PYEAR+3(1),=P'0'
         BE    LEAPY
CDATE    DS    0H
         CP    PDATE,PDEC
         BH    DEC
         CP    PDATE,PNOV
         BH    NOV
         CP    PDATE,POKT
         BH    OKT
         CP    PDATE,PSEPT
         BH    SEP
         CP    PDATE,PAUG
         BH    AUG
         CP    PDATE,PJUIL
         BH    JUIL
         CP    PDATE,PJUIN
         BH    JUIN
         CP    PDATE,PMAY
         BH    MAY
         CP    PDATE,PAVR
         BH    AVR
         CP    PDATE,PMAR
         BH    MAR
         CP    PDATE,PFEV
         BH    FEV
         B     JAN
DEC      SP    PDATE,PDEC
         MVC   MONTH,=C'12'
         B     YEAR
NOV      SP    PDATE,PNOV
         MVC   MONTH,=C'11'
         B     YEAR
OKT      SP    PDATE,POKT
         MVC   MONTH,=C'10'
         B     YEAR
SEP      SP    PDATE,PSEPT
         MVC   MONTH,=C'09'
         B     YEAR
AUG      SP    PDATE,PAUG
         MVC   MONTH,=C'08'
         B     YEAR
JUIL     SP    PDATE,PJUIL
         MVC   MONTH,=C'07'
         B     YEAR
JUIN     SP    PDATE,PJUIN
         MVC   MONTH,=C'06'
         B     YEAR
MAY       SP    PDATE,PMAY
         MVC   MONTH,=C'05'
         B     YEAR
AVR      SP    PDATE,PAVR
         MVC   MONTH,=C'04'
         B     YEAR
MAR      SP    PDATE,PMAR
         MVC   MONTH,=C'03'
         B     YEAR
FEV      SP    PDATE,PFEV
         MVC   MONTH,=C'02'
         B     YEAR
JAN      DS    0H
         MVC   MONTH,=C'01'
         B     YEAR
LEAPY    DS    0H
         AP    PDEC,=P'1'
         AP    PNOV,=P'1'
         AP    POKT,=P'1'
         AP    PSEPT,=P'1'
         AP    PAUG,=P'1'
         AP    PJUIL,=P'1'
         AP    PJUIN,=P'1'
         AP    PMAY,=P'1'
         AP    PAVR,=P'1'
         AP    PMAR,=P'1'
         B     CDATE
YEAR     DS    0H
         MVN   PDATE+3(1),=X'FF'
         UNPK  DAY,PDATE
         ZAP   NUMBP,=P'0'
         LA    R8,FBUF
         L     R5,FBUF
         LA    R6,TITLE1+8
         LA    R7,LBUF+132
YYY      DS    0H
         CLC   0(4,R8),FOOO
         BE    XXX
         EX    R5,MVCT1
         EX    R5,MVCT2
         EX    R5,MVCT3
         EX    R5,MVCT4
         EX    R5,MVCT5
         AR    R6,R5
         AR    R7,R5
         LA    R6,3(R6)
         LA    R7,1(R7)
XXX      DS    0H
         L     R5,4(R8)
         LA    R8,4(R8)
         CLC   0(4,R8),FBUF+28
         BE    XXX
         CLC   0(4,R8),=XL4'FF000000'
         BE    GOON
         B     YYY
GOON     DS    0H
         MVC   AREA,AREA-1
         LA    R9,2(R0)
         GET   DCBC,IODISK
LAYOUT   DS     0H
         LA    R10,AREA+144
         LA    R5,AREA+9
         LA    R8,IODISK+4
         LA    R7,FBUF
READ     DS    0H
         GET   DCBC,IODISK
         CLC   BUSY,IODISK
         BNE   NEXTR
         CVD   R9,COUNTER
         MVN   COUNTER+7(1),=X'FF'
         UNPK  KEY,COUNTER
         MVC   AREA+2(5),KEY
         L     R6,0(R7)
         CLC   FOOO,0(R7)
         BE    ERROR62
         EX    R6,MVC1
         ZAP   PARAN,=P'1'
         AR    R10,R6
         A     R10,HONE
MOVE     DS    0H
         EX    R6,MVC
         CP    PARAN,=P'14'
         BE    MOVEP
RETURN   DS    0H
         AR    R8,R6
         A     R8,HONE
         AR    R5,R6
         A     R5,HTHREE
NEXTF    DS    0H
         AP    PARAN,=P'1'
         LA    R7,4(R7)
         CLC   0(4,R7),=X'FF000000'
         BE    LAST
         CLC   FOOO,0(R7)
         BE    NEXTF
         L     R6,0(R7)
         CP    PARAN,=P'8'
         BE    NEXTF
         B     MOVE
MOVEP    DS    0H
         CLC   FOOO,0(R7)
         BE    ERROR63
         EX    R6,MVC2
         B     RETURN
LAST     DS    0H
         LA    R9,1(R9)
         PUT   DCBI,AREA
         B     LAYOUT
NEXTR    DS    0H
         LA    R9,1(R9)
         B     READ
SORTING  DS    0H
         CLC   STG,ON
         BNE   SORTTH
         CLOSE (DCBI)
         OPEN  (DCBI,(INPUT))
         MVC   STG,OFF
         ZAP   NUMBREC,=P'0'
         LA    R10,DCBI
         USING IHADCB,R10
         MVC   EODADST,DCBEODAD+1
         MVC   DCBEODAD+1(3),=AL3(EKEY)
         BAL   R10,KGT
TITLEKEY DS    0H
         BAL   R10,TROUT
LKEY     DS    0H
         GET   DCBI,PRINT+1
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LKEY
         BAL   R10,DAP
         B     TITLEKEY
EKEY     DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         MVC   DCBEODAD+1(3),EODADST
         B     SORTTH
SORTTH   DS    0H
         CLOSE (DCBI)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
REC      DS    0H
         GET   DCBU,RECAA
         L     R5,FBUF
         EX    R5,CLCTHTUB
         BE    REC
         LA    R5,3(R5)
         CLC   FOOO,FBUF+4
         BE    M
         A     R5,FBUF+4
         LA    R5,3(R5)
M        CLC   FBUF+8(4),FOOO
         BE    N
         A     R5,FBUF+8
         LA    R5,3(R5)
N        CLC   FOOO,FBUF+12
         BE    O
         A     R5,FBUF+12
         LA    R5,3(R5)
O        CLC   FOOO,FBUF+16
         BE    P
         A     R5,FBUF+16
         LA    R5,3(R5)
P        CLC   FOOO,FBUF+20
         BE    Q
         A     R5,FBUF+20
         LA    R5,3(R5)
Q        CLC   FOOO,FBUF+24
         BE    R
         A     R5,FBUF+24
         LA    R5,3(R5)
R        DS    0H
         LA    R6,RECAA
         AR    R6,R5
         LA    R6,9(R6)
         ST    R6,NBLADDR
         CLC   FOOO,FBUF+32
         BE    ERROR64
         A     R5,FBUF+32
         LA    R5,3(R5)
         CLC   FOOO,FBUF+36
         BE    S
         A     R5,FBUF+36
         LA    R5,3(R5)
S        CLC   FOOO,FBUF+40
         BE    T
         A     R5,FBUF+40
         LA    R5,3(R5)
T        DS    0H
         CLC   FOOO,FBUF+44
         BE    ERROR65
         LA    R6,RECAA
         AR    R6,R5
         LA    R6,9(R6)
         ST    R6,IBLADDR
         L     R7,FBUF+44
         EX    R7,CLCIBLB
         BE    ERROR66
RETURN66 DS    0H
         A     R5,FBUF+44
         LA    R5,3(R5)
         A     R6,FBUF+44
         LA    R6,3(R6)
         ST    R6,SRQPADDR
         CLC   FOOO,FBUF+48
         BE    ERROR67
         L     R7,FBUF+48
         EX    R7,CLCSRQPB
         BE    ERROR75
RETURN75 DS    0H
         LA    R5,3(R5)
         A     R6,FBUF+48
         LA    R6,3(R6)
         ST    R6,PARADDR
ROUTX    DS    0H
         GET   DCBU,RECBB
         L     R7,FBUF+44
         L     R6,IBLADDR
         LA    R6,170(R6)
         EX    R7,CLCIBLB
         BE    ERROR73
RETURN73 DS    0H
         L     R7,FBUF+48
         L     R6,SRQPADDR
         LA    R6,170(R6)
         EX    R7,CLCSRQPB
         BE    ERROR74
RETURN74 DS    0H
         L     R7,FBUF
         LA    R6,RECAA+9
         EX    R7,THTUID
         BNE   ROUTC
ROUTB    DS    0H
         L     R7,FBUF+48
         L     R6,SRQPADDR
         EX    R7,THTUID
         BNE   ERROR76
RETURN76 DS    0H
         L     R7,FBUF+44
         L     R6,IBLADDR
         EX    R7,THTUID
         BNE   ERROR69
RETURN69 DS    0H
         L     R6,PARADDR
         LA    R7,PARCONTR
ROUTD    DS    0H
         CLC   0(1,R6),0(R7)
         BNE   ERROR70
RETURN70 DS    0H
         LA    R7,1(R7)
         CLC   170(1,R6),0(R7)
         BNE   ERROR71
RETURN71 DS    0H
         ST    R7,REGSAVE
CHECKL   DS    0H
         MVC   RECAA,RECBB
         GET   DCBU,RECBB
         L     R7,FBUF+44
         L     R6,IBLADDR
         LA    R6,170(R6)
         EX    R7,CLCIBLB
         BE    ERROR78
RETURN78 DS    0H
         L     R7,FBUF+48
         L     R6,SRQPADDR
         LA    R6,170(R6)
         EX    R7,CLCSRQPB
         BE    ERROR77
RETURN77 DS    0H
         L     R7,FBUF
         LA    R6,RECAA+9
         EX    R7,THTUID
         BNE   ROUTA
         L     R7,FBUF+48
         L     R6,SRQPADDR
         EX    R7,THTUID
         BNE   ERROR79
RETURN79 DS    0H
         L     R7,FBUF+44
         L     R6,IBLADDR
         EX    R7,THTUID
         BNE   ERROR80
RETURN80 DS    0H
         L     R6,PARADDR
         L     R7,REGSAVE
         B     ROUTD
ROUTC    DS    0H
         L     R6,PARADDR
         CLC   0(1,R6),BL
         BNE   ERROR72
         B     ROUTA
ROUTA    DS    0H
         LA    R7,PARCONTR
         MVC   RECAA,RECBB
         GET   DCBU,RECBB
         L     R7,FBUF+44
         L     R6,IBLADDR
         LA    R6,170(R6)
         EX    R7,CLCIBLB
         BE    ERROR81
RETURN81 DS    0H
         L     R7,FBUF+48
         L     R6,SRQPADDR
         LA    R6,170(R6)
         EX    R7,CLCSRQPB
         BE    ERROR82
RETURN82 DS    0H
         L     R7,FBUF
         LA    R6,RECAA+9
         EX    R7,THTUID
         BE    ROUTB
         L     R6,PARADDR
         CLC   0(1,R6),BL
         BNE   ERROR72
         B     ROUTA
LISTING  DS    0H
         LA    R10,DCBU
         B     CHKPOINT
CHKPOINT DS    0H
         CLOSE (DCBU)
         OPEN  (DCBU,(INPUT))
         CLC   STA,ON
         BE    THTULST0
         CLC   STB,ON
         BE    THTULST1
         CLC   STC,ON
         BE    THTULST2
         B     SRQP
THTULST0 DS    0H
         MVC   STA,OFF
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(ETHTU0)
         BAL   R10,KGT
TITLETH0 DS    0H
         BAL   R10,TROUT
LTHTU0   DS    0H
         GET   DCBU,PRINT+1
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LTHTU0
         BAL   R10,DAP
         B     TITLETH0
ETHTU0   DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         B     CHKPOINT
THTULST1 DS    0H
         ZAP   NUMBREC,=P'0'
         L     R5,FBUF
         MVC   STB,OFF
         MVC   DCBEODAD+1(3),=AL3(ETHTU1)
         BAL   R10,KGT
TITLETH1 DS    0H
         BAL   R10,TROUT
LTHTU1   DS    0H
         GET   DCBU,PRINT+1
         EX    R5,CLCTHTU
         BE    LTHTU1
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LTHTU1
         BAL   R10,DAP
         B     TITLETH1
ETHTU1   DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         B     CHKPOINT
THTULST2 DS    0H
         MVC   STC,OFF
         MVC   DCBEODAD+1(3),=AL3(ETHTU2)
         ZAP   NUMBREC,=P'0'
         L     R5,FBUF
         L     R6,PARADDR
         LA    R7,RECAA
         SR    R6,R7
         LA    R7,PRINT+1
         LA    R6,0(R7,R6)
         BAL   R10,KGT
TITLETH2 DS    0H
         BAL   R10,TROUT
LTHTU2   DS    0H
         GET   DCBU,PRINT+1
         EX    R5,CLCTHTU
         BE    LTHTU2
PTEST    DS    0H
         CLC   0(1,R6),BL
         BE    READN
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,READN
         BAL   R10,DAP
         B     TITLETH2
READN    DS    0H
         GET   DCBU,PRINT+1
         B     PTEST
ETHTU2   DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         B     CHKPOINT
ERROR60  DS    0H
         PUT   DCBM,MERR60
         EX    R6,MVCPARM
         LA    R7,MESS+29
         LA    R7,1(R6,R7)
         MVC   0(1,R7),=X'7D'
         PUT   DCBM,MESS
         PUT   DCBM,BLANK
         B     GO
ERROR61  DS    0H
         PUT   DCBM,MERR61
         EX    R8,MVCPP
         LA    R7,MESSP+31
         LA    R7,1(R8,R7)
         MVC   0(1,R7),=X'7D'
         PUT   DCBM,MESSP
         PUT   DCBM,BLANK
         CLC   STZ,ON
         BE    GO
         B     SCANB
ERROR62  DS    0H
         PUT   DCBM,MERR62
         PUT   DCBM,BLANK
         B     STOP
ERROR63  DS    0H
         PUT   DCBM,MERR63
         PUT   DCBM,BLANK
         B     STOP
ERROR64  DS    0H
         PUT   DCBM,MERR64
         PUT   DCBM,BLANK
         B     STOP
ERROR65  DS    0H
         PUT   DCBM,MERR65
         PUT   DCBM,BLANK
         B     STOP
ERROR66  DS    0H
         PUT   DCBM,MERR66
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN66
ERROR67  DS    0H
         PUT   DCBM,MERR67
         PUT   DCBM,BLANK
         B     STOP
ERROR69  DS    0H
         PUT   DCBM,MERR69
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN69
ERROR70  DS    0H
         PUT   DCBM,MERR70
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN70
ERROR71  DS    0H
         PUT   DCBM,MERR70
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN71
ERROR72  DS    0H
         PUT   DCBM,MERR72
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     ROUTA
ERROR73  DS    0H
         PUT   DCBM,MERR66
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN73
ERROR74  DS    0H
         PUT   DCBM,MERR74
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN74
ERROR75  DS    0H
         PUT   DCBM,MERR74
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN75
ERROR76  DS    0H
         PUT   DCBM,MERR76
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN76
ERROR77  DS    0H
         PUT   DCBM,MERR74
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN77
ERROR78  DS    0H
         PUT   DCBM,MERR66
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN78
ERROR79  DS    0H
         PUT   DCBM,MERR76
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN79
ERROR80  DS    0H
         PUT   DCBM,MERR69
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN80
ERROR81  DS    0H
         PUT   DCBM,MERR66
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN81
ERROR82  DS    0H
         PUT   DCBM,MERR74
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN82
TESTCC   MVC   ZONE,ZONE-1
         CLI   TTR+2,X'00'
         BNE   NEXT
         MVC   ZONE(7),=C'MEMBER '
         MVC   ZONE+8(8),NAME
         MVC   ZONE+17(9),=C'NOT FOUND'
         B     PUTT
NEXT     MVC   ZONE(24),=C' SOME ERROR IN BUILDLIST'
PUTT     PUT   DCBM,ZONE-1
         B     STOP
SRQP     DS    0H
         LA    R10,DCBU
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         MVC   DCBEODAD+1(3),=AL3(SORTSRQP)
         L     R5,FBUF+48
         L     R6,SRQPADDR
         LA    R7,RECAA+144
         LA    R8,1(R5,R7)
         L     R9,PARADDR
RSRQP    DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         EX    R5,MVCSRQP
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RSRQP
SORTSRQP DS    0H
         CLOSE (DCBI)
         CLOSE (DCBU)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         L     R6,PARADDR
         LA    R6,3(R6)
         CLC   FOOO,FBUF+56
         BE    U
         A     R6,FBUF+56
         LA    R6,3(R6)
U        DS    0H
         ST    R6,TYPEADDR
         CLC   FBUF+60,=X'00000000'
         BNE   ERROR84
         MVC   DCBEODAD+1(3),=AL3(ESRQPT)
REC1     DS    0H
         GET   DCBU,RECAA
         L     R5,FBUF+48
         L     R6,SRQPADDR
         EX    R5,CLCSRQPB
         BE    REC1
REC2     DS    0H
         L     R5,FBUF+44
         L     R6,IBLADDR
         EX    R5,CLCIBLB
         BE    ERROR83
RETURN83 DS    0H
         L     R6,TYPEADDR
         CLC   0(1,R6),=C'*'
         BE    REC3
         L     R5,FBUF
         EX    R5,CLCTHTUB
         BE    ERROR85
RETURN85 DS    0H
         B     REC4
REC3     DS    0H
         L     R5,FBUF
         EX    R5,CLCTHTUB
         BNE   ERROR86
RETURN86 DS    0H
         B     REC4
REC4     DS    0H
         GET   DCBU,RECBB
         L     R5,FBUF+48
         L     R6,SRQPADDR
         EX    R5,CLCSRQPA
         BE    MVCAB
         EX    R5,THTUID
         BE    REC5
MVCAB   DS    0H
         MVC   RECAA,RECBB
         B     REC2
REC5     DS    0H
         L     R5,FBUF+44
         L     R6,IBLADDR
         EX    R5,THTUID
         BNE   ERROR87
RETURN87 DS    0H
         L     R5,FBUF
         LA    R6,RECAA+9
         EX    R5,THTUID
         BNE   ERROR88
RETURN88 DS    0H
         L     R6,TYPEADDR
         CLC   0(1,R6),=C'*'
         BNE   REC6
         CLC   0(1,R6),170(R6)
         BNE   ERROR89
RETURN89 DS    0H
REC6     DS    0H
         MVC   RECAA,RECBB
         B     REC4
ESRQPT   DS    0H
         CLOSE (DCBU)
         OPEN  (DCBU,(INPUT))
         CLC   STD,ON
         BE    SRQPLST
         B     NBLOCK
SRQPLST  DS    0H
         MVC   STD,OFF
         L     R6,SRQPADDR
         LA    R7,RECAA
         SR    R6,R7
         LA    R7,PRINT+1
         LA    R6,0(R7,R6)
         L     R5,FBUF+48
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(ESRQP)
         BAL   R10,KGT
TITLESR  DS    0H
         BAL   R10,TROUT
LSRQP    DS    0H
         GET   DCBU,PRINT+1
         EX    R5,CLCSRBL
         BE    LSRQP
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LSRQP
         BAL   R10,DAP
         B     TITLESR
ESRQP    DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
         B     NBLOCK
ERROR83  DS    0H
         PUT   DCBM,MERR83
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN83
ERROR84   DS    0H
         PUT   DCBM,MERR84
         PUT   DCBM,BLANK
         B     STOP
ERROR85   DS    0H
         PUT   DCBM,MERR85
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN85
ERROR86   DS    0H
         PUT   DCBM,MERR86
         PUT   DCBM,RECAA
         PUT   DCBM,BLANK
         B     RETURN86
ERROR87   DS    0H
         PUT   DCBM,MERR87
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN87
ERROR88   DS    0H
         PUT   DCBM,MERR88
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN88
ERROR89   DS    0H
         PUT   DCBM,MERR89
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN89
NBLOCK   DS    0H
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTNBL)
         L     R5,FBUF+32
         L     R6,NBLADDR
         LA    R7,RECAA+144
         LA    R8,1(R5,R7)
         L     R9,PARADDR
RNBLOCK  DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         EX    R5,MVCNBL
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RNBLOCK
SORTNBL  DS    0H
         CLOSE (DCBI)
         CLOSE (DCBU)
         LA    R1,PARLIST
         LINK  EP=SORT
         LA    R10,DCBU
         OPEN  (DCBU,(INPUT))
         L     R5,FBUF+32
         L     R6,NBLADDR
         MVC   DCBEODAD+1(3),=AL3(ENBLT)
REC10    DS    0H
         GET   DCBU,RECAA
         EX    R5,CLCNBLBL
         BE    REC10
REC11    DS    0H
         GET   DCBU,RECBB
         L     R5,FBUF+32
         L     R6,NBLADDR
         EX    R5,THTUID
         BE    REC12
         MVC   RECAA,RECBB
         B     REC11
REC12    DS    0H
         L     R5,FBUF+44
         L      R6,IBLADDR
         EX    R5,THTUID
         BNE   ERROR90
RETURN90 DS    0H
         L     R5,FBUF+48
         L     R6,SRQPADDR
         EX    R5,THTUID
         BNE   ERROR91
RETURN91 DS    0H
         L     R5,FBUF
         LA    R6,RECAA+9
         EX    R5,THTUID
         BNE   ERROR92
RETURN92 DS    0H
         L     R6,TYPEADDR
         CLC   0(1,R6),=C'*'
         BNE   REC13
         L     R5,FBUF
         EX    R5,CLCTHTUB
         BNE   ERROR93
RETURN93 DS    0H
         B     REC14
REC13    DS    0H
         EX    R5,CLCTHTUB
         BE    ERROR94
RETURN94 DS    0H
REC14    DS    0H
         MVC   RECAA,RECBB
         B     REC11
ENBLT    DS    0H
         CLOSE (DCBU)
         OPEN  (DCBU,(INPUT))
         CLC   STE,ON
         BE    NBLLST
         B     FDF
NBLLST   DS    0H
         MVC   STE,OFF
         L     R6,NBLADDR
         LA    R7,RECAA
         SR    R6,R7
         LA    R7,PRINT+1
         LA    R6,0(R7,R6)
         L     R5,FBUF+32
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(ENBL)
         BAL   R10,KGT
TITLENBL DS    0H
         BAL   R10,TROUT
LNBL     DS    0H
         GET   DCBU,PRINT+1
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LNBL
         BAL   R10,DAP
         B     TITLENBL
ENBL     DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
         B     FDF
ERROR90  DS    0H
         PUT   DCBM,MERR90
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN90
ERROR91  DS    0H
         PUT   DCBM,MERR91
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN91
ERROR92  DS    0H
         PUT   DCBM,MERR92
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN92
ERROR93  DS    0H
         PUT   DCBM,MERR93
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN93
ERROR94  DS    0H
         PUT   DCBM,MERR93
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN94
FDF      DS    0H
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         L     R5,FBUF
         LA    R6,RECAA+15
         AR    R6,R5
         L     R5,FBUF+4
         AR    R6,R5
         L     R5,FBUF+8
         LA    R7,RECAA+144
         LA    R8,1(R5,R7)
         L     R9,PARADDR
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTFDF)
RFDF     DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         EX    R5,MVCFDF
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RFDF
SORTFDF  DS    0H
         CLOSE (DCBU)
         CLOSE (DCBI)
         LA    R1,PARLIST
         LINK  EP=SORT
         LA    R10,DCBU
         OPEN  (DCBU,(INPUT))
         L     R5,FBUF
         LA    R6,RECAA+9
         LA    R6,3(R5,R6)
         L     R5,FBUF+4
         LA    R6,3(R5,R6)
         ST    R6,FDFADDR
         L     R5,FBUF+8
         MVC   DCBEODAD+1(3),=AL3(EFDFT)
REC20    DS    0H
         GET   DCBU,RECAA
         EX    R5,CLCIBLB
         BE    REC20
REC21    DS    0H
         GET   DCBU,RECBB
         L     R5,FBUF+8
         L     R6,FDFADDR
         EX    R5,THTUID
         BE    REC22
         MVC   RECAA,RECBB
         B     REC21
REC22    DS    0H
         L     R5,FBUF+32
         L     R6,NBLADDR
         EX    R5,THTUID
         BNE   ERROR95
RETURN95 DS    0H
         EX    R5,CLCNBLBL
         BE    ERROR96
RETURN96 DS    0H
         MVC   RECAA,RECBB
         B     REC20
EFDFT    DS    0H
         CLOSE (DCBU)
         OPEN  (DCBU,(INPUT))
         CLC   STF,ON
         BE    FDFLST
         B     SPECIAL
FDFLST   DS    0H
         MVC   STF,OFF
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(EFDF)
         LA    R7,RECAA
         SR    R6,R7
         LA    R7,PRINT+1
         LA    R6,0(R7,R6)
         L     R5,FBUF+8
         BAL   R10,KGT
TITLEFDF DS    0H
         BAL   R10,TROUT
LFDF     DS    0H
         GET   DCBU,PRINT+1
         EX    R5,CLCFDBL
         BE    LFDF
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LFDF
         BAL   R10,DAP
         B     TITLEFDF
EFDF     DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
         B     SPECIAL
ERROR95  DS    0H
         PUT   DCBM,MERR95
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN95
ERROR96  DS    0H
         PUT   DCBM,MERR96
         PUT   DCBM,RECAA
         PUT   DCBM,RECBB
         PUT   DCBM,BLANK
         B     RETURN96
SPECIAL  DS    0H
SPECIAL1 DS    0H
         CLC   STH,ON
         BNE   SPECIAL2
         MVC   STH,OFF
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTBTHT)
         L     R5,FBUF
         LA    R7,RECAA+9
         LA    R7,3(R5,R7)
         LA    R6,RECAA+9
         LA    R8,RECAA+145
         LA    R8,1(R5,R8)
         L     R9,PARADDR
RBTHTU   DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         MVC   RECAA+144(1),0(R7)
         EX    R5,MVCBTHTU
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RBTHTU
SORTBTHT DS    0H
         CLOSE (DCBU)
         CLOSE (DCBI)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
BTHTULST DS    0H
         LA    R6,PRINT+146
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(EBTHTU)
         BAL   R10,KGT
TITLEBTH DS    0H
         BAL   R10,TROUT
LBTHTU   DS    0H
         GET   DCBU,PRINT+1
         CLC   0(14,R6),BLANK
         BE    LBTHTU
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LBTHTU
         BAL   R10,DAP
         B     TITLEBTH
EBTHTU   DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
         B     SPECIAL2
SPECIAL2 DS    0H
         CLC   STI,ON
         BNE   SPECIAL3
         MVC   STI,OFF
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTBNCO)
         L     R5,FBUF
         LA    R7,RECAA+9
         LA    R7,3(R5,R7)
         LA    R6,RECAA+9
         LA    R6,3(R5,R6)
         L     R5,FBUF+4
         LA    R6,3(R5,R6)
         L     R5,FBUF+8
         LA    R6,3(R5,R6)
         L     R5,FBUF+12
         LA    R8,RECAA+145
         LA    R8,1(R5,R8)
         L     R9,PARADDR
RBNCOM   DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         MVC   RECAA+144(1),0(R7)
         EX    R5,MVCBNCOM
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RBNCOM
SORTBNCO DS    0H
         CLOSE (DCBU)
         CLOSE (DCBI)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
BNCOMLST DS    0H
         LA   R6,PRINT+146
         MVC   DCBEODAD+1(3),=AL3(EBNCOM)
         ZAP   NUMBREC,=P'0'
         BAL   R10,KGT
TITLEBNC DS    0H
         BAL   R10,TROUT
LBNCOM   DS    0H
         GET   DCBU,PRINT+1
         CLC   0(14,R6),BLANK
         BE    LBNCOM
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LBNCOM
         BAL   R10,DAP
         B     TITLEBNC
EBNCOM   DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
SPECIAL3 DS    0H
         CLC   STJ,ON
         BNE   SPECIAL4
         MVC   STJ,OFF
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTRDF1)
         L     R5,FBUF
         LA    R7,RECAA+9
         LA    R7,3(R5,R7)
         L     R5,FBUF+4
         LA    R7,3(R5,R7)
         L     R5,FBUF+8
         LA    R7,3(R5,R7)
         L     R5,FBUF+12
         LA    R8,RECAA+144
         LA    R8,1(R5,R8)
         L     R9,PARADDR
         LR    R6,R7
RRDF1    DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         EX    R5,MVCFDF
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     RRDF1
SORTRDF1 DS    0H
         CLOSE (DCBU)
         CLOSE (DCBI)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         LA    R6,PRINT+145
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(ERDF1)
         BAL   R10,KGT
TITLERD1 DS    0H
         BAL   R10,TROUT
LRDF1    DS    0H
         GET   DCBU,PRINT+1
         CLC   0(15,R6),BLANK
         BE    LRDF1
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LRDF1
         BAL   R10,DAP
         B     TITLERD1
ERDF1    DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
SPECIAL4 DS    0H
         CLC   STK,ON
         BNE   SPECIAL5
         MVC   STK,OFF
         OPEN  (DCBI,(OUTPUT))
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         MVC   DCBEODAD+1(3),=AL3(SORTOUTL)
         L     R5,FBUF
         LA    R6,RECAA+9
         LA    R6,3(R5,R6)
         L     R5,FBUF+4
         LA    R8,RECAA+144
         LA    R8,1(R5,R8)
         L     R9,PARADDR
ROUTLET  DS    0H
         GET   DCBU,RECAA
         MVC   RECAA+144(15),BLANK
         EX    R5,MVCFDF
         MVC   0(1,R8),0(R9)
         PUT   DCBI,RECAA
         B     ROUTLET
SORTOUTL DS    0H
         CLOSE (DCBI)
         CLOSE (DCBU)
         LA    R1,PARLIST
         LINK  EP=SORT
         OPEN  (DCBU,(INPUT))
         LA    R10,DCBU
         LA    R6,PRINT+145
         ZAP   NUMBREC,=P'0'
         MVC   DCBEODAD+1(3),=AL3(EOUTLET)
         BAL   R10,KGT
TITLEOUT DS    0H
         BAL   R10,TROUT
LOUTL    DS    0H
         GET   DCBU,PRINT+1
         CLC   0(15,R6),BLANK
         BE    LOUTL
         AP    NUMBREC,=P'1'
         PUT   DCBP,PRINT
         PUT   DCBP,BLANK
         BCT   R9,LOUTL
         BAL   R10,DAP
         B     TITLEOUT
EOUTLET  DS    0H
         MVN   NUMBREC+2(1),=X'FF'
         UNPK  NRITEM,NUMBREC
         PUT   DCBP,ITEMNR
         CLOSE (DCBU)
SPECIAL5 DS    0H
STOP     DS    0H
         L    13,4(13)
         LM    14,12,12(13)
         BR    14
KGT      DS    0H
         MVC   HBUF(1),=C'1'
KGS      DS    0H
         READ  DECBHH,SF,DCBH,HBUF+1
         CHECK DECBHH
         PUT   DCBP,HBUF
         MVC   HBUF(1),BLANK
         B     KGS
EKGT     DS    0H
         CLOSE (DCBH,REREAD),TYPE=T
         ZAP   NUMBP,=P'1'
         BR    R10
TROUT    DS    0H
         LA    R9,26(R0)
         PUT   DCBP,TITLE1
         PUT   DCBP,TITLE2
         PUT   DCBP,TITLE3
         PUT   DCBP,TITLE4
         PUT   DCBP,TITLE5
         PUT   DCBP,BLANK
         BR    R10
DAP      DS    0H
         MVN   NUMBP+1(1),=X'FF'
         UNPK  PAGE,NUMBP
         PUT   DCBP,BLANK
         PUT   DCBP,FLINE
         AP    NUMBP,=P'1'
         BR    R10
SNAPDUMP DCB   DDNAME=SYSNDUMP,DSORG=PS,RECFM=VBA,MACRF=(W),LRECL=125, X
               BLKSIZE=882
DCBH     DCB   DDNAME=DISKH,DSORG=PS,MACRF=R,LRECL=132,RECFM=F,        X
               BLKSIZE=132,EODAD=EKGT
DCBC     DCB   DDNAME=DDDISK,DSORG=PS,MACRF=GM,RECFM=F,LRECL=140,      X
               BLKSIZE=140,EODAD=SORTING
DCBL     DCB   DDNAME=DISKL,DSORG=PO,RECFM=F,MACRF=R,LRECL=792,        X
               BLKSIZE=792
DCBF     DCB   DDNAME=DISKF,DSORG=PO,MACRF=R,LRECL=84,RECFM=F,         X
               BLKSIZE=84
DCBI     DCB   DDNAME=SORTIN,DSORG=PS,RECFM=FB,MACRF=(GM,PM),LRECL=170,X
               BLKSIZE=3400,BUFNO=4
DCBU     DCB   DDNAME=SORTOUT,DSORG=PS,RECFM=FB,MACRF=(GM,PM),         X
               LRECL=170,BLKSIZE=3400,BUFNO=4,EODAD=LISTING
DCBP     DCB   DDNAME=PRINT,DSORG=PS,RECFM=FA,MACRF=PM,LRECL=133,      X
               BLKSIZE=133
DCBM     DCB   DDNAME=MESSPR,DSORG=PS,RECFM=F,MACRF=PM,LRECL=132,      X
               BLKSIZE=132
SAVE     DS    18F
PARLENG  DS    0F
         DC    XL4'0'
HONE     DS    0F
         DC    XL4'1'
MVCPP    MVC   MESSP+31(0),0(R5)
MVCPARM  MVC   MESS+29(0),0(R5)
TRT      TRT   0(0,R5),TABLE
TABLE    DC    XL256'0'
         ORG   TABLE+C','
         DC    C','
         ORG
STA      DC    XL2'0'
STB      DC    XL2'0'
STC      DC    XL2'0'
STD      DC    XL2'0'
STE      DC    XL2'0'
STF      DC    XL2'0'
STG      DC    XL2'0'
STH      DC    XL2'0'
STI      DC    XL2'0'
STJ      DC    XL2'0'
STK      DC    XL2'0'
STZ      DC    XL2'0'
ON       DC    XL2'FFFF'
OFF      DC    XL2'0'
PDEC     DC    P'334'
PNOV     DC    P'304'
POKT     DC    P'273'
PSEPT    DC    P'243'
PAUG     DC    P'212'
PJUIL    DC    P'181'
PJUIN    DC    P'151'
PMAY     DC    P'120'
PAVR     DC    P'90'
PMAR     DC    P'59'
PFEV     DC    P'31'
HBUF     DC    C'1',132C' '
FLINE    DS    0CL144
         DC    100C' '
         DC    C'DATE = '
DAY      DS    CL2
         DC    C'/'
MONTH    DS    CL2
         DC    C'/'
UYEAR     DS    CL2
         DC    5C' '
         DC    C'PAGE = '
PAGE     DS    CL3
         DC    14C' '
NUMBP    DS    PL2
UDATE    DS    CL5
PDATE    DS    F
PYEAR    DS    F
CLCSRQPA CLC   0(0,R6),AST
COUTLET  CLC   0(0,R5),=C'OUTLET'
CTHTU0   CLC   0(0,R5),=C'THTU0'
CTHTU1   CLC   0(0,R5),=C'THTU1'
CTHTU2   CLC   0(0,R5),=C'THTU2'
CBTHTU   CLC   0(0,R5),=C'BTHTU'
CBNCOMM  CLC   0(0,R5),=C'BNCOMM'
CRDF1    CLC   0(0,R5),=C'RDF1'
CLCTHTU  CLC   PRINT+10(0),BL
MVCBTHTU MVC   RECAA+145(0),0(R6)
MVCBNCOM MVC   RECAA+145(0),0(R6)
MVCT1    MVC   2(0,R6),0(R7)
MVCT2    MVC   147(0,R6),132(R7)
MVCT3    MVC   292(0,R6),264(R7)
MVCT4    MVC   437(0,R6),396(R7)
MVCT5    MVC   582(0,R6),528(R7)
MVCSRQP  MVC   RECAA+144(0),0(R6)
CLCSRBL  CLC   0(0,R6),BLANK
CSRQP    CLC   0(0,R5),=C'SRQP'
CNBLOCK  CLC   0(0,R5),=C'NBLOCK'
CFDF     CLC   0(0,R5),=C'FDF'
CKEY     CLC   0(0,R5),=C'KEY'
CLCNBLBL CLC   0(0,R6),BLANK
CLCFDBL  CLC   0(0,R6),BLANK
MVCNBL   MVC   RECAA+144(0),0(R6)
MVCFDF   MVC   RECAA+144(0),0(R6)
AST      DC    20C'*'
BLANK    DC    CL145' '
ITEMNR   DS    0CL144
         DC    CL60' '
         DC    C'NUMBER OF ITEMS = '
NRITEM   DC    CL5' '
         DC    CL61' '
         DC    C' '
AREA     DS    CL170
IODISK   DS    CL140
BUSY     DC    C'FFFF'
COUNTER  DS    D
KEY      DS    CL5
NUMBREC  DC    PL3'0'
RECAA    DS    CL170
RECBB    DS    CL170
CLCTHTUB CLC   RECAA+9(0),BL
BL       DC    CL20' '
NBLADDR  DS    F
IBLADDR  DS    F
FDFADDR  DS    F
PARADDR  DS    F
SRQPADDR DS    F
TYPEADDR DS    F
CLCIBLB  CLC   0(0,R6),BL
CLCSRQPB CLC   0(0,R6),BL
THTUID   CLC   0(0,R6),170(R6)
PARCONTR DC    C'123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
FOOO     DC    XL4'F0000000'
PARAN    DS    PL2
MVC      MVC   0(0,R5),0(R8)
MVC1     MVC   135(0,R5),0(R8)
MVC2     MVC   0(0,R10),0(R8)
HTHREE   DS    0F
         DC    XL4'3'
PRINT    DS    CL170
CONTRCAR DC    C' '
MERR60   DS    0CL144
         DC    CL15' ',C'ID=60',CL20' '
         DC    C'*****  THE PARAMETERFIELD IS ENDED BY A COMMA  *****'
         DC    CL52' '
MERR61   DS    0CL144
         DC    CL15' ',C'ID=61',CL20' '
         DC    C'*****  A PART OF THE PARM.FIELD CONTAINS AN INVALID IDX
               ENTIFIER  *****'
         DC    CL36' '
MERR62   DS    0CL144
         DC    CL15' ',C'ID=62',CL20' '
         DC    C'*****  THTU-FIELD CAN''T BE DUMMY : CHANGE F-TABLE  **X
               ***'
         DC    CL48' '
MERR63   DS    0H
         DC    CL15' ',C'ID=63',CL20' '
         DC    C'*****  PARA-FIELD CAN''T BE DUMMY : CHANGE F-TABLE  **X
               ***'
         DC    CL48' '
MERR64   DS    0H
         DC    CL15' ',C'ID=64',CL20' '
         DC    C'*****  NBLOCK-FIELD CAN''T BE DUMMY : CHANGE F-TABLE  X
               *****'
         DC    CL46' '
MERR65   DS    0CL144
         DC    CL15' ',C'ID=65',CL20' '
         DC    C'*****  IBLOCK-FIELD CAN''T BE DUMMY : CHANGE F-TABLE  X
               *****'
         DC    CL46' '
MERR66   DS    0CL144
         DC    CL15' ',C'ID=66',CL20' '
         DC    C'*****  THE IBLOCK IS BLANK WHILE THTU ISN''T BLANK  **X
               ***'
         DC    CL48' '
MERR67   DS    0CL144
         DC    CL15' ',C'ID=67',CL20' '
         DC    C'*****  SRQP-FIELD CAN''T BE DUMMY : CHANGE F-TABLE  **X
               ***'
         DC    CL48' '
MERR69   DS    0CL144
         DC    CL15' ',C'ID=69',CL20' '
         DC    C'*****  THE IBLOCK''S MUST BE IDENTICAL AS THE THTU''S X
               ARE IDENTICAL  *****'
         DC    CL32' '
MERR70   DS    0CL144
         DC    CL15' ',C'ID=70',CL20' '
         DC    C'*****  THE PARA-FIELD DOESN''T CONTAIN THE RIGHT NUMERI
               IC IN ASCENDING ORDER  *****'
         DC    23C' '
MERR72   DS    0H
         DC    CL15' ',C'ID=72',CL20' '
         DC    C'*****  THE PARA-FIELD MUST BE BLANK AS THIS THTU IS UNX
               IQUE  *****'
         DC    CL39' '
MERR74   DS    0CL144
         DC    CL15' ',C'ID=74',CL20' '
         DC    C'*****  THE SRQP IS BLANK WHILE THTU ISN''T BLANK  ****X
               *'
         DC    CL49' '
MERR76   DS    0CL144
         DC    CL15' ',C'ID=76',CL20' '
         DC    C'*****  THE SRQP''S MUST BE IDENTICAL AS THE THTU''S ARX
               E IDENTICAL  *****'
         DC    CL34' '
MERR83   DS    0CL144
         DC    CL15' ',C'ID=83',CL20' '
         DC    C'*****  IBLOCK IS BLANK WHILE SRQP ISN''T BLANK  *****'
         DC    CL47' '
MERR84   DS    0CL144
         DC    CL15' ',C'ID=84',CL20' '
         DC    C'*****  THE TYPE-FIELD MUST CONTAIN ONE CARACTER  *****X
               '
         DC    CL50' '
MERR85   DS    0CL144
         DC    CL15' ',C'ID=85',CL20' '
         DC    C'*****  SRQP IS NOT BLANK AND TYPE IS NOT AN ASTERISK, X
               WHILE THTU IS BLANK  *****'
         DC    CL24' '
MERR86   DS    0CL144
         DC    CL15' ',C'ID=86',CL20' '
         DC    C'*****  SRQP IS NOT BLANK AND TYPE IS AN ASTERISK, WHILX
               E THTU IS NOT BLANK  *****'
         DC    CL24' '
MERR87   DS    0CL144
         DC    CL15' ',C'ID=87',CL20' '
         DC    C'*****  IBLOCKS MUST BE IDENTICAL AS THE SRQP''S ARE IDE
               ENTICAL  *****'
         DC    CL37' '
MERR88   DS    0CL144
         DC    CL15' ',C'ID=88',CL20' '
         DC    C'*****  THTU''S MUST BE IDENTICAL AS THE SRQP''S ARE IDX
               ENTICAL  *****'
         DC    CL38' '
MERR89   DS    0CL144
         DC    CL15' ',C'ID=89',CL20' '
         DC    C'*****  TYPE INDICATION IS INCORRECT FOR IDENTICAL SRQPX
               ''S  *****'
         DC    CL41' '
MERR90   DS    0CL144
         DC    CL15' ',C'ID=90',CL20' '
         DC    C'*****  IBLOCKS ARE NOT IDENTICAL WHILE NBLOCKS ARE  **X
               ***'
         DC    CL47' '
MERR91   DS    0CL144
         DC    CL15' ',C'ID=91',CL20' '
         DC    C'*****  SRQP''S ARE NOT IDENTICAL WHILE NBLOCKS ARE  **X
               ***'
         DC    CL48' '
MERR92   DS    0CL144
         DC    CL15' ',C'ID=92',CL20' '
         DC    C'*****  THTU''S ARE NOT IDENTICAL WHILE NBLOCKS ARE  **X
               ***'
         DC    CL48' '
MERR93   DS    0CL144
         DC    CL15' ',C'ID=93',CL20' '
         DC    C'*****  AS NBLOCKS ARE IDENTICAL THE THTU AND TYPE CORRX
               ELATION IS INCORRECT  *****'
MERR95   DS    0CL144
         DC    CL15' ',C'ID=95',CL20' '
         DC    C'*****  NBLOCKS MUST BE IDENTICAL AS THE FDF''S ARE IDEX
               NTICAL  *****'
         DC    CL42' '
MERR96   DS    0CL144
         DC    CL15' ',C'ID=96',CL20' '
         DC    C'*****  AS THE FDF''S ARE IDENTICAL, NBLOCK CAN''T BE BX
               LANK  *****'
         DC    CL42' '
MESS     DS    0CL144
         DC    CL10' '
         DC    C'PARAMETERFIELD = '''
         DC    CL125' '
MESSP    DS    0CL144
         DC    CL10' '
         DC    C'PART OF PARM.FIELD = '''
         DC    CL113' '
EODADST  DS    CL3
         CNOP  0,4
PARLIST   DC    X'80',AL3(ADLST)
         DC    X'0000'
ADLST    DC    AL2(LISTEND-LISTBEG)
LISTBEG  DC    A(SORTA)
         DC    A(SORTZ)
         DC    A(RECA)
         DC    A(RECZ)
         DC    A(0)
         DC    A(0)
         DC    X'00006590'
LISTEND  EQU   *
SORTA    DC    C' SORT FIELDS=(144,15,CH,A)'
SORTZ    DC    C' '
RECA     DC    C' RECORD LENGTH=170,TYPE=F'
RECZ     DC    C' '
REGSAVE  DS    F
FBUF     DS    21F
ZONE     DS    0CL145
         DC    C' '
         DS    CL144
LIST     DS    0H
ENTRIES  DC    H'1'
LENG     DC    H'12'
NAME     DC    8C' '
TTR      DS    CL3
K        DS    CL1
HSEVEN   DS    0F
         DC    XL4'7'
TITLES   DS    0CL725
TITLE1   DC    C'1  *****',137C' '
TITLE2   DC    145C' '
TITLE3   DC    C'   *KEY*',137C' '
TITLE4   DC    145C' '
TITLE5   DC    C'   *****',137C' '
         LTORG
LBUF     DS    CL792
         DCBD  DSORG=PS,DEVD=(DA)
         END
