 T581P18: PROC OPTIONS(MAIN);                                              00010
         DCL   IN  FILE RECORD SEQUENTIAL,                                 00020
               OUT FILE RECORD SEQUENTIAL,                                 00030
               1    INREC,                                                 00040
               3    FIL1 CHAR(6),                                          00050
               3    DSN1 CHAR(44),                                         00060
               3    FLAGS0 BIT(1),                                         00070
               3    FLAGS1 BIT(1),                                         00080
               3    FLAGS2 BIT(1),                                         00090
               3    FLAGS3 BIT(1),                                         00100
               3    FLAGS4 BIT(1),                                         00110
               3    FLAGS5 BIT(1),                                         00120
               3    FLAGS6 BIT(1),                                         00130
               3    FLAGS7 BIT(1),                                         00140
               3    FIL2 CHAR(4),                                          00150
               3    VOLSER1 CHAR(6),                                       00160
               3    FIL3 CHAR(39),                                         00170
               1    OUTREC,                                                00180
               3    VOLSER2 CHAR(6),                                       00190
               3    DSN2 CHAR(44),                                         00200
               3    OFFSITE CHAR(7),                                       00210
               SAVE_DSN CHAR(44),                                          00220
               SAVE_OFFSITE CHAR(7);                                       00230
         OPEN FILE(IN) INPUT;                                              00240
         OPEN FILE(OUT) OUTPUT;                                            00250
         ON ENDFILE(IN) GO TO END;                                         00260
 READ:   READ FILE(IN) INTO(INREC);                                        00270
         IF SUBSTR(DSN1,1,8) ^= 'OFFSITE.'                                 00280
         THEN GO TO READ;                                                  00290
         IF FLAGS1 ^= '1'B                                                 00300
         THEN GO TO READ;                                                  00310
         OFFSITE = '       ';                                              00320
         VOLSER2 = VOLSER1;                                                00330
         DSN2 = DSN1;                                                      00340
         IF DSN1 = SAVE_DSN THEN DO;                                       00350
               OFFSITE = SAVE_OFFSITE;                                     00360
               GO TO WRITE;                                                00370
         END;                                                              00380
         I = INDEX(DSN1,' ');                                              00390
         IF I = 0                                                          00400
         THEN I = 45;                                                      00410
         I = I - 10;                                                       00420
         IF SUBSTR(DSN1,1,I) = SUBSTR(SAVE_DSN,1,I)                        00430
         THEN GO TO WRITE;                                                 00440
         OFFSITE = 'OFFSITE';                                              00450
         SAVE_DSN = DSN1;                                                  00460
 WRITE:  SAVE_OFFSITE = OFFSITE;                                           00470
         WRITE FILE(OUT) FROM(OUTREC);                                     00480
         GO TO READ;                                                       00490
 END:    CLOSE FILE(IN);                                                   00500
         CLOSE FILE(OUT);                                                  00510
         END;                                                              00520
