 T581P01: PROC OPTIONS(MAIN);                                              00010
          DCL                                                              00020
          SYSUT1 FILE RECORD SEQUENTIAL,                                   00030
          PRINT  FILE RECORD SEQUENTIAL,                                   00040
          SYSIN  FILE RECORD SEQUENTIAL,                                   00050
          INREC  CHAR(160),                                                00060
          INDATE PIC'99999' DEF INREC POS(4),                              00070
          INTYPE CHAR(2)    DEF INREC POS(50),                             00080
          INJOB  CHAR(8)    DEF INREC POS(52),                             00090
          INSDTE FIXED(5) DEF INREC POS(86),                               00100
          INST   FIXED(7,2) DEF INREC POS(89),                             00110
          INEND  FIXED(7,2) DEF INREC POS(93),                             00120
          INCORE FIXED(5)   DEF INREC POS(100),                            00130
          INPOS(24) BIT(1)  DEF INREC POS(150),                            00140
          INCARD CHAR(80),                                                 00150
          CDSTDAY PIC'99999' DEF INCARD POS(1),                            00160
          CDSTHH  PIC'99'    DEF INCARD POS(6),                            00170
          CDSTMM  PIC'99'    DEF INCARD POS(8),                            00180
          CDNDDAY PIC'99999' DEF INCARD POS(11),                           00190
          CDNDHH  PIC'99'    DEF INCARD POS(16),                           00200
          CDNDMM  PIC'99'    DEF INCARD POS(18),                           00210
          CDTIME  PIC'99'    DEF INCARD POS(21),                           00220
          HEADA CHAR(133) INIT('1  MACHINE USAGE OF JULIAN DATE'),         00230
          HEADA_DATE PIC'99999' DEF HEADA POS(33),                         00240
          1 HEADB,                                                         00250
            3 HB1 CHAR(9) INIT('0TIME'),                                   00260
            3 HB2(15) CHAR(8)                                              00270
               INIT('128','192','256','320','384',                         00280
                    '448','512','576','640','704',                         00290
                    '768','832','896','960','1024'),                       00300
            3 HB3 CHAR(4) INIT(' '),                                       00310
          LINEA  CHAR(133) INIT('   .'),                                   00320
          LINEA_HH  PIC'99' DEF LINEA POS(2),                              00330
          LINEA_MM  PIC'99' DEF LINEA POS(5),                              00340
          LINEA_DET CHAR(123) DEF LINEA POS(10),                           00350
          FILLER  CHAR(200),                                               00360
          LINECT FIXED(3) INIT(70);                                        00370
          DCL                                                              00380
   1  TAB (2,16),                                                          00390
    3 TABNAME CHAR(8) INIT((32)(8)''),                                     00400
            3 TABEND  CHAR(9),                                             00410
            3 TABPOS  FIXED(3),                                            00420
            3 TABSIZE FIXED(3),                                            00430
          NTAB INIT(1),                                                    00440
          INTERVAL FIXED(3) INIT(1),                                       00450
          FIRST BIT(1) INIT('1'B),                                         00460
          KEYSTART  CHAR(9) INIT('000000000'),                             00470
          1 KEYST   DEF KEYSTART,                                          00480
            3 KEYST_DATE PIC'99999',                                       00490
            3 KEYST_HH   PIC'99',                                          00500
            3 KEYST_MM   PIC'99',                                          00510
          KEYEND    CHAR(9) INIT('993652359'),                             00520
          1 KEYND   DEF KEYEND,                                            00530
            3 KEYND_DATE PIC'99999',                                       00540
            3 KEYND_HH   PIC'99',                                          00550
            3 KEYND_MM   PIC'99',                                          00560
          INKEYSTART  CHAR(9),                                             00570
          1 INKEYST   DEF INKEYSTART,                                      00580
            3 INKEYST_DATE PIC'99999',                                     00590
            3 INKEYST_HH   PIC'99',                                        00600
            3 INKEYST_MM   PIC'99',                                        00610
          INKEYEND    CHAR(9),                                             00620
          1 INKEYND   DEF INKEYEND,                                        00630
            3 INKEYND_DATE PIC'99999',                                     00640
            3 INKEYND_HH   PIC'99',                                        00650
            3 INKEYND_MM   PIC'99',                                        00660
          NOWKEY    CHAR(9),                                               00670
          1 NOWKY DEF NOWKEY,                                              00680
            3 NOWKEY_DATE PIC'99999',                                      00690
            3 NOWKEY_HH   PIC'99',                                         00700
            3 NOWKEY_MM   PIC'99',                                         00710
          1 NOWKY2 DEF NOWKEY,                                             00720
            3 NOWKY_YY   PIC '99',                                         00730
            3 NOWKY_DDD  PIC '999',                                        00740
            3 NOWKY_HHMM PIC '9999';                                       00750
          DCL                                                              00760
          JOBNAME CHAR(9),                                                 00770
          ASTK    CHAR(120) INIT((120)'*');                                00780
          OPEN FILE(SYSIN) INPUT;                                          00790
          ON ENDFILE(SYSIN) GO TO A1;                                      00800
          READ FILE(SYSIN) INTO(INCARD);                                   00810
          IF CDTIME ^= 0                                                   00820
          THEN INTERVAL = CDTIME;                                          00830
          KEYST_DATE = CDSTDAY;                                            00840
          KEYST_HH   = CDSTHH;                                             00850
          KEYST_MM   = CDSTMM;                                             00860
          IF CDNDDAY = 0                                                   00870
          THEN IF CDSTDAY ^= 0                                             00880
               THEN KEYND_DATE = CDSTDAY;                                  00890
               ELSE;                                                       00900
          ELSE KEYND_DATE = CDNDDAY;                                       00910
          IF CDNDHH = 0 & CDNDMM = 0                                       00920
          THEN KEYND_HH = 23;                                              00930
          ELSE KEYND_HH = CDNDHH;                                          00940
          IF CDNDMM = 0 & CDNDHH = 0                                       00950
          THEN KEYND_MM = 59;                                              00960
          ELSE KEYND_MM = CDNDMM;                                          00970
 A1:      CLOSE FILE(SYSIN);                                               00980
          NOWKEY = KEYSTART;                                               00990
          OPEN FILE(SYSUT1) INPUT;                                         01000
          OPEN FILE(PRINT) OUTPUT;                                         01010
          ON ENDFILE(SYSUT1) GO TO X1;                                     01020
 B1:      READ FILE(SYSUT1) INTO(INREC);                                   01030
          IF INTYPE = '99'                                                 01040
          THEN GO TO B1;                                                   01050
          INDATE = INSDTE;                                                 01060
          INKEYST_DATE = INDATE;                                           01070
          INKEYND_DATE = INDATE;                                           01080
          I = INST / 60;                                                   01090
          INKEYST_HH = I;                                                  01100
          J = 60 * I;                                                      01110
          INKEYST_MM = INST - J;                                           01120
          I = INEND / 60;                                                  01130
          INKEYND_HH = I;                                                  01140
          J = 60 * I;                                                      01150
          INKEYND_MM = INEND - J;                                          01160
          IF INKEYEND < INKEYSTART                                         01170
          THEN INKEYND_DATE = INKEYND_DATE + 1;                            01180
          IF FIRST                                                         01190
          THEN DO;                                                         01200
                  FIRST = '0'B;                                            01210
                  IF INKEYSTART > NOWKEY                                   01220
                  THEN DO;                                                 01230
                          NOWKEY = INKEYSTART;                             01240
                          NOWKEY_MM = 0;                                   01250
                       END;                                                01260
               END;                                                        01270
 C1:      IF INKEYSTART > NOWKEY                                           01280
          THEN GO TO D1;                                                   01290
          IF INKEYEND < NOWKEY                                             01300
          THEN GO TO B1;                                                   01310
  DO I = 1 TO 16;                                                          01320
             IF INJOB = TABNAME(NTAB,I)                                    01330
             THEN GO TO C2;                                                01340
             IF TABNAME(NTAB,I) = '        '                               01350
             THEN GO TO C2;                                                01360
          END;                                                             01370
 C2:      POSN = 0;                                                        01380
          DO J = 0 TO 23;                                                  01390
             K = 24 - J;                                                   01400
             IF INPOS(K)                                                   01410
             THEN POSN = POSN + 2**J;                                      01420
          END;                                                             01430
          POSN = POSN / 8192.0;                                            01440
          POSN = POSN - 16;                                                01450
          INCORE = INCORE / 8;                                             01460
          IF POSN < 0                                                      01470
          THEN DO;                                                         01480
               IF POSN + INCORE < 0                                        01490
               THEN GO TO B1;                                              01500
               INCORE = INCORE + POSN;                                     01510
               POSN = 0;                                                   01520
          END;                                                             01530
          TABNAME(NTAB,I) = INJOB;                                         01540
          TABEND (NTAB,I) = INKEYEND;                                      01550
          TABSIZE(NTAB,I) = INCORE;                                        01560
          TABPOS(NTAB,I) = POSN;                                           01570
          GO TO B1;                                                        01580
 X1:      INKEYSTART = '999999999';                                        01590
          GO TO C1;                                                        01600
 D1:      IF LINECT > 60                                                   01610
          THEN DO;                                                         01620
                  HEADA_DATE = NOWKEY_DATE;                                01630
                  WRITE FILE(PRINT) FROM(HEADA);                           01640
                  WRITE FILE(PRINT) FROM(HEADB);                           01650
                  LINECT = 1;                                              01660
               END;                                                        01670
          LINEA_HH = NOWKEY_HH;                                            01680
          LINEA_MM = NOWKEY_MM;                                            01690
          LINEA_DET = ' ';                                                 01700
  DO I = 1 TO 16;                                                          01710
             IF TABNAME(NTAB,I) = '        '                               01720
             THEN GO TO D11;                                               01730
             JOBNAME = TABNAME(NTAB,I);                                    01740
             J = INDEX(JOBNAME,' ') - 1;                                   01750
             K = TABPOS(NTAB,I);                                           01760
             IF K + J > 124 THEN GO TO D11;                                01770
             SUBSTR(LINEA_DET,K,J) = JOBNAME;                              01780
             L = TABSIZE(NTAB,I);                                          01790
             IF K + L > 124 THEN L = 124 - K;                              01800
             IF J < L                                                      01810
             THEN SUBSTR(LINEA_DET,K+J,L-J) = ASTK;                        01820
 D11:                                                                      01830
          END;                                                             01840
          WRITE FILE(PRINT) FROM(LINEA);                                   01850
          LINECT = LINECT + 1;                                             01860
          NOWKEY_MM = NOWKEY_MM + INTERVAL;                                01870
          IF NOWKEY_MM > 59                                                01880
          THEN DO;                                                         01890
                  NOWKEY_HH = NOWKEY_HH + 1;                               01900
                  NOWKEY_MM = NOWKEY_MM - 60;                              01910
               END;                                                        01920
          IF NOWKEY_HH > 23                                                01930
          THEN DO;                                                         01940
                  NOWKEY_HH = NOWKEY_HH - 24;                              01950
                  NOWKEY_DATE = NOWKEY_DATE +1;                            01960
               END;                                                        01970
          IF NOWKY_DDD > 366                                               01980
          THEN DO;                                                         01990
               NOWKY_DDD = 1;                                              02000
               NOWKY_YY = NOWKY_YY + 1;                                    02010
          END;                                                             02020
          IF NOWKEY > KEYEND THEN GO TO Z1;                                02030
          I = 3 - NTAB;                                                    02040
          J = 0;                                                           02050
  DO K = 1 TO 16;                                                          02060
             IF TABNAME(NTAB,K) = ' '                                      02070
             THEN GO TO D3;                                                02080
          IF TABEND(NTAB,K) < NOWKEY                                       02090
             THEN GO TO D2;                                                02100
             J = J + 1;                                                    02110
             TABNAME(I,J) = TABNAME(NTAB,K);                               02120
             TABEND (I,J) = TABEND (NTAB,K);                               02130
             TABPOS (I,J) = TABPOS (NTAB,K);                               02140
             TABSIZE(I,J) = TABSIZE(NTAB,K);                               02150
 D2:      END;                                                             02160
 D3: DO K = 1 TO 16;                                                       02170
             TABNAME(NTAB,K) = ' ';                                        02180
          END;                                                             02190
          NTAB = I;                                                        02200
          IF TABNAME(NTAB,1) = ' ' & INKEYSTART = '999999999'              02210
          THEN GO TO Z1;                                                   02220
          GO TO C1;                                                        02230
 Z1:      CLOSE FILE(SYSUT1);                                              02240
          CLOSE FILE(PRINT);                                               02250
          END;                                                             02260
