000000 IDENTIFICATION DIVISION.                                            UT415
000100                                                                     UT415
000200 PROGRAM-ID.                 'T1610'.                                UT415
000300                                                                     UT415
000400 AUTHOR.                     BARRY DAL HERBERT.                      UT415
000500                                                                     UT415
000600 DATE-WRITTEN.               DECEMBER 1969.                          UT415
000700                                                                     UT415
000800 REMARKS.                    EXECUTED VIA 'MINGL' 'MINGE' 'MINGD',   UT415
000900                             THIS PROGRAM WILL PREVENT USER 132      UT415
001000                             ABENDS IN R.P.G., BY ENSURING THAT      UT415
001100                             NON-NUMERIC DIGITS IN A NUMERIC FIELD   UT415
001200                             ARE REPLACED BY A USER DEFINED DIGIT.   UT415
001300                                                                     UT415
001400                             THE INPUT FIELD, HAVING BEEN TESTED     UT415
001500                             FOR INVALID CHARACTERS, CALLS UT410     UT415
001600                             USING DYNAMO, AND CONVERTS THE          UT415
001700                             INPUT STERLING AMOUNT TO PENCE.         UT415
001800                             CONTROL IS THEN RETURNED TO THE         UT415
001900                             R.P.G. CALLING PROGRAM.                 UT415
002000                                                                     UT415
002100                             FIELD2 CONTAINS THE FIELD TO BE ACTED   UT415
002200                             UPON.                                   UT415
002300                                                                     UT415
002400                             FIELD6 CONTAINS THE RETURN FIELD.       UT415
002500                                                                     UT415
100000 ENVIRONMENT DIVISION.                                               UT415
100100                                                                     UT415
100200 CONFIGURATION SECTION.                                              UT415
100300                                                                     UT415
100400 SOURCE-COMPUTER.            IBM-360 F30.                            UT415
100500                                                                     UT415
100600 OBJECT-COMPUTER.            IBM-360 F30.                            UT415
100700                                                                     UT415
200000 DATA DIVISION.                                                      UT415
200100                                                                     UT415
200200 WORKING-STORAGE SECTION.                                            UT415
200300                                                                     UT415
200400 77  UT410                       PICTURE X(8)    VALUE 'UT410   '.   UT415
200500 77  FIRST-TIME                  PICTURE X       VALUE 'Y'.          UT415
200600                                                                     UT415
200700                                                                     UT415
200800                                                                     UT415
200900                                                                     UT415
201000                                                                     UT415
201100                                                                     UT415
201200                                                                     UT415
201300                                                                     UT415
201400                                                                     UT415
201500                                                                     UT415
201600                                                                     UT415
201700                                                                     UT415
201800 01  INPUT-PAR.                                                      UT415
201900     03  FILLER                  PICTURE XXX     VALUE '191'.        UT415
202000     03  FILLER                  PICTURE X(5)    VALUE SPACES.       UT415
202100     03  INPUT-VALUE             PICTURE X(9)    VALUE ZEROS.        UT415
202200     03  FILLER                  PICTURE X(4)    VALUE '  19'.       UT415
202300                                                                     UT415
202400 01  OUTPUT-PAR.                                                     UT415
202500     03  FILLER                  PICTURE X(56)   VALUE SPACES.       UT415
202600     03  PENCE                   PICTURE S9(16)  VALUE ZEROS.        UT415
202700     03  FILLER                  PICTURE X(87)   VALUE SPACES.       UT415
202800     03  INDICATOR               PICTURE X       VALUE '1'.          UT415
202900                                                                     UT415
203000 LINKAGE SECTION.                                                    UT415
203100                                                                     UT415
203200 01  FIELD-TWO.                                                      UT415
203300     03  FIELD-2                 PICTURE 9(8).                       UT415
203400     03  FIELD2                  PICTURE X.                          UT415
203500                                                                     UT415
203600 01  FIELD3                      PICTURE X.                          UT415
203700                                                                     UT415
203800 01  FIELD4                      PICTURE S99.                        UT415
203900                                                                     UT415
204000 01  FIELD5                      PICTURE X.                          UT415
204100                                                                     UT415
204200 01  FIELD-SIX.                                                      UT415
204300     03  FIELD-6                 PICTURE S9(9).                      UT415
204400                                                                     UT415
204500                                                                     UT415
204600                                                                     UT415
204700                                                                     UT415
204800                                                                     UT415
204900                                                                     UT415
300000 PROCEDURE DIVISION.                                                 UT415
300100                                                                     UT415
300200     ENTER LINKAGE.                                                  UT415
300300     ENTRY  'UT415' USING FIELD-TWO, FIELD3, FIELD4,                 UT415
300400                                 FIELD5, FIELD-SIX.                  UT415
300500     ENTER COBOL.                                                    UT415
300600                                                                     UT415
300700     IF          FIRST-TIME IS EQUAL TO 'N'                          UT415
300800     GO TO       NEXT-TEST.                                          UT415
300900                                                                     UT415
301000     ENTER LINKAGE.                                                  UT415
301100     CALL 'DYNAML' USING UT410.                                      UT415
301200     ENTER COBOL.                                                    UT415
301300                                                                     UT415
301400     MOVE        'N' TO FIRST-TIME.                                  UT415
301500                                                                     UT415
301600 NEXT-TEST.                                                          UT415
301700                                                                     UT415
301800     IF          FIELD5 IS NOT EQUAL TO 'N',                         UT415
301900     MOVE        'N' TO FIELD5.                                      UT415
302000                                                                     UT415
302100     IF          FIELD2 IS NOT EQUAL TO '&'      AND                 UT415
302200                 FIELD2 IS NOT EQUAL TO '-'      AND                 UT415
302300                 FIELD2 IS NOT EQUAL TO '9'      AND                 UT415
302400                 FIELD2 IS NOT EQUAL TO '8'      AND                 UT415
302500                 FIELD2 IS NOT EQUAL TO '7'      AND                 UT415
302600                 FIELD2 IS NOT EQUAL TO '6'      AND                 UT415
302700                 FIELD2 IS NOT EQUAL TO '5'      AND                 UT415
302800                 FIELD2 IS NOT EQUAL TO '4'      AND                 UT415
302900                 FIELD2 IS NOT EQUAL TO '3'      AND                 UT415
303000                 FIELD2 IS NOT EQUAL TO '2'      AND                 UT415
303100                 FIELD2 IS NOT EQUAL TO '1'      AND                 UT415
303200                 FIELD2 IS NOT EQUAL TO '0',                         UT415
303300     MOVE        'Y' TO FIELD5,                                      UT415
303400     GO TO       BOOB.                                               UT415
303500                                                                     UT415
303600     IF          FIELD-2 IS NOT NUMERIC,                             UT415
303700     MOVE        'Y' TO FIELD5,                                      UT415
303800     GO TO       BOOB.                                               UT415
303900                                                                     UT415
304000                                                                     UT415
304100 UT410-CONVERSION.                                                   UT415
304200                                                                     UT415
304300     MOVE        FIELD-TWO TO INPUT-VALUE.                           UT415
304400                                                                     UT415
304500     ENTER LINKAGE.                                                  UT415
304600     CALL 'DYNAMO' USING UT410, INPUT-PAR, OUTPUT-PAR.               UT415
304700     ENTER COBOL.                                                    UT415
304800                                                                     UT415
304900     IF          INDICATOR IS EQUAL TO ZERO,                         UT415
305000     MOVE        'U' TO FIELD5,                                      UT415
305100     GO TO       BOOB.                                               UT415
305200                                                                     UT415
305300     MOVE        PENCE TO FIELD-6.                                   UT415
305400     MOVE        ZEROS TO INPUT-VALUE.                               UT415
305500     MOVE        ZEROS TO PENCE.                                     UT415
305600                                                                     UT415
305700 RETURN-CONTROL.                                                     UT415
305800                                                                     UT415
305900     ENTER LINKAGE.                                                  UT415
306000     RETURN.                                                         UT415
306100     ENTER COBOL.                                                    UT415
306200                                                                     UT415
306300 BOOB.                                                               UT415
306400                                                                     UT415
306500     MOVE        ZEROS TO FIELD-2, FIELD-6.                          UT415
306600     GO TO       RETURN-CONTROL.                                     UT415
