 COLIN: PROC OPTIONS(MAIN);
          DCL
          SYSUT1 FILE RECORD SEQUENTIAL,
          SYSUT2 FILE RECORD SEQUENTIAL,
          SYSIN  FILE RECORD SEQUENTIAL,
          REC CHAR (80),
          1 CARD,
            3 FIL   CHAR (1),
            3 START PIC '99999',
           3 END   PIC '99999',
            3 FIX   CHAR (69);
     ON ENDFILE(SYSUT1) GO TO Z1;
     ON ENDFILE(SYSIN)  GO TO Z1;
     OPEN FILE(SYSUT1) INPUT;
     OPEN FILE(SYSUT2) OUTPUT;
     OPEN FILE(SYSIN) INPUT;
     I = 0;
     READ FILE(SYSIN) INTO(CARD);
 B1: READ FILE(SYSUT1) INTO(REC);
     I = I + 1;
 C1: IF I < START THEN GO TO B1;
     IF I > END THEN DO;
       READ FILE(SYSIN) INTO(CARD);
       GO TO C1;
     END;
     WRITE FILE(SYSUT2) FROM(REC);
     GO TO B1;
 Z1: CLOSE FILE(SYSUT1);
     CLOSE FILE(SYSUT2);
     CLOSE FILE(SYSIN);
     END;
