//PSGUT502  JOB  (1580,5),'0252 TEST    ',CLASS=N
//GO   EXEC   PGM=UT502,PARM='SHIFTED: NOSHFT:-NOSHIFT:@$EXPLICIT NO'
//STEPLIB   DD   DSN=SYS2.TESTLIB,DISP=SHR
//SYSPRINT   DD   SYSOUT=A
//SYSUT2   DD   SYSOUT=A
//SYSABEND   DD   SYSOUT=A
//SYSIN   DD   *
 NOSHIFT:
SHIFTED:NOSHIFT:./ NOSHIFT:A LONG ONE FOR THE NANCE:FOURTH IN A STRING
-NOSHIFT:
