         MACRO                                                            007000
&NAME CSECTID  &DUMMY,&DSECT=YES,&ID=                                     007010
         AIF   ('&DSECT' EQ 'NO').A01                                     007020
***********************************************************************   007030
*        CSECT IDENTIFICATION PREFIX                                  *   007040
***********************************************************************   007050
         SPACE 1                                                          007060
CSECTID  DSECT                                                            007070
CSIDBOOT DS    CL16                BOOTSTRAP TEXT TO BRANCH TO PARROT     007080
*                                   ( TO ALLOW FOR USE OF THIS CSECT      007090
*                                   NAME AS AN ALIAS OF PARROT)           007100
CSIDNAME DS    CL8                 NAME OF THE CSECT ( 'PARROTXX' )       007110
CSIDVERS DC    CL8'VERS N.N'       VERSION NUMBER OF PARROT               007120
CSIDDATE DC    CL8'01JAN99'        DATE WHEN MODULE WAS ASSEMBLED         007130
CSIDTIME DC    CL8'HH.MM.SS'       TIME WHEN MODULE WAS ASSEMBLED         007140
CSIDLGTH EQU   *-CSECTID           LENGTH OF CSECT IDENTIFCIATION PREFX   007150
         SPACE 5                                                          007160
*        EVERY SUB-CSECT IN THE PARROT SUITE OF MODULES STARTS WITH       007170
*         THIS 32-BYTE PREFIX TO IDENTIFY THE MODULE FOR DEBUGGING        007180
*         PURPOSES.  ALSO, THE CCB ( CENTRAL CONTROL BLOCK ) IS           007190
*         IMMEDIATELY PRECEDED BY AN IDENTICAL PREFIX.                    007200
         MEXIT                                                            007210
.A01     ANOP                                                             007220
         AIF   ('&SYSECT' NE 'PARROT').A02                                007230
         DC    CL16'MONSANTO EUROPE'                                      007240
         AGO   .A03                                                       007250
.A02     ANOP                                                             007260
         L     R15,8(R15)          GET ADDRESS OF PRIMARY ENTRY POINT     007270
         BR    R15                 GO TO TRUE ENTRY POINT                 007280
         DC    V(PARROT)           ADDRESS OF PRIMARY ENTRY POINT         007290
         DS    0D                  ENSURE ALIGNMENT                       007300
.A03     ANOP                                                             007310
         DC    CL8'PARROT&ID'      CSECT NAME                             007320
         DC    C'VERS 3.0'         PARROT VERSION NUMBER                  007330
         DC    CL8'&SYSDATE'       DATE CSECT ASSEMBLED                   007340
         DC    CL8'&SYSTIME'       TIME CSECT ASSEMBLED                   007350
         MEND                                                             007360
