         MACRO                                                            018720
&NAME    DCE   &DUMMY                                                     018730
***********************************************************************   018740
*        DCE - DATE CONVERSION ELEMENT                                *   018750
***********************************************************************   018760
         SPACE 1                                                          018770
DCENTRY  DSECT                                                            018780
DCEID    DS    0CL1                CONTROL BLOCK IDENTIFIER               018790
DCEDCE   DS    F                   ADDRESS OF NEXT DCE IN CHAIN           018800
DCELABL  DS    CL2                 LABEL FROM CONTROL CARD                018810
DCESW    DS    CL1                 SWITCH BYTE                            018820
DCELGTH  EQU   *-DCENTRY           LENGTH OF CONTROL BLOCK                018830
         MEND                                                             018840
