         MACRO                                                            007800
&NAME    FSA  &DUMMY                                                      007810
***********************************************************************   007820
*        FSA - FIELD STORAGE AREA                                     *   007830
***********************************************************************   007840
         SPACE 1                                                          007850
*        THIS CONTROL BLOCK IS A STORAGE AREA FOR THE VALUE(S) OF A       007860
*         SINGLE FIELD.  FOR NON-NUMERIC FIELDS, IT IS A SINGLE AREA OF   007870
*         THE APPROPRITAE LENGTH, INITIALISED AT END OF RECORD            007880
*         PROCESSING.  FOR THE NUMERIC FIELDS, THERE IS A FLOATING        007890
*         POINT ACCUMULATOR FOR THE TOTAL FILE, FOR THE INDIVIDUAL        007900
*         RECORD, AND FOR EVERY KEY BREAK.                                007910
         SPACE 1                                                          007920
*        FSA'S ARE ALSO ACQUIRED TO STORE THE CURRENT AND NEXT KEY AND    007930
*         KEY-NAME VALUES.  IN EACH CASE, A DOUBLE-SIZE STORAGE AREA IS   007940
*         ACQUIRED, AND IS ADDRESSED BY THE KBD AS WELL AS THE LIB.       007950
*         NOT THAT, EVEN THOUGH THE KEY FIELD MAY BEA NUMERIC FIELD,      007960
*         NUMERIC ACCUMULATORS FOR EVERY KEY LEVEL ARE NOT ACQUIRED.      007970
         SPACE 1                                                          007980
*        THE LOGIC OF THE INTERNAL GETMAIN ROUTINE IS SUCH THAT CONTROL   007990
*         BLOCKS ARE NOT NECESSARILY DOUBLEWORD ALIGNED, ALTHOUGH THEY    008000
*         ARE ALWAYS FULLWORD ALIGNED.  TO PREVENT SYSTEM DEGREDATION     008010
*         IN THE EVENT OF NON-DOUBLEWORD ALIGNMENT, THE FLOATING POINT    008020
*         ACCUMULATORS ARE NEVER USED DIRECTLY WITH FLOATING POINT        008030
*         REGISTERS, BUT ARE MOVED TO/FROM INTERMEDIATE, ALIGNED WORK     008040
*         AREAS.                                                          008050
         SPACE 1                                                          008060
FSANTRY  DSECT                                                            008070
FSALABL  DS    CL2                 LABEL OF FIELD STORED HEREIN           008080
FSASW    DS    CL1                 SWITCH BYTE                            008090
         DS    CL1                 UNUSED                                 008100
FSALGTH  EQU   *-FSANTRY           LENGTH OF BASIC DSECT                  008110
FSASTORE DS    0CL1                START OF STORAGE AREA                  008120
FSACHAR  DS    0CL1                VARIABLE LENGTH CHARACTER FIELD        008130
FSAVALUS DS    0CL8                ACCUMULATOR FOR SCALAR VALUE           008140
FSAVALUR DS    CL8                 ACCUMULATOR FOR INDIVIDUAL RECORD      008150
FSASLGTH EQU   *-FSANTRY           LENFRG OF FSA FOR SCALAR VALUE         008160
FSAVALUT DS    CL8                 ACCUMULATOR FOR TOTAL FILE             008170
FSANLGTH EQU   *-FSANTRY           LENGTH OF MINIMUM NUMERIC FSA          008180
FSAVALU1 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 1            008190
FSAVALU2 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 2            008200
FSAVALU3 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 3            008210
FSAVALU4 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 4            008220
FSAVALU5 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 5            008230
FSAVALU6 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 6            008240
FSAVALU7 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 7            008250
FSAVALU8 DS    CL8                 ACCUMULATOR FOR KEY LEVEL 8            008260
         MEND                                                             008270
