         MACRO                                                            019990
&NAME    GR03  &DUMMY                                                     020000
***********************************************************************   020010
*        FORMAT OF GR03 CONTROL CARDS                                 *   020020
***********************************************************************   020030
         SPACE 1                                                          020040
*        SPECIFY THE KEEY FIELDS                                          020050
         SPACE 1                                                          020060
GR03CARD DSECT                                                            020070
GR03ID   DS    CL4                 CARD ID ('GR03')                       020080
GR03KEY1 DS    0CL19               1ST KEY DEFINITION                     020090
GR03POS  DS    CL3                 POSN OF KEY FIELD                      020100
GR03LEN  DS    CL2                 LGTH OF KEY FIELD                      020110
GR03TYP  DS    CL1                 TYPE OF KEY FIELD                      020120
*                                   ' ' - UNPACKED NUMERIC                020130
*                                   'N' - UNPACKED NUMERIC                020140
*                                   'C' - CHARACTER                       020150
*                                   'P' - PACKED DECIMAL                  020160
*                                   'X' - HEXADECIMAL                     020170
GR03TOT  DS    CL1                 TOTAL BREAK INDICATOR                  020180
*                                   ' ' - NO TOTAL BREAK                  020190
*                                   'N' - NO TOTAL BREAK                  020200
*                                   'Y' - TOTAL BREAK                     020210
GR03PSKP DS    CL1                 PAGE SKIP INDICATOR                    020220
*                                   ' ' - NO PAGE SKIP                    020230
*                                   'N' - NO PAGE SKIP                    020240
*                                   'Y' - PAGE SKIP ON TOTAL BREAK        020250
*                                   'R' - PAGESKIP & RESET PAGE COUNTER   020260
GR03NPOS DS    CL3                 POSN O ASSOC NAME FIELD                020270
GR03NLEN DS    CL2                 LGTH O ASSOC NAME FIELD                020280
GR032080 DS    CL1                 TWENTY-80 INDICATOR ( KEY 1 ONLY )     020290
*                                   ' ' - NO TWENTY-80 REQUIRED           020300
*                                   'N' - NO TWENTY-80 REQUIRED           020310
*                                   'Y' - TWENTY-80 REQUIRED              020320
GR03PLIM DS    CL2                 PAGE LIMIT ( 1ST KEY ONLY )            020330
         ORG   GR032080            REDEFINE FOF ALL BUT 1ST KEY           020340
         DS    CL4                 UNUSED                                 020350
GR03KLBL DS    CL2                 (OPTIONAL) LABEL ASSOC WITH KEY FIEL   020360
GR03KEY2 DS    CL19                AS GR03POS - GR03NLEN                  020370
GR03KEY3 DS    CL19                AS GR03POS - GR03NLEN                  020380
GR03KEY4 DS    CL19                AS GR03POS - GR03NLEN                  020390
GR03LGTH EQU   *-GR03CARD          LENGTH OF DSECT                        020400
         SPACE 5                                                          020410
*        IF THE FIRST POSITION OF A KEY DEFINITION BUCKET CONTAINS '*',   020420
*         THEN THE BUCKET IS TREATED AS A COMMENT.                        020430
*        KEY DEFINITION MAY BE DEFERRED BY SPECIFYING 'FLDXX' IN PLACE    020440
*         OF THE  FIELD'S PPPLL.                                          020450
         MEND                                                             020460
