         MACRO                                                            020480
&NAME    GR04  &DUMMY                                                     020490
***********************************************************************   020500
*        FORMAT OF GR04 CONTROL CADS                                  *   020510
***********************************************************************   020520
         SPACE 1                                                          020530
*        DEFINE INPUT FIELDS                                              020540
         SPACE 1                                                          020550
GR04CARD DSECT                                                            020560
GR04ID   DS    CL4                 CARD ID ('GR04')                       020570
GR04FID  DS    CL2                 FIELD IDENTIFIER                       020580
GR04POS  DS    CL3                 POSN OF FIELD IN INPUT RECORD          020590
GR04LEN  DS    CL2                 LGTH OF FIELD IN INPUT RECORD          020600
GR04TYP  DS    CL1                 FIELD TYPE                             020610
*                                   ' ' - UNPACKED NUMERIC                020620
*                                   'N' - UNPACKED NUMERIC                020630
*                                   'P' - PACKED DECIMAL                  020640
*                                   'C' CHARACTER                         020650
*                                   'X' HEXADECIMAL                       020660
*                                   'S' - CREATE A SCALAR (NOT INPUT)     020670
GR04NDEC DS    CL1                 NUMBER OF DECIMALS ( ' ' = '0' )       020680
GR04KEY  DS    CL1                 KEY LEVEL UP TO WHICH VALUE IS TO BE   020690
*                                   MOVED INSTEAD OF ACCUMULATED.  BY     020700
*                                   DEFAULT, VALUE IS ACCUMULATED AT      020710
*                                   EVERY LEVEL.                          020720
GR04NZD  DS    CL1                 IF 'N', DO NOT ZEROISE ASSOCIATED      020730
*                                  ACCUMULATOR AT DETAIL LEVEL, BUT AT    020740
*                                  KEY LEVEL IN PREVIOUS BYTE.  THUS      020750
*                                  VALUE FROM 1 RECORD TYPE AVAILABLE     020760
*                                  WHEN ANOTHER TYPE IS PROCESSED.        020770
GR04UNUS DS    CL8                 UNUSED                                 020780
GR04TST1 DS    0CL19               OPTIONAL TEST TO QUALIFY FIELD.        020790
*                                   VALUE IS ASSOCIATED WITH A FIELD ID   020800
*                                   ONLY IF THESE TESTS ARE SATISFIED.    020810
*                                   OTHERWISE THE VALUE IS SET TO ZERO.   020820
GR04TPOS DS    CL3                 POSN OF FIELD TO BE TESTED             020830
GR04TLEN DS    CL2                 LGTH OF FIELD TO BE TESTED             020840
GR04TTYP DS    CL1                 FIELD TYPE                             020850
*                                   ' '/N/P/C/X/B                         020860
GR04TTST DS    CL2                 TEST TYPE ( GE/GT/LE/LT/EQ/NE/ON/OF)   020870
GR04TLIT DS    CL11                LITERAL OPERAND                        020880
GR04TST2 DS    CL19                AS GR04TPOS - GR04TLIT                 020890
GR04TST3 DS    CL19                AS GR04TPOS - GR04TLIT                 020900
GR04LGTH EQU   *-GR04CARD          LENGTH OF DSECT                        020910
         MEND                                                             020920
