         MACRO                                                            021250
&NAME    GR07  &DUMMY                                                     021260
***********************************************************************   021270
*        FORMAT OF GR07 CONTROL CARD                                  *   021280
***********************************************************************   021290
         SPACE 1                                                          021300
*        SPECIFY CALCULATIONS                                             021310
         SPACE 1                                                          021320
GR07CARD DSECT                                                            021330
GR07ID   DS    CL4                 CARD ID ('GR07')                       021340
GR07FID  DS    CL2                 FIELD NAME OR STATEMENT LABEL          021350
GR07CALC DS    0CL73               ARITHMETIC EXPRESSION                  021360
GR07TEST DS    CL4                 TEST IDENTIFIER ('TEST')               021370
GR07FLD1 DS    CL2                 ID OF FIELD TO BE TEESTED              021380
GR07TTYP DS    CL2                 TEST TYPE (EQ/NE/LT/LE/GT/GE/ON/OF)    021390
GR07FLD2 DS    CL2                 ID OF COMPARAND                        021400
*                                   OR '$K' ( CURRENT KEY LEVEL )         021410
GR07FLD3 DS    CL2                 ID OF GR07 STATEMENT TO WHICH TO       021420
*                                   TRANSFER CONTROL IF TEST SATISFIED    021430
*                                   OR $1 -ACCUMULATE BUT DO NOT PRINT    021440
*                                   OR $2 - DO NOT ACCUMULATE OR PRINT    021450
GR07$LIT DS    CL61                LITERAL COMPARAND ( FOR $L )           021460
GR07TOTT DS    CL1                 PROCESSING TIME INDICATOR              021470
*                                   ' ' - PERFORM AT DETAIL TIME          021480
*                                   'D' - PERFORM AT DETAIL TIME          021490
*                                   'T' - PERFORM AT TOTAL TIME           021500
*                                   OR A/B/C/E PROCESSING TIME            021510
GR07LGTH EQU   *-GR07CARD          LENGTH OF DSECT                        021520
         SPACE 5                                                          021530
*        SPECIAL FUNCTION GR07 CARDS                                      021540
         SPACE 1                                                          021550
*        GR07LLDATEPPPTPPPT        CONVERT DATE FROM 1 FORMAT TO ANOTHE   021560
*        GR07LLTIMEPPP             CONVERT EBCDIC HHMM (IN PPP) TO MINU   021570
*        GR07LLAVE(XX)                                                    021580
*        GR07LLMAX(XX)                                                    021590
*        GR07LLMIN(XX)                                                    021600
*        GR07LLRMS(XX)             ROOT MEAN SQUARE                       021610
*        GR07LLSDEV(XX)            STANDARD DEVIATION                     021620
         SPACE 5                                                          021630
*        ANYTHING FOLLOWING A '/*' IS TREATED AS A COMMENT.               021640
         MEND                                                             021650
