         MACRO                                                            018250
&NAME    JCL   &DUMMY                                                     018260
***********************************************************************   018270
*        JCL - JCL STATEMENT CONTROL LINKAGE                          *   018280
***********************************************************************   018290
         SPACE 1                                                          018300
JCLNTRY  DSECT                                                            018310
JCLID    DS    0CL1                CONTROL BLOCK IDENTIFIER               018320
JCLJCL   DS    F                   ADDRESS OF NEXT JCL                    018330
JCLSW    DS    CL1                 SWITCH BYTE                            018340
         DS    CL1                 UNUSED                                 018350
JCLLEN   DS    H                   LENGTH OF DD STATEMENT                 018360
JCLCARD  EQU   *                   VARIABLE LENGTH DD STATEMENT           018370
JCLLGTH  EQU   *-JCLNTRY           LENGTH OF BASIC C/B                    018380
         SPACE 5                                                          018390
         MEND                                                             018400
