         MACRO                                                            011670
&NAME    RST   &DUMMY                                                     011680
***********************************************************************   011690
*        RST - RECORD SELECTION TEST                                  *   011700
**********************************************************************    011710
         SPACE 1                                                          011720
RSTNTRY  DSECT                                                            011730
RSTID    DS    0CL1                CONTROL BLOCK IDENTIFIER               011740
RSTRST   DS    F                   ADDRESS OF NEXT RST                    011750
RSTSCE   DS    F                   ADDRESS OF 1ST ASSOC SCE               011760
RSTRCNT  DS    PL4                 NO OF RECORDS SELECTED BY THIS TEST    011770
RSTSW    DS    CL1                 SWITCH BYTE                            011780
RSTLGTH  EQU   *-RSTNTRY           LENGTH OF DSECT                        011790
         SPACE 5                                                          011800
MRSTDEL  EQU   1                   REJECT RECORD IF ALL TESTS SATISFIED   011810
         MEND                                                             011820
