         MACRO                                                            012470
&NAME    SPD   &DUMMY                                                     012480
***********************************************************************   012490
*        SPD - STORAGE POOL DEFINITION                                *   012500
***********************************************************************   012510
         SPACE 1                                                          012520
*        DEFINES AN AREA OF CORE ( EITHER ACQUIRED BY GETMAIN, OR         012530
*         CONSISTING OF A REDUNDANT CSECT ) AVAILABLE TO THE INTERNAL     012540
*         GETMAIN AND WORKFILE ROUTINES                                   012550
         SPACE 1                                                          012560
SPDNTRY  DSECT                                                            012570
SPDSW    DS    0CL1                SWITCH BYTE                            012580
SPDAPOOL DS    F                   ADDRESS OF STORAGE POOL                012590
SPDSPOOL DS    F                   SIZE OF STORAGE POOL                   012600
SPDLGTH  EQU   *-SPDNTRY           LENGTH OF DSECT                        012610
         SPACE 5                                                          012620
MSPDUSE  EQU   1                   STORAGE POOL AVAILABLE FOR USE         012630
MSPDWF   EQU   2                   STORAGE POOL BEING USED BY WORK FILE   012640
MSPDGETM EQU   4                   STORAGE POOL MUST BE ACQUIRED BY GET   012650
MSPDPFRE EQU   8                   STORAGE POOL MAY BE FREEMAINED         012660
MSPDFREE EQU   16                  STORAGE POOL HAS BEEN FREEMAINED       012670
MSPDCSCT EQU   32                  STORAGE POOL DEFINES A CSECT           012680
         MEND                                                             012690
